una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9g45.h
#define 	AT91C_DDRC2_TXSNR_224                  ((unsigned int) 0xE0 <<  8) // (HDDRSDRC2) Value : 224
#define 	AT91C_DDRC2_TXSNR_240                  ((unsigned int) 0xF0 <<  8) // (HDDRSDRC2) Value : 240
#define 	AT91C_DDRC2_TXSNR_255                  ((unsigned int) 0xFF <<  8) // (HDDRSDRC2) Value : 255
#define AT91C_DDRC2_TXSRD     ((unsigned int) 0xFF << 16) // (HDDRSDRC2) Exit self refresh delay to Read command
#define 	AT91C_DDRC2_TXSRD_0                    ((unsigned int) 0x0 << 16) // (HDDRSDRC2) Value :   0
#define 	AT91C_DDRC2_TXSRD_8                    ((unsigned int) 0x8 << 16) // (HDDRSDRC2) Value :   8
#define 	AT91C_DDRC2_TXSRD_16                   ((unsigned int) 0x10 << 16) // (HDDRSDRC2) Value :  16
#define 	AT91C_DDRC2_TXSRD_32                   ((unsigned int) 0x20 << 16) // (HDDRSDRC2) Value :  32
#define 	AT91C_DDRC2_TXSRD_48                   ((unsigned int) 0x30 << 16) // (HDDRSDRC2) Value :  48
#define 	AT91C_DDRC2_TXSRD_64                   ((unsigned int) 0x40 << 16) // (HDDRSDRC2) Value :  64
#define 	AT91C_DDRC2_TXSRD_80                   ((unsigned int) 0x50 << 16) // (HDDRSDRC2) Value :  80
#define 	AT91C_DDRC2_TXSRD_96                   ((unsigned int) 0x60 << 16) // (HDDRSDRC2) Value :  96
#define 	AT91C_DDRC2_TXSRD_112                  ((unsigned int) 0x70 << 16) // (HDDRSDRC2) Value : 112
#define 	AT91C_DDRC2_TXSRD_128                  ((unsigned int) 0x80 << 16) // (HDDRSDRC2) Value : 128
#define 	AT91C_DDRC2_TXSRD_144                  ((unsigned int) 0x90 << 16) // (HDDRSDRC2) Value : 144
#define 	AT91C_DDRC2_TXSRD_160                  ((unsigned int) 0xA0 << 16) // (HDDRSDRC2) Value : 160
#define 	AT91C_DDRC2_TXSRD_176                  ((unsigned int) 0xB0 << 16) // (HDDRSDRC2) Value : 176
#define 	AT91C_DDRC2_TXSRD_192                  ((unsigned int) 0xC0 << 16) // (HDDRSDRC2) Value : 192
#define 	AT91C_DDRC2_TXSRD_208                  ((unsigned int) 0xD0 << 16) // (HDDRSDRC2) Value : 208
#define 	AT91C_DDRC2_TXSRD_224                  ((unsigned int) 0xE0 << 16) // (HDDRSDRC2) Value : 224
#define 	AT91C_DDRC2_TXSRD_240                  ((unsigned int) 0xF0 << 16) // (HDDRSDRC2) Value : 240
#define 	AT91C_DDRC2_TXSRD_255                  ((unsigned int) 0xFF << 16) // (HDDRSDRC2) Value : 255
#define AT91C_DDRC2_TXP       ((unsigned int) 0xF << 24) // (HDDRSDRC2) Exit Power-down delay to first command
#define 	AT91C_DDRC2_TXP_0                    ((unsigned int) 0x0 << 24) // (HDDRSDRC2) Value :  0
#define 	AT91C_DDRC2_TXP_1                    ((unsigned int) 0x1 << 24) // (HDDRSDRC2) Value :  1
#define 	AT91C_DDRC2_TXP_2                    ((unsigned int) 0x2 << 24) // (HDDRSDRC2) Value :  2
#define 	AT91C_DDRC2_TXP_3                    ((unsigned int) 0x3 << 24) // (HDDRSDRC2) Value :  3
#define 	AT91C_DDRC2_TXP_4                    ((unsigned int) 0x4 << 24) // (HDDRSDRC2) Value :  4
#define 	AT91C_DDRC2_TXP_5                    ((unsigned int) 0x5 << 24) // (HDDRSDRC2) Value :  5
#define 	AT91C_DDRC2_TXP_6                    ((unsigned int) 0x6 << 24) // (HDDRSDRC2) Value :  6
#define 	AT91C_DDRC2_TXP_7                    ((unsigned int) 0x7 << 24) // (HDDRSDRC2) Value :  7
#define 	AT91C_DDRC2_TXP_8                    ((unsigned int) 0x8 << 24) // (HDDRSDRC2) Value :  8
#define 	AT91C_DDRC2_TXP_9                    ((unsigned int) 0x9 << 24) // (HDDRSDRC2) Value :  9
#define 	AT91C_DDRC2_TXP_10                   ((unsigned int) 0xA << 24) // (HDDRSDRC2) Value : 10
#define 	AT91C_DDRC2_TXP_11                   ((unsigned int) 0xB << 24) // (HDDRSDRC2) Value : 11
#define 	AT91C_DDRC2_TXP_12                   ((unsigned int) 0xC << 24) // (HDDRSDRC2) Value : 12
#define 	AT91C_DDRC2_TXP_13                   ((unsigned int) 0xD << 24) // (HDDRSDRC2) Value : 13
#define 	AT91C_DDRC2_TXP_14                   ((unsigned int) 0xE << 24) // (HDDRSDRC2) Value : 14
#define 	AT91C_DDRC2_TXP_15                   ((unsigned int) 0xF << 24) // (HDDRSDRC2) Value : 15
// -------- HDDRSDRC2_T2PR : (HDDRSDRC2 Offset: 0x14) Timing2 Register -------- 
#define AT91C_DDRC2_TXARD     ((unsigned int) 0xF <<  0) // (HDDRSDRC2) Exit active power down delay to read command in 'Fast Exit' mode.
#define 	AT91C_DDRC2_TXARD_0                    ((unsigned int) 0x0) // (HDDRSDRC2) Value :  0
#define 	AT91C_DDRC2_TXARD_1                    ((unsigned int) 0x1) // (HDDRSDRC2) Value :  1
#define 	AT91C_DDRC2_TXARD_2                    ((unsigned int) 0x2) // (HDDRSDRC2) Value :  2
#define 	AT91C_DDRC2_TXARD_3                    ((unsigned int) 0x3) // (HDDRSDRC2) Value :  3
#define 	AT91C_DDRC2_TXARD_4                    ((unsigned int) 0x4) // (HDDRSDRC2) Value :  4
#define 	AT91C_DDRC2_TXARD_5                    ((unsigned int) 0x5) // (HDDRSDRC2) Value :  5
#define 	AT91C_DDRC2_TXARD_6                    ((unsigned int) 0x6) // (HDDRSDRC2) Value :  6
#define 	AT91C_DDRC2_TXARD_7                    ((unsigned int) 0x7) // (HDDRSDRC2) Value :  7
#define 	AT91C_DDRC2_TXARD_8                    ((unsigned int) 0x8) // (HDDRSDRC2) Value :  8
#define 	AT91C_DDRC2_TXARD_9                    ((unsigned int) 0x9) // (HDDRSDRC2) Value :  9
#define 	AT91C_DDRC2_TXARD_10                   ((unsigned int) 0xA) // (HDDRSDRC2) Value : 10
#define 	AT91C_DDRC2_TXARD_11                   ((unsigned int) 0xB) // (HDDRSDRC2) Value : 11
#define 	AT91C_DDRC2_TXARD_12                   ((unsigned int) 0xC) // (HDDRSDRC2) Value : 12
#define 	AT91C_DDRC2_TXARD_13                   ((unsigned int) 0xD) // (HDDRSDRC2) Value : 13
#define 	AT91C_DDRC2_TXARD_14                   ((unsigned int) 0xE) // (HDDRSDRC2) Value : 14
#define 	AT91C_DDRC2_TXARD_15                   ((unsigned int) 0xF) // (HDDRSDRC2) Value : 15
#define AT91C_DDRC2_TXARDS    ((unsigned int) 0xF <<  8) // (HDDRSDRC2) Exit active power down delay to read command in 'Slow Exit' mode.
#define 	AT91C_DDRC2_TXARDS_0                    ((unsigned int) 0x0 <<  8) // (HDDRSDRC2) Value :  0
#define 	AT91C_DDRC2_TXARDS_1                    ((unsigned int) 0x1 <<  8) // (HDDRSDRC2) Value :  1
#define 	AT91C_DDRC2_TXARDS_2                    ((unsigned int) 0x2 <<  8) // (HDDRSDRC2) Value :  2
#define 	AT91C_DDRC2_TXARDS_3                    ((unsigned int) 0x3 <<  8) // (HDDRSDRC2) Value :  3
#define 	AT91C_DDRC2_TXARDS_4                    ((unsigned int) 0x4 <<  8) // (HDDRSDRC2) Value :  4
#define 	AT91C_DDRC2_TXARDS_5                    ((unsigned int) 0x5 <<  8) // (HDDRSDRC2) Value :  5
#define 	AT91C_DDRC2_TXARDS_6                    ((unsigned int) 0x6 <<  8) // (HDDRSDRC2) Value :  6
#define 	AT91C_DDRC2_TXARDS_7                    ((unsigned int) 0x7 <<  8) // (HDDRSDRC2) Value :  7
#define 	AT91C_DDRC2_TXARDS_8                    ((unsigned int) 0x8 <<  8) // (HDDRSDRC2) Value :  8
#define 	AT91C_DDRC2_TXARDS_9                    ((unsigned int) 0x9 <<  8) // (HDDRSDRC2) Value :  9
#define 	AT91C_DDRC2_TXARDS_10                   ((unsigned int) 0xA <<  8) // (HDDRSDRC2) Value : 10
#define 	AT91C_DDRC2_TXARDS_11                   ((unsigned int) 0xB <<  8) // (HDDRSDRC2) Value : 11
#define 	AT91C_DDRC2_TXARDS_12                   ((unsigned int) 0xC <<  8) // (HDDRSDRC2) Value : 12
#define 	AT91C_DDRC2_TXARDS_13                   ((unsigned int) 0xD <<  8) // (HDDRSDRC2) Value : 13
#define 	AT91C_DDRC2_TXARDS_14                   ((unsigned int) 0xE <<  8) // (HDDRSDRC2) Value : 14
#define 	AT91C_DDRC2_TXARDS_15                   ((unsigned int) 0xF <<  8) // (HDDRSDRC2) Value : 15
#define AT91C_DDRC2_TRPA      ((unsigned int) 0xF << 16) // (HDDRSDRC2) Row precharge all delay
#define 	AT91C_DDRC2_TRPA_0                    ((unsigned int) 0x0 << 16) // (HDDRSDRC2) Value :  0
#define 	AT91C_DDRC2_TRPA_1                    ((unsigned int) 0x1 << 16) // (HDDRSDRC2) Value :  1
#define 	AT91C_DDRC2_TRPA_2                    ((unsigned int) 0x2 << 16) // (HDDRSDRC2) Value :  2
#define 	AT91C_DDRC2_TRPA_3                    ((unsigned int) 0x3 << 16) // (HDDRSDRC2) Value :  3
#define 	AT91C_DDRC2_TRPA_4                    ((unsigned int) 0x4 << 16) // (HDDRSDRC2) Value :  4
#define 	AT91C_DDRC2_TRPA_5                    ((unsigned int) 0x5 << 16) // (HDDRSDRC2) Value :  5
#define 	AT91C_DDRC2_TRPA_6                    ((unsigned int) 0x6 << 16) // (HDDRSDRC2) Value :  6
#define 	AT91C_DDRC2_TRPA_7                    ((unsigned int) 0x7 << 16) // (HDDRSDRC2) Value :  7
#define 	AT91C_DDRC2_TRPA_8                    ((unsigned int) 0x8 << 16) // (HDDRSDRC2) Value :  8
#define 	AT91C_DDRC2_TRPA_9                    ((unsigned int) 0x9 << 16) // (HDDRSDRC2) Value :  9
#define 	AT91C_DDRC2_TRPA_10                   ((unsigned int) 0xA << 16) // (HDDRSDRC2) Value : 10
#define 	AT91C_DDRC2_TRPA_11                   ((unsigned int) 0xB << 16) // (HDDRSDRC2) Value : 11
#define 	AT91C_DDRC2_TRPA_12                   ((unsigned int) 0xC << 16) // (HDDRSDRC2) Value : 12
#define 	AT91C_DDRC2_TRPA_13                   ((unsigned int) 0xD << 16) // (HDDRSDRC2) Value : 13
#define 	AT91C_DDRC2_TRPA_14                   ((unsigned int) 0xE << 16) // (HDDRSDRC2) Value : 14
#define 	AT91C_DDRC2_TRPA_15                   ((unsigned int) 0xF << 16) // (HDDRSDRC2) Value : 15
#define AT91C_DDRC2_TRTP      ((unsigned int) 0xF << 24) // (HDDRSDRC2) Read to Precharge delay
#define 	AT91C_DDRC2_TRTP_0                    ((unsigned int) 0x0 << 24) // (HDDRSDRC2) Value :  0
#define 	AT91C_DDRC2_TRTP_1                    ((unsigned int) 0x1 << 24) // (HDDRSDRC2) Value :  1
#define 	AT91C_DDRC2_TRTP_2                    ((unsigned int) 0x2 << 24) // (HDDRSDRC2) Value :  2
#define 	AT91C_DDRC2_TRTP_3                    ((unsigned int) 0x3 << 24) // (HDDRSDRC2) Value :  3
#define 	AT91C_DDRC2_TRTP_4                    ((unsigned int) 0x4 << 24) // (HDDRSDRC2) Value :  4
#define 	AT91C_DDRC2_TRTP_5                    ((unsigned int) 0x5 << 24) // (HDDRSDRC2) Value :  5
#define 	AT91C_DDRC2_TRTP_6                    ((unsigned int) 0x6 << 24) // (HDDRSDRC2) Value :  6
#define 	AT91C_DDRC2_TRTP_7                    ((unsigned int) 0x7 << 24) // (HDDRSDRC2) Value :  7
#define 	AT91C_DDRC2_TRTP_8                    ((unsigned int) 0x8 << 24) // (HDDRSDRC2) Value :  8
#define 	AT91C_DDRC2_TRTP_9                    ((unsigned int) 0x9 << 24) // (HDDRSDRC2) Value :  9
#define 	AT91C_DDRC2_TRTP_10                   ((unsigned int) 0xA << 24) // (HDDRSDRC2) Value : 10
#define 	AT91C_DDRC2_TRTP_11                   ((unsigned int) 0xB << 24) // (HDDRSDRC2) Value : 11
#define 	AT91C_DDRC2_TRTP_12                   ((unsigned int) 0xC << 24) // (HDDRSDRC2) Value : 12
#define 	AT91C_DDRC2_TRTP_13                   ((unsigned int) 0xD << 24) // (HDDRSDRC2) Value : 13
#define 	AT91C_DDRC2_TRTP_14                   ((unsigned int) 0xE << 24) // (HDDRSDRC2) Value : 14
#define 	AT91C_DDRC2_TRTP_15                   ((unsigned int) 0xF << 24) // (HDDRSDRC2) Value : 15
// -------- HDDRSDRC2_T3PR : (HDDRSDRC2 Offset: 0x18) Timing3 Register -------- 
#define AT91C_DDRC2_TANPD     ((unsigned int) 0xF <<  0) // (HDDRSDRC2) ODT to power down entry
#define 	AT91C_DDRC2_TANPD_0                    ((unsigned int) 0x0) // (HDDRSDRC2) Value :  0
#define 	AT91C_DDRC2_TANPD_1                    ((unsigned int) 0x1) // (HDDRSDRC2) Value :  1
#define 	AT91C_DDRC2_TANPD_2                    ((unsigned int) 0x2) // (HDDRSDRC2) Value :  2
#define 	AT91C_DDRC2_TANPD_3                    ((unsigned int) 0x3) // (HDDRSDRC2) Value :  3
#define 	AT91C_DDRC2_TANPD_4                    ((unsigned int) 0x4) // (HDDRSDRC2) Value :  4
#define 	AT91C_DDRC2_TANPD_5                    ((unsigned int) 0x5) // (HDDRSDRC2) Value :  5
#define 	AT91C_DDRC2_TANPD_6                    ((unsigned int) 0x6) // (HDDRSDRC2) Value :  6
#define 	AT91C_DDRC2_TANPD_7                    ((unsigned int) 0x7) // (HDDRSDRC2) Value :  7
#define 	AT91C_DDRC2_TANPD_8                    ((unsigned int) 0x8) // (HDDRSDRC2) Value :  8
#define 	AT91C_DDRC2_TANPD_9                    ((unsigned int) 0x9) // (HDDRSDRC2) Value :  9
#define 	AT91C_DDRC2_TANPD_10                   ((unsigned int) 0xA) // (HDDRSDRC2) Value : 10
#define 	AT91C_DDRC2_TANPD_11                   ((unsigned int) 0xB) // (HDDRSDRC2) Value : 11
#define 	AT91C_DDRC2_TANPD_12                   ((unsigned int) 0xC) // (HDDRSDRC2) Value : 12
#define 	AT91C_DDRC2_TANPD_13                   ((unsigned int) 0xD) // (HDDRSDRC2) Value : 13
#define 	AT91C_DDRC2_TANPD_14                   ((unsigned int) 0xE) // (HDDRSDRC2) Value : 14
#define 	AT91C_DDRC2_TANPD_15                   ((unsigned int) 0xF) // (HDDRSDRC2) Value : 15
#define AT91C_DDRC2_TAXPD     ((unsigned int) 0xF <<  4) // (HDDRSDRC2) ODT power down exit
#define 	AT91C_DDRC2_TAXPD_0                    ((unsigned int) 0x0 <<  4) // (HDDRSDRC2) Value :  0
#define 	AT91C_DDRC2_TAXPD_1                    ((unsigned int) 0x1 <<  4) // (HDDRSDRC2) Value :  1
#define 	AT91C_DDRC2_TAXPD_2                    ((unsigned int) 0x2 <<  4) // (HDDRSDRC2) Value :  2
#define 	AT91C_DDRC2_TAXPD_3                    ((unsigned int) 0x3 <<  4) // (HDDRSDRC2) Value :  3
#define 	AT91C_DDRC2_TAXPD_4                    ((unsigned int) 0x4 <<  4) // (HDDRSDRC2) Value :  4
#define 	AT91C_DDRC2_TAXPD_5                    ((unsigned int) 0x5 <<  4) // (HDDRSDRC2) Value :  5
#define 	AT91C_DDRC2_TAXPD_6                    ((unsigned int) 0x6 <<  4) // (HDDRSDRC2) Value :  6
#define 	AT91C_DDRC2_TAXPD_7                    ((unsigned int) 0x7 <<  4) // (HDDRSDRC2) Value :  7
#define 	AT91C_DDRC2_TAXPD_8                    ((unsigned int) 0x8 <<  4) // (HDDRSDRC2) Value :  8
#define 	AT91C_DDRC2_TAXPD_9                    ((unsigned int) 0x9 <<  4) // (HDDRSDRC2) Value :  9
#define 	AT91C_DDRC2_TAXPD_10                   ((unsigned int) 0xA <<  4) // (HDDRSDRC2) Value : 10
#define 	AT91C_DDRC2_TAXPD_11                   ((unsigned int) 0xB <<  4) // (HDDRSDRC2) Value : 11
#define 	AT91C_DDRC2_TAXPD_12                   ((unsigned int) 0xC <<  4) // (HDDRSDRC2) Value : 12
#define 	AT91C_DDRC2_TAXPD_13                   ((unsigned int) 0xD <<  4) // (HDDRSDRC2) Value : 13
#define 	AT91C_DDRC2_TAXPD_14                   ((unsigned int) 0xE <<  4) // (HDDRSDRC2) Value : 14
#define 	AT91C_DDRC2_TAXPD_15                   ((unsigned int) 0xF <<  4) // (HDDRSDRC2) Value : 15
#define AT91C_DDRC2_TAOFPD    ((unsigned int) 0xF <<  8) // (HDDRSDRC2) ODT turn off in power down mode
#define 	AT91C_DDRC2_TAOFPD_0                    ((unsigned int) 0x0 <<  8) // (HDDRSDRC2) Value :  0
#define 	AT91C_DDRC2_TAOFPD_1                    ((unsigned int) 0x1 <<  8) // (HDDRSDRC2) Value :  1
#define 	AT91C_DDRC2_TAOFPD_2                    ((unsigned int) 0x2 <<  8) // (HDDRSDRC2) Value :  2
#define 	AT91C_DDRC2_TAOFPD_3                    ((unsigned int) 0x3 <<  8) // (HDDRSDRC2) Value :  3
#define 	AT91C_DDRC2_TAOFPD_4                    ((unsigned int) 0x4 <<  8) // (HDDRSDRC2) Value :  4
#define 	AT91C_DDRC2_TAOFPD_5                    ((unsigned int) 0x5 <<  8) // (HDDRSDRC2) Value :  5
#define 	AT91C_DDRC2_TAOFPD_6                    ((unsigned int) 0x6 <<  8) // (HDDRSDRC2) Value :  6
#define 	AT91C_DDRC2_TAOFPD_7                    ((unsigned int) 0x7 <<  8) // (HDDRSDRC2) Value :  7
#define 	AT91C_DDRC2_TAOFPD_8                    ((unsigned int) 0x8 <<  8) // (HDDRSDRC2) Value :  8
#define 	AT91C_DDRC2_TAOFPD_9                    ((unsigned int) 0x9 <<  8) // (HDDRSDRC2) Value :  9
#define 	AT91C_DDRC2_TAOFPD_10                   ((unsigned int) 0xA <<  8) // (HDDRSDRC2) Value : 10
#define 	AT91C_DDRC2_TAOFPD_11                   ((unsigned int) 0xB <<  8) // (HDDRSDRC2) Value : 11
#define 	AT91C_DDRC2_TAOFPD_12                   ((unsigned int) 0xC <<  8) // (HDDRSDRC2) Value : 12
#define 	AT91C_DDRC2_TAOFPD_13                   ((unsigned int) 0xD <<  8) // (HDDRSDRC2) Value : 13
#define 	AT91C_DDRC2_TAOFPD_14                   ((unsigned int) 0xE <<  8) // (HDDRSDRC2) Value : 14
#define 	AT91C_DDRC2_TAOFPD_15                   ((unsigned int) 0xF <<  8) // (HDDRSDRC2) Value : 15
#define AT91C_DDRC2_TAOFD     ((unsigned int) 0xF << 12) // (HDDRSDRC2) ODT turn off delay
#define 	AT91C_DDRC2_TAOFD_0                    ((unsigned int) 0x0 << 12) // (HDDRSDRC2) Value :  0
#define 	AT91C_DDRC2_TAOFD_1                    ((unsigned int) 0x1 << 12) // (HDDRSDRC2) Value :  1
#define 	AT91C_DDRC2_TAOFD_2                    ((unsigned int) 0x2 << 12) // (HDDRSDRC2) Value :  2
#define 	AT91C_DDRC2_TAOFD_3                    ((unsigned int) 0x3 << 12) // (HDDRSDRC2) Value :  3
#define 	AT91C_DDRC2_TAOFD_4                    ((unsigned int) 0x4 << 12) // (HDDRSDRC2) Value :  4
#define 	AT91C_DDRC2_TAOFD_5                    ((unsigned int) 0x5 << 12) // (HDDRSDRC2) Value :  5
#define 	AT91C_DDRC2_TAOFD_6                    ((unsigned int) 0x6 << 12) // (HDDRSDRC2) Value :  6
#define 	AT91C_DDRC2_TAOFD_7                    ((unsigned int) 0x7 << 12) // (HDDRSDRC2) Value :  7
#define 	AT91C_DDRC2_TAOFD_8                    ((unsigned int) 0x8 << 12) // (HDDRSDRC2) Value :  8
#define 	AT91C_DDRC2_TAOFD_9                    ((unsigned int) 0x9 << 12) // (HDDRSDRC2) Value :  9
#define 	AT91C_DDRC2_TAOFD_10                   ((unsigned int) 0xA << 12) // (HDDRSDRC2) Value : 10
#define 	AT91C_DDRC2_TAOFD_11                   ((unsigned int) 0xB << 12) // (HDDRSDRC2) Value : 11
#define 	AT91C_DDRC2_TAOFD_12                   ((unsigned int) 0xC << 12) // (HDDRSDRC2) Value : 12
#define 	AT91C_DDRC2_TAOFD_13                   ((unsigned int) 0xD << 12) // (HDDRSDRC2) Value : 13
#define 	AT91C_DDRC2_TAOFD_14                   ((unsigned int) 0xE << 12) // (HDDRSDRC2) Value : 14
#define 	AT91C_DDRC2_TAOFD_15                   ((unsigned int) 0xF << 12) // (HDDRSDRC2) Value : 15
#define AT91C_DDRC2_TAONPD    ((unsigned int) 0xF << 16) // (HDDRSDRC2) ODT turn on in power down mode
#define 	AT91C_DDRC2_TAONPD_0                    ((unsigned int) 0x0 << 16) // (HDDRSDRC2) Value :  0
#define 	AT91C_DDRC2_TAONPD_1                    ((unsigned int) 0x1 << 16) // (HDDRSDRC2) Value :  1
#define 	AT91C_DDRC2_TAONPD_2                    ((unsigned int) 0x2 << 16) // (HDDRSDRC2) Value :  2
#define 	AT91C_DDRC2_TAONPD_3                    ((unsigned int) 0x3 << 16) // (HDDRSDRC2) Value :  3
#define 	AT91C_DDRC2_TAONPD_4                    ((unsigned int) 0x4 << 16) // (HDDRSDRC2) Value :  4
#define 	AT91C_DDRC2_TAONPD_5                    ((unsigned int) 0x5 << 16) // (HDDRSDRC2) Value :  5
#define 	AT91C_DDRC2_TAONPD_6                    ((unsigned int) 0x6 << 16) // (HDDRSDRC2) Value :  6
#define 	AT91C_DDRC2_TAONPD_7                    ((unsigned int) 0x7 << 16) // (HDDRSDRC2) Value :  7
#define 	AT91C_DDRC2_TAONPD_8                    ((unsigned int) 0x8 << 16) // (HDDRSDRC2) Value :  8
#define 	AT91C_DDRC2_TAONPD_9                    ((unsigned int) 0x9 << 16) // (HDDRSDRC2) Value :  9
#define 	AT91C_DDRC2_TAONPD_10                   ((unsigned int) 0xA << 16) // (HDDRSDRC2) Value : 10
#define 	AT91C_DDRC2_TAONPD_11                   ((unsigned int) 0xB << 16) // (HDDRSDRC2) Value : 11
#define 	AT91C_DDRC2_TAONPD_12                   ((unsigned int) 0xC << 16) // (HDDRSDRC2) Value : 12
#define 	AT91C_DDRC2_TAONPD_13                   ((unsigned int) 0xD << 16) // (HDDRSDRC2) Value : 13
#define 	AT91C_DDRC2_TAONPD_14                   ((unsigned int) 0xE << 16) // (HDDRSDRC2) Value : 14
#define 	AT91C_DDRC2_TAONPD_15                   ((unsigned int) 0xF << 16) // (HDDRSDRC2) Value : 15
// -------- HDDRSDRC2_LPR : (HDDRSDRC2 Offset: 0x1c)  -------- 
#define AT91C_DDRC2_LPCB      ((unsigned int) 0x3 <<  0) // (HDDRSDRC2) Low-power Command Bit
#define 	AT91C_DDRC2_LPCB_DISABLED             ((unsigned int) 0x0) // (HDDRSDRC2) Low-power Feature is inhibited: no power-down, self refresh and Deep power mode are issued to the SDRAM device.
#define 	AT91C_DDRC2_LPCB_SELFREFRESH          ((unsigned int) 0x1) // (HDDRSDRC2) The DDRSDRAMC Controller issues a Self Refresh Command to the SDRAM device, the clock(s) is/are de-activated and the CKE signal is set low. The SDRAM device leaves the self refresh mode when accessed and enters it after the access.
#define 	AT91C_DDRC2_LPCB_POWERDOWN            ((unsigned int) 0x2) // (HDDRSDRC2) The HDDRSDRC2 Controller issues a Power-down Command to the SDRAM device after each access, the CKE signal is set low. The SDRAM device leaves the power-down mode when accessed and enters it after the access.
#define 	AT91C_DDRC2_LPCB_DEEP_PWD             ((unsigned int) 0x3) // (HDDRSDRC2) The HDDRSDRC2 Controller issues a Deep Power-down Command to the Mobile SDRAM device. This mode is unique to Mobile SDRAM devices
#define AT91C_DDRC2_CLK_FR    ((unsigned int) 0x1 <<  2) // (HDDRSDRC2) Clock frozen Command Bit
#define 	AT91C_DDRC2_CLK_FR_DISABLED             ((unsigned int) 0x0 <<  2) // (HDDRSDRC2) Low-power Feature is inhibited: no power-down, self refresh and Deep power mode are issued to the SDRAM device.
#define 	AT91C_DDRC2_CLK_FR_SELFREFRESH          ((unsigned int) 0x1 <<  2) // (HDDRSDRC2) The DDRSDRAMC Controller issues a Self Refresh Command to the SDRAM device, the clock(s) is/are de-activated and the CKE signal is set low. The SDRAM device leaves the self refresh mode when accessed and enters it after the access.
#define 	AT91C_DDRC2_CLK_FR_POWERDOWN            ((unsigned int) 0x2 <<  2) // (HDDRSDRC2) The HDDRSDRC2 Controller issues a Power-down Command to the SDRAM device after each access, the CKE signal is set low. The SDRAM device leaves the power-down mode when accessed and enters it after the access.
#define 	AT91C_DDRC2_CLK_FR_DEEP_PWD             ((unsigned int) 0x3 <<  2) // (HDDRSDRC2) The HDDRSDRC2 Controller issues a Deep Power-down Command to the Mobile SDRAM device. This mode is unique to Mobile SDRAM devices
#define AT91C_DDRC2_PASR      ((unsigned int) 0x7 <<  4) // (HDDRSDRC2) Partial Array Self Refresh
#define AT91C_                ((unsigned int) 0x0 <<  8) // (HDDRSDRC2) 
#define AT91C_DDRC2_DS        ((unsigned int) 0x3 << 10) // (HDDRSDRC2) Drive strength
#define AT91C_DDRC2_TIMEOUT   ((unsigned int) 0x3 << 12) // (HDDRSDRC2) low-power mode delay
#define 	AT91C_DDRC2_TIMEOUT_0                    ((unsigned int) 0x0 << 12) // (HDDRSDRC2) The SDRAM controller activates the SDRAM low-power mode immediately after the end of the last transfer.
#define 	AT91C_DDRC2_TIMEOUT_64                   ((unsigned int) 0x1 << 12) // (HDDRSDRC2) The SDRAM controller activates the SDRAM low-power mode 64 clock cycles after the end of the last transfer.
#define 	AT91C_DDRC2_TIMEOUT_128                  ((unsigned int) 0x2 << 12) // (HDDRSDRC2) The SDRAM controller activates the SDRAM low-power mode 128 clock cycles after the end of the last transfer.
#define 	AT91C_DDRC2_TIMEOUT_Reserved             ((unsigned int) 0x3 << 12) // (HDDRSDRC2) Reserved
#define AT91C_DDRC2_ADPE      ((unsigned int) 0x1 << 16) // (HDDRSDRC2) Active Power Down Exit time
#define 	AT91C_DDRC2_ADPE_FAST                 ((unsigned int) 0x0 << 16) // (HDDRSDRC2) Fast Exit
#define 	AT91C_DDRC2_ADPE_SLOW                 ((unsigned int) 0x1 << 16) // (HDDRSDRC2) Slow Exit
// -------- HDDRSDRC2_MDR : (HDDRSDRC2 Offset: 0x20) Memory Device Register -------- 
#define AT91C_DDRC2_MD        ((unsigned int) 0x7 <<  0) // (HDDRSDRC2) memory device
#define 	AT91C_DDRC2_MD_SDR_SDRAM            ((unsigned int) 0x0) // (HDDRSDRC2) SDR SDRAM
#define 	AT91C_DDRC2_MD_LP_SDR_SDRAM         ((unsigned int) 0x1) // (HDDRSDRC2) Low Power SDR SDRAM
#define 	AT91C_DDRC2_MD_DDR_SDRAM            ((unsigned int) 0x2) // (HDDRSDRC2) DDR SDRAM
#define 	AT91C_DDRC2_MD_LP_DDR_SDRAM         ((unsigned int) 0x3) // (HDDRSDRC2) Low Power DDR SDRAM
#define 	AT91C_DDRC2_MD_DDR2_SDRAM           ((unsigned int) 0x6) // (HDDRSDRC2) DDR2 SDRAM
