una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9g45.h
// -------- ISI_CFG1 : (ISI Offset: 0x0) ISI Configuration Register 1 -------- 
#define AT91C_ISI_HSYNC_POL   ((unsigned int) 0x1 <<  2) // (ISI) Horizontal synchronization polarity
#define 	AT91C_ISI_HSYNC_POL_ACTIVE_HIGH          ((unsigned int) 0x0 <<  2) // (ISI) HSYNC active high.
#define 	AT91C_ISI_HSYNC_POL_ACTIVE_LOW           ((unsigned int) 0x1 <<  2) // (ISI) HSYNC active low.
#define AT91C_ISI_VSYNC_POL   ((unsigned int) 0x1 <<  3) // (ISI) Vertical synchronization polarity
#define 	AT91C_ISI_VSYNC_POL_ACTIVE_HIGH          ((unsigned int) 0x0 <<  3) // (ISI) VSYNC active high.
#define 	AT91C_ISI_VSYNC_POL_ACTIVE_LOW           ((unsigned int) 0x1 <<  3) // (ISI) VSYNC active low.
#define AT91C_ISI_PIXCLK_POL  ((unsigned int) 0x1 <<  4) // (ISI) Pixel Clock Polarity
#define 	AT91C_ISI_PIXCLK_POL_RISING_EDGE          ((unsigned int) 0x0 <<  4) // (ISI) Data is sampled on rising edge of pixel clock.
#define 	AT91C_ISI_PIXCLK_POL_FALLING_EDGE         ((unsigned int) 0x1 <<  4) // (ISI) Data is sampled on falling edge of pixel clock.
#define AT91C_ISI_EMB_SYNC    ((unsigned int) 0x1 <<  6) // (ISI) Embedded synchronisation
#define 	AT91C_ISI_EMB_SYNC_HSYNC_VSYNC          ((unsigned int) 0x0 <<  6) // (ISI) Synchronization by HSYNC, VSYNC.
#define 	AT91C_ISI_EMB_SYNC_SAV_EAV              ((unsigned int) 0x1 <<  6) // (ISI) Synchronisation by Embedded Synchronization Sequence SAV/EAV.
#define AT91C_ISI_CRC_SYNC    ((unsigned int) 0x1 <<  7) // (ISI) CRC correction
#define 	AT91C_ISI_CRC_SYNC_CORRECTION_OFF       ((unsigned int) 0x0 <<  7) // (ISI) No CRC correction performed on embedded synchronization.
#define 	AT91C_ISI_CRC_SYNC_CORRECTION_ON        ((unsigned int) 0x1 <<  7) // (ISI) CRC correction is performed.
#define AT91C_ISI_FRATE       ((unsigned int) 0x7 <<  8) // (ISI) Frame rate capture
#define AT91C_ISI_FULL        ((unsigned int) 0x1 << 12) // (ISI) Full mode is allowed
#define 	AT91C_ISI_FULL_MODE_DISABLE         ((unsigned int) 0x0 << 12) // (ISI) Full mode disabled.
#define 	AT91C_ISI_FULL_MODE_ENABLE          ((unsigned int) 0x1 << 12) // (ISI) both codec and preview datapath are working simultaneously.
#define AT91C_ISI_THMASK      ((unsigned int) 0x3 << 13) // (ISI) DMA Burst Mask
#define 	AT91C_ISI_THMASK_4_BURST              ((unsigned int) 0x0 << 13) // (ISI) Only 4 beats AHB bursts are allowed
#define 	AT91C_ISI_THMASK_4_8_BURST            ((unsigned int) 0x1 << 13) // (ISI) Only 4 and 8 beats AHB bursts are allowed
#define 	AT91C_ISI_THMASK_4_8_16_BURST         ((unsigned int) 0x2 << 13) // (ISI) 4, 8 and 16 beats AHB bursts are allowed
#define AT91C_ISI_SLD         ((unsigned int) 0xFF << 16) // (ISI) Start of Line Delay
#define AT91C_ISI_SFD         ((unsigned int) 0xFF << 24) // (ISI) Start of frame Delay
// -------- ISI_CFG2 : (ISI Offset: 0x4) ISI Control Register 2 -------- 
#define AT91C_ISI_IM_VSIZE    ((unsigned int) 0x7FF <<  0) // (ISI) Vertical size of the Image sensor [0..2047]
#define AT91C_ISI_GS_MODE     ((unsigned int) 0x1 << 11) // (ISI) Grayscale Memory Mode
#define 	AT91C_ISI_GS_MODE_2_PIXELS             ((unsigned int) 0x0 << 11) // (ISI) 2 pixels per word.
#define 	AT91C_ISI_GS_MODE_1_PIXEL              ((unsigned int) 0x1 << 11) // (ISI) 1 pixel per word.
#define AT91C_ISI_RGB_MODE    ((unsigned int) 0x1 << 12) // (ISI) RGB mode
#define 	AT91C_ISI_RGB_MODE_RGB_888              ((unsigned int) 0x0 << 12) // (ISI) RGB 8:8:8 24 bits
#define 	AT91C_ISI_RGB_MODE_RGB_565              ((unsigned int) 0x1 << 12) // (ISI) RGB 5:6:5 16 bits
#define AT91C_ISI_GRAYSCALE   ((unsigned int) 0x1 << 13) // (ISI) Grayscale Mode
#define 	AT91C_ISI_GRAYSCALE_DISABLE              ((unsigned int) 0x0 << 13) // (ISI) Grayscale mode is disabled
#define 	AT91C_ISI_GRAYSCALE_ENABLE               ((unsigned int) 0x1 << 13) // (ISI) Input image is assumed to be grayscale coded
#define AT91C_ISI_RGB_SWAP    ((unsigned int) 0x1 << 14) // (ISI) RGB Swap
#define 	AT91C_ISI_RGB_SWAP_DISABLE              ((unsigned int) 0x0 << 14) // (ISI) D7 -> R7
#define 	AT91C_ISI_RGB_SWAP_ENABLE               ((unsigned int) 0x1 << 14) // (ISI) D0 -> R7
#define AT91C_ISI_COL_SPACE   ((unsigned int) 0x1 << 15) // (ISI) Color space for the image data
#define 	AT91C_ISI_COL_SPACE_YCBCR                ((unsigned int) 0x0 << 15) // (ISI) YCbCr
#define 	AT91C_ISI_COL_SPACE_RGB                  ((unsigned int) 0x1 << 15) // (ISI) RGB
#define AT91C_ISI_IM_HSIZE    ((unsigned int) 0x7FF << 16) // (ISI) Horizontal size of the Image sensor [0..2047]
#define AT91C_ISI_YCC_SWAP    ((unsigned int) 0x3 << 28) // (ISI) Ycc swap
#define 	AT91C_ISI_YCC_SWAP_YCC_DEFAULT          ((unsigned int) 0x0 << 28) // (ISI) Cb(i) Y(i) Cr(i) Y(i+1)
#define 	AT91C_ISI_YCC_SWAP_YCC_MODE1            ((unsigned int) 0x1 << 28) // (ISI) Cr(i) Y(i) Cb(i) Y(i+1)
#define 	AT91C_ISI_YCC_SWAP_YCC_MODE2            ((unsigned int) 0x2 << 28) // (ISI) Y(i) Cb(i) Y(i+1) Cr(i)
#define 	AT91C_ISI_YCC_SWAP_YCC_MODE3            ((unsigned int) 0x3 << 28) // (ISI) Y(i) Cr(i) Y(i+1) Cb(i)
#define AT91C_ISI_RGB_CFG     ((unsigned int) 0x3 << 30) // (ISI) RGB configuration
#define 	AT91C_ISI_RGB_CFG_RGB_DEFAULT          ((unsigned int) 0x0 << 30) // (ISI) R/G(MSB)  G(LSB)/B  R/G(MSB)  G(LSB)/B
#define 	AT91C_ISI_RGB_CFG_RGB_MODE1            ((unsigned int) 0x1 << 30) // (ISI) B/G(MSB)  G(LSB)/R  B/G(MSB)  G(LSB)/R
#define 	AT91C_ISI_RGB_CFG_RGB_MODE2            ((unsigned int) 0x2 << 30) // (ISI) G(LSB)/R  B/G(MSB)  G(LSB)/R  B/G(MSB)
#define 	AT91C_ISI_RGB_CFG_RGB_MODE3            ((unsigned int) 0x3 << 30) // (ISI) G(LSB)/B  R/G(MSB)  G(LSB)/B  R/G(MSB)
// -------- ISI_PSIZE : (ISI Offset: 0x8) ISI Preview Register -------- 
#define AT91C_ISI_PREV_VSIZE  ((unsigned int) 0x3FF <<  0) // (ISI) Vertical size for the preview path
#define AT91C_ISI_PREV_HSIZE  ((unsigned int) 0x3FF << 16) // (ISI) Horizontal size for the preview path
// -------- ISI_PDECF : (ISI Offset: 0xc) ISI Preview Decimation Factor Register -------- 
#define AT91C_ISI_DEC_FACTOR  ((unsigned int) 0xFF <<  0) // (ISI) Decimation factor
// -------- ISI_Y2RSET0 : (ISI Offset: 0x10) Color Space Conversion YCrCb to RGB Register -------- 
#define AT91C_ISI_Y2R_C0      ((unsigned int) 0xFF <<  0) // (ISI) Color Space Conversion Matrix Coefficient C0
#define AT91C_ISI_Y2R_C1      ((unsigned int) 0xFF <<  8) // (ISI) Color Space Conversion Matrix Coefficient C1
#define AT91C_ISI_Y2R_C2      ((unsigned int) 0xFF << 16) // (ISI) Color Space Conversion Matrix Coefficient C2
#define AT91C_ISI_Y2R_C3      ((unsigned int) 0xFF << 24) // (ISI) Color Space Conversion Matrix Coefficient C3
// -------- ISI_Y2RSET1 : (ISI Offset: 0x14) ISI Color Space Conversion YCrCb to RGB set 1 Register -------- 
#define AT91C_ISI_Y2R_C4      ((unsigned int) 0x1FF <<  0) // (ISI) Color Space Conversion Matrix Coefficient C4
#define AT91C_ISI_Y2R_YOFF    ((unsigned int) 0x1 << 12) // (ISI) Color Space Conversion Luninance default offset
#define 	AT91C_ISI_Y2R_YOFF_0                    ((unsigned int) 0x0 << 12) // (ISI) Offset is 0
#define 	AT91C_ISI_Y2R_YOFF_128                  ((unsigned int) 0x1 << 12) // (ISI) Offset is 128
#define AT91C_ISI_Y2R_CROFF   ((unsigned int) 0x1 << 13) // (ISI) Color Space Conversion Red Chrominance default offset
#define 	AT91C_ISI_Y2R_CROFF_0                    ((unsigned int) 0x0 << 13) // (ISI) Offset is 0
#define 	AT91C_ISI_Y2R_CROFF_16                   ((unsigned int) 0x1 << 13) // (ISI) Offset is 16
#define AT91C_ISI_Y2R_CBOFF   ((unsigned int) 0x1 << 14) // (ISI) Color Space Conversion Blue Chrominance default offset
#define 	AT91C_ISI_Y2R_CBOFF_0                    ((unsigned int) 0x0 << 14) // (ISI) Offset is 0
#define 	AT91C_ISI_Y2R_CBOFF_16                   ((unsigned int) 0x1 << 14) // (ISI) Offset is 16
// -------- ISI_R2YSET0 : (ISI Offset: 0x18) Color Space Conversion RGB to YCrCb set 0 register -------- 
#define AT91C_ISI_R2Y_C0      ((unsigned int) 0x7F <<  0) // (ISI) Color Space Conversion RGB to YCrCb Matrix coefficient C0
#define AT91C_ISI_R2Y_C1      ((unsigned int) 0x7F <<  8) // (ISI) Color Space Conversion RGB to YCrCb Matrix coefficient C1
#define AT91C_ISI_R2Y_C2      ((unsigned int) 0x7F << 16) // (ISI) Color Space Conversion RGB to YCrCb Matrix coefficient C2
#define AT91C_ISI_R2Y_ROFF    ((unsigned int) 0x1 << 24) // (ISI) Color Space Conversion Red component offset
#define 	AT91C_ISI_R2Y_ROFF_0                    ((unsigned int) 0x0 << 24) // (ISI) Offset is 0
#define 	AT91C_ISI_R2Y_ROFF_16                   ((unsigned int) 0x1 << 24) // (ISI) Offset is 16
// -------- ISI_R2YSET1 : (ISI Offset: 0x1c) Color Space Conversion RGB to YCrCb set 1 register -------- 
#define AT91C_ISI_R2Y_C3      ((unsigned int) 0x7F <<  0) // (ISI) Color Space Conversion RGB to YCrCb Matrix coefficient C3
#define AT91C_ISI_R2Y_C4      ((unsigned int) 0x7F <<  8) // (ISI) Color Space Conversion RGB to YCrCb Matrix coefficient C4
#define AT91C_ISI_R2Y_C5      ((unsigned int) 0x7F << 16) // (ISI) Color Space Conversion RGB to YCrCb Matrix coefficient C5
#define AT91C_ISI_R2Y_GOFF    ((unsigned int) 0x1 << 24) // (ISI) Color Space Conversion Green component offset
#define 	AT91C_ISI_R2Y_GOFF_0                    ((unsigned int) 0x0 << 24) // (ISI) Offset is 0
#define 	AT91C_ISI_R2Y_GOFF_128                  ((unsigned int) 0x1 << 24) // (ISI) Offset is 128
// -------- ISI_R2YSET2 : (ISI Offset: 0x20) Color Space Conversion RGB to YCrCb set 2 register -------- 
#define AT91C_ISI_R2Y_C6      ((unsigned int) 0x7F <<  0) // (ISI) Color Space Conversion RGB to YCrCb Matrix coefficient C6
#define AT91C_ISI_R2Y_C7      ((unsigned int) 0x7F <<  8) // (ISI) Color Space Conversion RGB to YCrCb Matrix coefficient C7
#define AT91C_ISI_R2Y_C8      ((unsigned int) 0x7F << 16) // (ISI) Color Space Conversion RGB to YCrCb Matrix coefficient C8
#define AT91C_ISI_R2Y_BOFF    ((unsigned int) 0x1 << 24) // (ISI) Color Space Conversion Blue component offset
#define 	AT91C_ISI_R2Y_BOFF_0                    ((unsigned int) 0x0 << 24) // (ISI) Offset is 0
#define 	AT91C_ISI_R2Y_BOFF_128                  ((unsigned int) 0x1 << 24) // (ISI) Offset is 128
// -------- ISI_CTRL : (ISI Offset: 0x24) ISI Control Register -------- 
#define AT91C_ISI_EN          ((unsigned int) 0x1 <<  0) // (ISI) Image Sensor Interface Enable Request
#define 	AT91C_ISI_EN_0                    ((unsigned int) 0x0) // (ISI) No effect
#define 	AT91C_ISI_EN_1                    ((unsigned int) 0x1) // (ISI) Enable the module and the capture
#define AT91C_ISI_DIS         ((unsigned int) 0x1 <<  1) // (ISI) Image Sensor Interface Disable Request
#define 	AT91C_ISI_DIS_0                    ((unsigned int) 0x0 <<  1) // (ISI) No effect
#define 	AT91C_ISI_DIS_1                    ((unsigned int) 0x1 <<  1) // (ISI) Disable the module and the capture
#define AT91C_ISI_SRST        ((unsigned int) 0x1 <<  2) // (ISI) Software Reset Request
#define 	AT91C_ISI_SRST_0                    ((unsigned int) 0x0 <<  2) // (ISI) No effect
#define 	AT91C_ISI_SRST_1                    ((unsigned int) 0x1 <<  2) // (ISI) Reset the module
#define AT91C_ISI_CDC         ((unsigned int) 0x1 <<  8) // (ISI) Codec Request
#define 	AT91C_ISI_CDC_0                    ((unsigned int) 0x0 <<  8) // (ISI) No effect
#define 	AT91C_ISI_CDC_1                    ((unsigned int) 0x1 <<  8) // (ISI) Enable the Codec
// -------- ISI_SR : (ISI Offset: 0x28) ISI Status Register -------- 
#define AT91C_ISI_VSYNC       ((unsigned int) 0x1 << 10) // (ISI) Vertical Synchronization
#define 	AT91C_ISI_VSYNC_0                    ((unsigned int) 0x0 << 10) // (ISI) No effect
#define 	AT91C_ISI_VSYNC_1                    ((unsigned int) 0x1 << 10) // (ISI) Indicates that a Vertical Synchronization has been detected since last read
#define AT91C_ISI_PXFR_DONE   ((unsigned int) 0x1 << 16) // (ISI) Preview DMA transfer terminated
#define 	AT91C_ISI_PXFR_DONE_0                    ((unsigned int) 0x0 << 16) // (ISI) No effect
#define 	AT91C_ISI_PXFR_DONE_1                    ((unsigned int) 0x1 << 16) // (ISI) Indicates that DATA transfer on preview channel has completed since last read
#define AT91C_ISI_CXFR_DONE   ((unsigned int) 0x1 << 17) // (ISI) Codec DMA transfer terminated
#define 	AT91C_ISI_CXFR_DONE_0                    ((unsigned int) 0x0 << 17) // (ISI) No effect
#define 	AT91C_ISI_CXFR_DONE_1                    ((unsigned int) 0x1 << 17) // (ISI) Indicates that DATA transfer on preview channel has completed since last read
#define AT91C_ISI_SIP         ((unsigned int) 0x1 << 19) // (ISI) Synchronization In Progress
#define 	AT91C_ISI_SIP_0                    ((unsigned int) 0x0 << 19) // (ISI) No effect
#define 	AT91C_ISI_SIP_1                    ((unsigned int) 0x1 << 19) // (ISI) Indicates that Synchronization is in progress
#define AT91C_ISI_P_OVR       ((unsigned int) 0x1 << 24) // (ISI) Fifo Preview Overflow 
#define 	AT91C_ISI_P_OVR_0                    ((unsigned int) 0x0 << 24) // (ISI) No error
#define 	AT91C_ISI_P_OVR_1                    ((unsigned int) 0x1 << 24) // (ISI) An overrun condition has occurred in input FIFO on the preview path
#define AT91C_ISI_C_OVR       ((unsigned int) 0x1 << 25) // (ISI) Fifo Codec Overflow 
#define 	AT91C_ISI_C_OVR_0                    ((unsigned int) 0x0 << 25) // (ISI) No error
#define 	AT91C_ISI_C_OVR_1                    ((unsigned int) 0x1 << 25) // (ISI) An overrun condition has occurred in input FIFO on the codec path
#define AT91C_ISI_CRC_ERR     ((unsigned int) 0x1 << 26) // (ISI) CRC synchronisation error
#define 	AT91C_ISI_CRC_ERR_0                    ((unsigned int) 0x0 << 26) // (ISI) No error
#define 	AT91C_ISI_CRC_ERR_1                    ((unsigned int) 0x1 << 26) // (ISI) CRC_SYNC is enabled in the control register and an error has been detected and not corrected. The frame is discarded and the ISI waits for a new one.
#define AT91C_ISI_FR_OVR      ((unsigned int) 0x1 << 27) // (ISI) Frame rate overun
#define 	AT91C_ISI_FR_OVR_0                    ((unsigned int) 0x0 << 27) // (ISI) No error
#define 	AT91C_ISI_FR_OVR_1                    ((unsigned int) 0x1 << 27) // (ISI) Frame overrun, the current frame is being skipped because a vsync signal has been detected while flushing FIFOs.
// -------- ISI_IER : (ISI Offset: 0x2c) ISI Interrupt Enable Register -------- 
// -------- ISI_IDR : (ISI Offset: 0x30) ISI Interrupt Disable Register -------- 
// -------- ISI_IMR : (ISI Offset: 0x34) ISI Interrupt Mask Register -------- 
// -------- ISI_DMACHER : (ISI Offset: 0x38) DMA Channel Enable Register -------- 
#define AT91C_ISI_P_CH_EN     ((unsigned int) 0x1 <<  0) // (ISI) Preview Channel Enable
#define 	AT91C_ISI_P_CH_EN_0                    ((unsigned int) 0x0) // (ISI) No effect
#define 	AT91C_ISI_P_CH_EN_1                    ((unsigned int) 0x1) // (ISI) Enable the Preview Channel
#define AT91C_ISI_C_CH_EN     ((unsigned int) 0x1 <<  1) // (ISI) Codec Channel Enable
#define 	AT91C_ISI_C_CH_EN_0                    ((unsigned int) 0x0 <<  1) // (ISI) No effect
#define 	AT91C_ISI_C_CH_EN_1                    ((unsigned int) 0x1 <<  1) // (ISI) Enable the Codec Channel
// -------- ISI_DMACHDR : (ISI Offset: 0x3c) DMA Channel Enable Register -------- 
#define AT91C_ISI_P_CH_DIS    ((unsigned int) 0x1 <<  0) // (ISI) Preview Channel Disable
#define 	AT91C_ISI_P_CH_DIS_0                    ((unsigned int) 0x0) // (ISI) No effect
#define 	AT91C_ISI_P_CH_DIS_1                    ((unsigned int) 0x1) // (ISI) Disable the Preview Channel
#define AT91C_ISI_C_CH_DIS    ((unsigned int) 0x1 <<  1) // (ISI) Codec Channel Disable
#define 	AT91C_ISI_C_CH_DIS_0                    ((unsigned int) 0x0 <<  1) // (ISI) No effect
#define 	AT91C_ISI_C_CH_DIS_1                    ((unsigned int) 0x1 <<  1) // (ISI) Disable the Codec Channel
// -------- ISI_DMACHSR : (ISI Offset: 0x40) DMA Channel Status Register -------- 
#define AT91C_ISI_P_CH_S      ((unsigned int) 0x1 <<  0) // (ISI) Preview Channel Disable
#define 	AT91C_ISI_P_CH_S_0                    ((unsigned int) 0x0) // (ISI) Preview Channel is disabled
#define 	AT91C_ISI_P_CH_S_1                    ((unsigned int) 0x1) // (ISI) Preview Channel is enabled
#define AT91C_ISI_C_CH_S      ((unsigned int) 0x1 <<  1) // (ISI) Codec Channel Disable
#define 	AT91C_ISI_C_CH_S_0                    ((unsigned int) 0x0 <<  1) // (ISI) Codec Channel is disabled
#define 	AT91C_ISI_C_CH_S_1                    ((unsigned int) 0x1 <<  1) // (ISI) Codec Channel is enabled
// -------- ISI_DMAPCTRL : (ISI Offset: 0x48) DMA Preview Control Register -------- 
#define AT91C_ISI_P_FETCH     ((unsigned int) 0x1 <<  0) // (ISI) Preview Descriptor Fetch Control Field
#define 	AT91C_ISI_P_FETCH_DISABLE              ((unsigned int) 0x0) // (ISI) Preview Channel Fetch Operation is disabled
#define 	AT91C_ISI_P_FETCH_ENABLE               ((unsigned int) 0x1) // (ISI) Preview Channel Fetch Operation is enabled
#define AT91C_ISI_P_DONE      ((unsigned int) 0x1 <<  1) // (ISI) Preview Transfer Done Flag
#define 	AT91C_ISI_P_DONE_0                    ((unsigned int) 0x0 <<  1) // (ISI) Preview Transfer has not been performed
#define 	AT91C_ISI_P_DONE_1                    ((unsigned int) 0x1 <<  1) // (ISI) Preview Transfer has completed
// -------- ISI_DMACCTRL : (ISI Offset: 0x54) DMA Codec Control Register -------- 
#define AT91C_ISI_C_FETCH     ((unsigned int) 0x1 <<  0) // (ISI) Codec Descriptor Fetch Control Field
#define 	AT91C_ISI_C_FETCH_DISABLE              ((unsigned int) 0x0) // (ISI) Codec Channel Fetch Operation is disabled
#define 	AT91C_ISI_C_FETCH_ENABLE               ((unsigned int) 0x1) // (ISI) Codec Channel Fetch Operation is enabled
#define AT91C_ISI_C_DONE      ((unsigned int) 0x1 <<  1) // (ISI) Codec Transfer Done Flag
#define 	AT91C_ISI_C_DONE_0                    ((unsigned int) 0x0 <<  1) // (ISI) Codec Transfer has not been performed
#define 	AT91C_ISI_C_DONE_1                    ((unsigned int) 0x1 <<  1) // (ISI) Codec Transfer has completed
// -------- ISI_WPCR : (ISI Offset: 0xe4) Write Protection Control Register -------- 
#define AT91C_ISI_WP_EN       ((unsigned int) 0x1 <<  0) // (ISI) Write Protection Enable
#define 	AT91C_ISI_WP_EN_DISABLE              ((unsigned int) 0x0) // (ISI) Write Operation is disabled (if WP_KEY corresponds)
#define 	AT91C_ISI_WP_EN_ENABLE               ((unsigned int) 0x1) // (ISI) Write Operation is enabled (if WP_KEY corresponds)
#define AT91C_ISI_WP_KEY      ((unsigned int) 0xFFFFFF <<  8) // (ISI) Write Protection Key
// -------- ISI_WPSR : (ISI Offset: 0xe8) Write Protection Status Register -------- 
#define AT91C_ISI_WP_VS       ((unsigned int) 0xF <<  0) // (ISI) Write Protection Violation Status
#define 	AT91C_ISI_WP_VS_NO_VIOLATION         ((unsigned int) 0x0) // (ISI) No Write Protection Violation detected since last read
#define 	AT91C_ISI_WP_VS_ON_WRITE             ((unsigned int) 0x1) // (ISI) Write Protection Violation detected since last read
#define 	AT91C_ISI_WP_VS_ON_RESET             ((unsigned int) 0x2) // (ISI) Software Reset Violation detected since last read
#define 	AT91C_ISI_WP_VS_ON_BOTH              ((unsigned int) 0x3) // (ISI) Write Protection and Software Reset Violation detected since last read
#define AT91C_ISI_WP_VSRC     ((unsigned int) 0xF <<  8) // (ISI) Write Protection Violation Source
#define 	AT91C_ISI_WP_VSRC_NO_VIOLATION         ((unsigned int) 0x0 <<  8) // (ISI) No Write Protection Violation detected since last read
#define 	AT91C_ISI_WP_VSRC_ISI_CFG1             ((unsigned int) 0x1 <<  8) // (ISI) Write Protection Violation detected on ISI_CFG1 since last read
#define 	AT91C_ISI_WP_VSRC_ISI_CFG2             ((unsigned int) 0x2 <<  8) // (ISI) Write Protection Violation detected on ISI_CFG2 since last read
#define 	AT91C_ISI_WP_VSRC_ISI_PSIZE            ((unsigned int) 0x3 <<  8) // (ISI) Write Protection Violation detected on ISI_PSIZE since last read
#define 	AT91C_ISI_WP_VSRC_ISI_PDECF            ((unsigned int) 0x4 <<  8) // (ISI) Write Protection Violation detected on ISI_PDECF since last read
#define 	AT91C_ISI_WP_VSRC_ISI_Y2RSET0          ((unsigned int) 0x5 <<  8) // (ISI) Write Protection Violation detected on ISI_Y2RSET0 since last read
#define 	AT91C_ISI_WP_VSRC_ISI_Y2RSET1          ((unsigned int) 0x6 <<  8) // (ISI) Write Protection Violation detected on ISI_Y2RSET1 since last read
#define 	AT91C_ISI_WP_VSRC_ISI_R2YSET0          ((unsigned int) 0x7 <<  8) // (ISI) Write Protection Violation detected on ISI_R2YSET0 since last read
#define 	AT91C_ISI_WP_VSRC_ISI_R2YSET1          ((unsigned int) 0x8 <<  8) // (ISI) Write Protection Violation detected on ISI_R2YSET1 since last read
#define 	AT91C_ISI_WP_VSRC_ISI_R2YSET2          ((unsigned int) 0x9 <<  8) // (ISI) Write Protection Violation detected on ISI_R2YSET2 since last read

// *****************************************************************************
//              SOFTWARE API DEFINITION  FOR USB Host Interface
// *****************************************************************************
typedef struct _AT91S_UHPHS_OHCI {
	AT91_REG	 UHPHS_OHCI_HcRevision; 	// Revision
	AT91_REG	 UHPHS_OHCI_HcControl; 	// Operating modes for the Host Controller
	AT91_REG	 UHPHS_OHCI_HcCommandStatus; 	// Command & status Register
	AT91_REG	 UHPHS_OHCI_HcInterruptStatus; 	// Interrupt Status Register
	AT91_REG	 UHPHS_OHCI_HcInterruptEnable; 	// Interrupt Enable Register
	AT91_REG	 UHPHS_OHCI_HcInterruptDisable; 	// Interrupt Disable Register
	AT91_REG	 UHPHS_OHCI_HcHCCA; 	// Pointer to the Host Controller Communication Area
	AT91_REG	 UHPHS_OHCI_HcPeriodCurrentED; 	// Current Isochronous or Interrupt Endpoint Descriptor
	AT91_REG	 UHPHS_OHCI_HcControlHeadED; 	// First Endpoint Descriptor of the Control list
	AT91_REG	 UHPHS_OHCI_HcControlCurrentED; 	// Endpoint Control and Status Register
	AT91_REG	 UHPHS_OHCI_HcBulkHeadED; 	// First endpoint register of the Bulk list
	AT91_REG	 UHPHS_OHCI_HcBulkCurrentED; 	// Current endpoint of the Bulk list
	AT91_REG	 UHPHS_OHCI_HcBulkDoneHead; 	// Last completed transfer descriptor
	AT91_REG	 UHPHS_OHCI_HcFmInterval; 	// Bit time between 2 consecutive SOFs
	AT91_REG	 UHPHS_OHCI_HcFmRemaining; 	// Bit time remaining in the current Frame
	AT91_REG	 UHPHS_OHCI_HcFmNumber; 	// Frame number
	AT91_REG	 UHPHS_OHCI_HcPeriodicStart; 	// Periodic Start
	AT91_REG	 UHPHS_OHCI_HcLSThreshold; 	// LS Threshold
	AT91_REG	 UHPHS_OHCI_HcRhDescriptorA; 	// Root Hub characteristics A
	AT91_REG	 UHPHS_OHCI_HcRhDescriptorB; 	// Root Hub characteristics B
	AT91_REG	 UHPHS_OHCI_HcRhStatus; 	// Root Hub Status register
	AT91_REG	 UHPHS_OHCI_HcRhPortStatus[2]; 	// Root Hub Port Status Register
} AT91S_UHPHS_OHCI, *AT91PS_UHPHS_OHCI;


