una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9g45.h
#define AT91C_ISI_R2YSET1 ((AT91_REG *) 	0xFFFB401C) // (ISI) Color Space Conversion RGB to YCrCb Register
#define AT91C_ISI_PDECF ((AT91_REG *) 	0xFFFB400C) // (ISI) Preview Decimation Factor Register
#define AT91C_ISI_CFG2  ((AT91_REG *) 	0xFFFB4004) // (ISI) Configuration Register 2
#define AT91C_ISI_DMACCTRL ((AT91_REG *) 	0xFFFB4054) // (ISI) DMA Codec Control Register
#define AT91C_ISI_CTRL  ((AT91_REG *) 	0xFFFB4024) // (ISI) Control Register
#define AT91C_ISI_Y2RSET0 ((AT91_REG *) 	0xFFFB4010) // (ISI) Color Space Conversion YCrCb to RGB Register
#define AT91C_ISI_WPSR  ((AT91_REG *) 	0xFFFB40E8) // (ISI) Write Protection Status Register
#define AT91C_ISI_DMACHER ((AT91_REG *) 	0xFFFB4038) // (ISI) DMA Channel Enable Register
#define AT91C_ISI_DMACHSR ((AT91_REG *) 	0xFFFB4040) // (ISI) DMA Channel Status Register
#define AT91C_ISI_IDR   ((AT91_REG *) 	0xFFFB4030) // (ISI) Interrupt Disable Register
#define AT91C_ISI_VER   ((AT91_REG *) 	0xFFFB40FC) // (ISI) Version Register
#define AT91C_ISI_Y2RSET1 ((AT91_REG *) 	0xFFFB4014) // (ISI) Color Space Conversion YCrCb to RGB Register
#define AT91C_ISI_R2YSET2 ((AT91_REG *) 	0xFFFB4020) // (ISI) Color Space Conversion RGB to YCrCb Register
#define AT91C_ISI_SR    ((AT91_REG *) 	0xFFFB4028) // (ISI) Status Register
#define AT91C_ISI_DMACDSCR ((AT91_REG *) 	0xFFFB4058) // (ISI) DMA Codec Descriptor Address Register
#define AT91C_ISI_IER   ((AT91_REG *) 	0xFFFB402C) // (ISI) Interrupt Enable Register
#define AT91C_ISI_WPCR  ((AT91_REG *) 	0xFFFB40E4) // (ISI) Write Protection Control Register
#define AT91C_ISI_DMACADDR ((AT91_REG *) 	0xFFFB4050) // (ISI) DMA Codec Base Address Register
#define AT91C_ISI_CFG1  ((AT91_REG *) 	0xFFFB4000) // (ISI) Configuration Register 1
#define AT91C_ISI_R2YSET0 ((AT91_REG *) 	0xFFFB4018) // (ISI) Color Space Conversion RGB to YCrCb Register
#define AT91C_ISI_PSIZE ((AT91_REG *) 	0xFFFB4008) // (ISI) Preview Size Register
#define AT91C_ISI_DMAPDSCR ((AT91_REG *) 	0xFFFB404C) // (ISI) DMA Preview Descriptor Address Register
#define AT91C_ISI_DMAPADDR ((AT91_REG *) 	0xFFFB4044) // (ISI) DMA Preview Base Address Register
#define AT91C_ISI_DMAPCTRL ((AT91_REG *) 	0xFFFB4048) // (ISI) DMA Preview Control Register
// ========== Register definition for UHPHS_OHCI peripheral ========== 
#define AT91C_OHCI_HcRhPortStatus ((AT91_REG *) 	0x00700054) // (UHPHS_OHCI) Root Hub Port Status Register
#define AT91C_OHCI_HcFmRemaining ((AT91_REG *) 	0x00700038) // (UHPHS_OHCI) Bit time remaining in the current Frame
#define AT91C_OHCI_HcInterruptEnable ((AT91_REG *) 	0x00700010) // (UHPHS_OHCI) Interrupt Enable Register
#define AT91C_OHCI_HcControl ((AT91_REG *) 	0x00700004) // (UHPHS_OHCI) Operating modes for the Host Controller
#define AT91C_OHCI_HcPeriodicStart ((AT91_REG *) 	0x00700040) // (UHPHS_OHCI) Periodic Start
#define AT91C_OHCI_HcInterruptStatus ((AT91_REG *) 	0x0070000C) // (UHPHS_OHCI) Interrupt Status Register
#define AT91C_OHCI_HcRhDescriptorB ((AT91_REG *) 	0x0070004C) // (UHPHS_OHCI) Root Hub characteristics B
#define AT91C_OHCI_HcInterruptDisable ((AT91_REG *) 	0x00700014) // (UHPHS_OHCI) Interrupt Disable Register
#define AT91C_OHCI_HcPeriodCurrentED ((AT91_REG *) 	0x0070001C) // (UHPHS_OHCI) Current Isochronous or Interrupt Endpoint Descriptor
#define AT91C_OHCI_HcRhDescriptorA ((AT91_REG *) 	0x00700048) // (UHPHS_OHCI) Root Hub characteristics A
#define AT91C_OHCI_HcRhStatus ((AT91_REG *) 	0x00700050) // (UHPHS_OHCI) Root Hub Status register
#define AT91C_OHCI_HcBulkCurrentED ((AT91_REG *) 	0x0070002C) // (UHPHS_OHCI) Current endpoint of the Bulk list
#define AT91C_OHCI_HcControlHeadED ((AT91_REG *) 	0x00700020) // (UHPHS_OHCI) First Endpoint Descriptor of the Control list
#define AT91C_OHCI_HcLSThreshold ((AT91_REG *) 	0x00700044) // (UHPHS_OHCI) LS Threshold
#define AT91C_OHCI_HcRevision ((AT91_REG *) 	0x00700000) // (UHPHS_OHCI) Revision
#define AT91C_OHCI_HcBulkDoneHead ((AT91_REG *) 	0x00700030) // (UHPHS_OHCI) Last completed transfer descriptor
#define AT91C_OHCI_HcFmNumber ((AT91_REG *) 	0x0070003C) // (UHPHS_OHCI) Frame number
#define AT91C_OHCI_HcFmInterval ((AT91_REG *) 	0x00700034) // (UHPHS_OHCI) Bit time between 2 consecutive SOFs
#define AT91C_OHCI_HcBulkHeadED ((AT91_REG *) 	0x00700028) // (UHPHS_OHCI) First endpoint register of the Bulk list
#define AT91C_OHCI_HcHCCA ((AT91_REG *) 	0x00700018) // (UHPHS_OHCI) Pointer to the Host Controller Communication Area
#define AT91C_OHCI_HcCommandStatus ((AT91_REG *) 	0x00700008) // (UHPHS_OHCI) Command & status Register
#define AT91C_OHCI_HcControlCurrentED ((AT91_REG *) 	0x00700024) // (UHPHS_OHCI) Endpoint Control and Status Register
// ========== Register definition for UHPHS_EHCI peripheral ========== 
#define AT91C_EHCI_USBSTS ((AT91_REG *) 	0x00800014) // (UHPHS_EHCI) 
#define AT91C_EHCI_INSNREG03 ((AT91_REG *) 	0x0080009C) // (UHPHS_EHCI) 
#define AT91C_EHCI_INSNREG00 ((AT91_REG *) 	0x00800090) // (UHPHS_EHCI) 
#define AT91C_EHCI_HCSPPORTROUTE ((AT91_REG *) 	0x0080000C) // (UHPHS_EHCI) 
#define AT91C_EHCI_FRINDEX ((AT91_REG *) 	0x0080001C) // (UHPHS_EHCI) 
#define AT91C_EHCI_CONFIGFLAG ((AT91_REG *) 	0x00800050) // (UHPHS_EHCI) 
#define AT91C_EHCI_HCCPARAMS ((AT91_REG *) 	0x00800008) // (UHPHS_EHCI) 
#define AT91C_EHCI_USBINTR ((AT91_REG *) 	0x00800018) // (UHPHS_EHCI) 
#define AT91C_EHCI_PORTSC ((AT91_REG *) 	0x00800054) // (UHPHS_EHCI) 
#define AT91C_EHCI_CTRLDSSEGMENT ((AT91_REG *) 	0x00800020) // (UHPHS_EHCI) 
#define AT91C_EHCI_VERSION ((AT91_REG *) 	0x00800000) // (UHPHS_EHCI) 
#define AT91C_EHCI_USBCMD ((AT91_REG *) 	0x00800010) // (UHPHS_EHCI) 
#define AT91C_EHCI_INSNREG04 ((AT91_REG *) 	0x008000A0) // (UHPHS_EHCI) 
#define AT91C_EHCI_PERIODICLISTBASE ((AT91_REG *) 	0x00800024) // (UHPHS_EHCI) 
#define AT91C_EHCI_INSNREG01 ((AT91_REG *) 	0x00800094) // (UHPHS_EHCI) 
#define AT91C_EHCI_HCSPARAMS ((AT91_REG *) 	0x00800004) // (UHPHS_EHCI) 
#define AT91C_EHCI_INSNREG05 ((AT91_REG *) 	0x008000A4) // (UHPHS_EHCI) 
#define AT91C_EHCI_ASYNCLISTADDR ((AT91_REG *) 	0x00800028) // (UHPHS_EHCI) 
#define AT91C_EHCI_INSNREG02 ((AT91_REG *) 	0x00800098) // (UHPHS_EHCI) 
// ========== Register definition for TRNG peripheral ========== 
#define AT91C_TRNG_IDR  ((AT91_REG *) 	0xFFFCC014) // (TRNG) Interrupt Disable Register
#define AT91C_TRNG_IER  ((AT91_REG *) 	0xFFFCC010) // (TRNG) Interrupt Enable Register
#define AT91C_TRNG_VERSION ((AT91_REG *) 	0xFFFCC0FC) // (TRNG) TRNG Version Register
#define AT91C_TRNG_ISR  ((AT91_REG *) 	0xFFFCC01C) // (TRNG) Interrupt Status Register
#define AT91C_TRNG_CR   ((AT91_REG *) 	0xFFFCC000) // (TRNG) Control Register
#define AT91C_TRNG_ODATA ((AT91_REG *) 	0xFFFCC050) // (TRNG) Output Data Register
#define AT91C_TRNG_IMR  ((AT91_REG *) 	0xFFFCC018) // (TRNG) Interrupt Mask Register

