una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9g45.h
#ifdef __IAR_SYSTEMS_ASM__

// - Hardware register definition

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR SPECIAL FUNCTION REGISTER
// - *****************************************************************************
// - -------- SFR_EMA : (SFR Offset: 0x0) memory Extra Margin Adjustment control register -------- 
AT91C_SFR_RAM_EMA         EQU (0x7 <<  0) ;- (SFR) SRAM EMA
AT91C_SFR_RAM_EMA_0       EQU (0x0) ;- (SFR) Normal Mode
AT91C_SFR_RAM_EMA_1       EQU (0x1) ;- (SFR) DEBUG MODE 1
AT91C_SFR_RAM_EMA_2       EQU (0x2) ;- (SFR) DEBUG MODE 2
AT91C_SFR_RAM_EMA_3       EQU (0x3) ;- (SFR) DEBUG MODE 3
AT91C_SFR_RAM_EMA_4       EQU (0x4) ;- (SFR) DEBUG MODE 4
AT91C_SFR_RAM_EMA_5       EQU (0x5) ;- (SFR) DEBUG MODE 5
AT91C_SFR_RAM_EMA_6       EQU (0x6) ;- (SFR) DEBUG MODE 6
AT91C_SFR_RAM_EMA_7       EQU (0x7) ;- (SFR) DEBUG MODE 7
AT91C_SFR_DPRAM_EMA       EQU (0x7 <<  4) ;- (SFR) SRAM EMA
AT91C_SFR_DPRAM_EMA_0     EQU (0x0 <<  4) ;- (SFR) Normal Mode
AT91C_SFR_DPRAM_EMA_1     EQU (0x1 <<  4) ;- (SFR) DEBUG MODE 1
AT91C_SFR_DPRAM_EMA_2     EQU (0x2 <<  4) ;- (SFR) DEBUG MODE 2
AT91C_SFR_DPRAM_EMA_3     EQU (0x3 <<  4) ;- (SFR) DEBUG MODE 3
AT91C_SFR_DPRAM_EMA_4     EQU (0x4 <<  4) ;- (SFR) DEBUG MODE 4
AT91C_SFR_DPRAM_EMA_5     EQU (0x5 <<  4) ;- (SFR) DEBUG MODE 5
AT91C_SFR_DPRAM_EMA_6     EQU (0x6 <<  4) ;- (SFR) DEBUG MODE 6
AT91C_SFR_DPRAM_EMA_7     EQU (0x7 <<  4) ;- (SFR) DEBUG MODE 7
AT91C_SFR_RF_EMA          EQU (0x7 <<  8) ;- (SFR) SRAM EMA
AT91C_SFR_RF_EMA_0        EQU (0x0 <<  8) ;- (SFR) Normal Mode
AT91C_SFR_RF_EMA_1        EQU (0x1 <<  8) ;- (SFR) DEBUG MODE 1
AT91C_SFR_RF_EMA_2        EQU (0x2 <<  8) ;- (SFR) DEBUG MODE 2
AT91C_SFR_RF_EMA_3        EQU (0x3 <<  8) ;- (SFR) DEBUG MODE 3
AT91C_SFR_RF_EMA_4        EQU (0x4 <<  8) ;- (SFR) DEBUG MODE 4
AT91C_SFR_RF_EMA_5        EQU (0x5 <<  8) ;- (SFR) DEBUG MODE 5
AT91C_SFR_RF_EMA_6        EQU (0x6 <<  8) ;- (SFR) DEBUG MODE 6
AT91C_SFR_RF_EMA_7        EQU (0x7 <<  8) ;- (SFR) DEBUG MODE 7
AT91C_SFR_DPRF_EMA        EQU (0x7 << 12) ;- (SFR) SRAM EMA
AT91C_SFR_DPRF_EMA_0      EQU (0x0 << 12) ;- (SFR) Normal Mode
AT91C_SFR_DPRF_EMA_1      EQU (0x1 << 12) ;- (SFR) DEBUG MODE 1
AT91C_SFR_DPRF_EMA_2      EQU (0x2 << 12) ;- (SFR) DEBUG MODE 2
AT91C_SFR_DPRF_EMA_3      EQU (0x3 << 12) ;- (SFR) DEBUG MODE 3
AT91C_SFR_DPRF_EMA_4      EQU (0x4 << 12) ;- (SFR) DEBUG MODE 4
AT91C_SFR_DPRF_EMA_5      EQU (0x5 << 12) ;- (SFR) DEBUG MODE 5
AT91C_SFR_DPRF_EMA_6      EQU (0x6 << 12) ;- (SFR) DEBUG MODE 6
AT91C_SFR_DPRF_EMA_7      EQU (0x7 << 12) ;- (SFR) DEBUG MODE 7
AT91C_SFR_ROM_EMA         EQU (0x7 << 16) ;- (SFR) SRAM EMA
AT91C_SFR_ROM_EMA_0       EQU (0x0 << 16) ;- (SFR) Normal Mode
AT91C_SFR_ROM_EMA_1       EQU (0x1 << 16) ;- (SFR) DEBUG MODE 1
AT91C_SFR_ROM_EMA_2       EQU (0x2 << 16) ;- (SFR) DEBUG MODE 2
AT91C_SFR_ROM_EMA_3       EQU (0x3 << 16) ;- (SFR) DEBUG MODE 3
AT91C_SFR_ROM_EMA_4       EQU (0x4 << 16) ;- (SFR) DEBUG MODE 4
AT91C_SFR_ROM_EMA_5       EQU (0x5 << 16) ;- (SFR) DEBUG MODE 5
AT91C_SFR_ROM_EMA_6       EQU (0x6 << 16) ;- (SFR) DEBUG MODE 6
AT91C_SFR_ROM_EMA_7       EQU (0x7 << 16) ;- (SFR) DEBUG MODE 7
// - -------- SFR_DDRCFG : (SFR Offset: 0x4) DDR2 SSTL18 control register -------- 
AT91C_SFR_DDRCFG_SSTL     EQU (0x1 <<  0) ;- (SFR) Control DDR2 pads SSTL mode control
AT91C_SFR_DDRCFG_SSTL_NORMAL EQU (0x0) ;- (SFR) Force pads in SSTL18 mode when DDR2 is connected
AT91C_SFR_DDRCFG_SSTL_COMPATIBLE EQU (0x1) ;- (SFR) LVCMOS level (compatible SSTL18)
AT91C_SFR_DDRCFG_CLKDELAY EQU (0x1 <<  8) ;- (SFR) Control DDR2 pads clocks delay on clk, dqs0, dqs1
AT91C_SFR_DDRCFG_CLKDELAY_HARD EQU (0x0 <<  8) ;- (SFR) Fixed by hardware
AT91C_SFR_DDRCFG_CLKDELAY_SOFT EQU (0x1 <<  8) ;- (SFR) Software must write correct delay value
// - -------- SFR_DDRDELAY : (SFR Offset: 0x8) DDR2 controller clock delay -------- 
AT91C_SFR_DDRDELAY_CLK    EQU (0xFF <<  0) ;- (SFR) Control CLK clock delay
AT91C_SFR_DDRDELAY_CLK_0  EQU (0x0) ;- (SFR) minimum delay
AT91C_SFR_DDRDELAY_CLK_1  EQU (0x1) ;- (SFR) 
AT91C_SFR_DDRDELAY_CLK_2  EQU (0x2) ;- (SFR) 
AT91C_SFR_DDRDELAY_CLK_3  EQU (0x3) ;- (SFR) 
AT91C_SFR_DDRDELAY_CLK_4  EQU (0x4) ;- (SFR) 
AT91C_SFR_DDRDELAY_CLK_5  EQU (0x5) ;- (SFR) 
AT91C_SFR_DDRDELAY_CLK_6  EQU (0x6) ;- (SFR) 
AT91C_SFR_DDRDELAY_CLK_7  EQU (0x7) ;- (SFR) 
AT91C_SFR_DDRDELAY_CLK_8  EQU (0x8) ;- (SFR) 
AT91C_SFR_DDRDELAY_CLK_9  EQU (0x9) ;- (SFR) 
AT91C_SFR_DDRDELAY_CLK_10 EQU (0xA) ;- (SFR) 
AT91C_SFR_DDRDELAY_CLK_11 EQU (0xB) ;- (SFR) 
AT91C_SFR_DDRDELAY_CLK_12 EQU (0xC) ;- (SFR) 
AT91C_SFR_DDRDELAY_CLK_13 EQU (0xD) ;- (SFR) 
AT91C_SFR_DDRDELAY_CLK_14 EQU (0xE) ;- (SFR) 
AT91C_SFR_DDRDELAY_CLK_15 EQU (0xF) ;- (SFR) 
AT91C_SFR_DDRDELAY_CLK_16 EQU (0x10) ;- (SFR) 
AT91C_SFR_DDRDELAY_DQS0   EQU (0xFF <<  8) ;- (SFR) Control DQS0 clock delay
AT91C_SFR_DDRDELAY_DQS0_0 EQU (0x0 <<  8) ;- (SFR) minimum delay
AT91C_SFR_DDRDELAY_DQS0_1 EQU (0x1 <<  8) ;- (SFR) 
AT91C_SFR_DDRDELAY_DQS0_2 EQU (0x2 <<  8) ;- (SFR) 
AT91C_SFR_DDRDELAY_DQS0_3 EQU (0x3 <<  8) ;- (SFR) 
AT91C_SFR_DDRDELAY_DQS0_4 EQU (0x4 <<  8) ;- (SFR) 
AT91C_SFR_DDRDELAY_DQS0_5 EQU (0x5 <<  8) ;- (SFR) 
AT91C_SFR_DDRDELAY_DQS0_6 EQU (0x6 <<  8) ;- (SFR) 
AT91C_SFR_DDRDELAY_DQS0_7 EQU (0x7 <<  8) ;- (SFR) 
AT91C_SFR_DDRDELAY_DQS0_8 EQU (0x8 <<  8) ;- (SFR) 
AT91C_SFR_DDRDELAY_DQS0_9 EQU (0x9 <<  8) ;- (SFR) 
AT91C_SFR_DDRDELAY_DQS0_10 EQU (0xA <<  8) ;- (SFR) 
AT91C_SFR_DDRDELAY_DQS0_11 EQU (0xB <<  8) ;- (SFR) 
AT91C_SFR_DDRDELAY_DQS0_12 EQU (0xC <<  8) ;- (SFR) 
AT91C_SFR_DDRDELAY_DQS0_13 EQU (0xD <<  8) ;- (SFR) 
AT91C_SFR_DDRDELAY_DQS0_14 EQU (0xE <<  8) ;- (SFR) 
AT91C_SFR_DDRDELAY_DQS0_15 EQU (0xF <<  8) ;- (SFR) 
AT91C_SFR_DDRDELAY_DQS0_16 EQU (0x10 <<  8) ;- (SFR) 
AT91C_SFR_DDRDELAY_DQS1   EQU (0xFF << 16) ;- (SFR) Control DQS1 clock delay
AT91C_SFR_DDRDELAY_DQS1_0 EQU (0x0 << 16) ;- (SFR) minimum delay
AT91C_SFR_DDRDELAY_DQS1_1 EQU (0x1 << 16) ;- (SFR) 
AT91C_SFR_DDRDELAY_DQS1_2 EQU (0x2 << 16) ;- (SFR) 
AT91C_SFR_DDRDELAY_DQS1_3 EQU (0x3 << 16) ;- (SFR) 
AT91C_SFR_DDRDELAY_DQS1_4 EQU (0x4 << 16) ;- (SFR) 
AT91C_SFR_DDRDELAY_DQS1_5 EQU (0x5 << 16) ;- (SFR) 
AT91C_SFR_DDRDELAY_DQS1_6 EQU (0x6 << 16) ;- (SFR) 
AT91C_SFR_DDRDELAY_DQS1_7 EQU (0x7 << 16) ;- (SFR) 
AT91C_SFR_DDRDELAY_DQS1_8 EQU (0x8 << 16) ;- (SFR) 
AT91C_SFR_DDRDELAY_DQS1_9 EQU (0x9 << 16) ;- (SFR) 
AT91C_SFR_DDRDELAY_DQS1_10 EQU (0xA << 16) ;- (SFR) 
AT91C_SFR_DDRDELAY_DQS1_11 EQU (0xB << 16) ;- (SFR) 
AT91C_SFR_DDRDELAY_DQS1_12 EQU (0xC << 16) ;- (SFR) 
AT91C_SFR_DDRDELAY_DQS1_13 EQU (0xD << 16) ;- (SFR) 
AT91C_SFR_DDRDELAY_DQS1_14 EQU (0xE << 16) ;- (SFR) 
AT91C_SFR_DDRDELAY_DQS1_15 EQU (0xF << 16) ;- (SFR) 
AT91C_SFR_DDRDELAY_DQS1_16 EQU (0x10 << 16) ;- (SFR) 
// - -------- SFR_EBIDELAY : (SFR Offset: 0xc) EBI DDR controller clock delay -------- 
AT91C_SFR_EBIDELAY_CLK    EQU (0xFF <<  0) ;- (SFR) Control CLK clock delay
AT91C_SFR_EBIDELAY_CLK_0  EQU (0x0) ;- (SFR) minimum delay
AT91C_SFR_EBIDELAY_CLK_1  EQU (0x1) ;- (SFR) 
AT91C_SFR_EBIDELAY_CLK_2  EQU (0x2) ;- (SFR) 
AT91C_SFR_EBIDELAY_CLK_3  EQU (0x3) ;- (SFR) 
AT91C_SFR_EBIDELAY_CLK_4  EQU (0x4) ;- (SFR) 
AT91C_SFR_EBIDELAY_CLK_5  EQU (0x5) ;- (SFR) 
AT91C_SFR_EBIDELAY_CLK_6  EQU (0x6) ;- (SFR) 
AT91C_SFR_EBIDELAY_CLK_7  EQU (0x7) ;- (SFR) 
AT91C_SFR_EBIDELAY_CLK_8  EQU (0x8) ;- (SFR) 
AT91C_SFR_EBIDELAY_CLK_9  EQU (0x9) ;- (SFR) 
AT91C_SFR_EBIDELAY_CLK_10 EQU (0xA) ;- (SFR) 
AT91C_SFR_EBIDELAY_CLK_11 EQU (0xB) ;- (SFR) 
AT91C_SFR_EBIDELAY_CLK_12 EQU (0xC) ;- (SFR) 
AT91C_SFR_EBIDELAY_CLK_13 EQU (0xD) ;- (SFR) 
AT91C_SFR_EBIDELAY_CLK_14 EQU (0xE) ;- (SFR) 
AT91C_SFR_EBIDELAY_CLK_15 EQU (0xF) ;- (SFR) 
AT91C_SFR_EBIDELAY_CLK_16 EQU (0x10) ;- (SFR) 
AT91C_SFR_EBIDELAY_DQS0   EQU (0xFF <<  8) ;- (SFR) Control DQS0 clock delay
AT91C_SFR_EBIDELAY_DQS0_0 EQU (0x0 <<  8) ;- (SFR) minimum delay
AT91C_SFR_EBIDELAY_DQS0_1 EQU (0x1 <<  8) ;- (SFR) 
AT91C_SFR_EBIDELAY_DQS0_2 EQU (0x2 <<  8) ;- (SFR) 
AT91C_SFR_EBIDELAY_DQS0_3 EQU (0x3 <<  8) ;- (SFR) 
AT91C_SFR_EBIDELAY_DQS0_4 EQU (0x4 <<  8) ;- (SFR) 
AT91C_SFR_EBIDELAY_DQS0_5 EQU (0x5 <<  8) ;- (SFR) 
AT91C_SFR_EBIDELAY_DQS0_6 EQU (0x6 <<  8) ;- (SFR) 
AT91C_SFR_EBIDELAY_DQS0_7 EQU (0x7 <<  8) ;- (SFR) 
AT91C_SFR_EBIDELAY_DQS0_8 EQU (0x8 <<  8) ;- (SFR) 
AT91C_SFR_EBIDELAY_DQS0_9 EQU (0x9 <<  8) ;- (SFR) 
AT91C_SFR_EBIDELAY_DQS0_10 EQU (0xA <<  8) ;- (SFR) 
AT91C_SFR_EBIDELAY_DQS0_11 EQU (0xB <<  8) ;- (SFR) 
AT91C_SFR_EBIDELAY_DQS0_12 EQU (0xC <<  8) ;- (SFR) 
AT91C_SFR_EBIDELAY_DQS0_13 EQU (0xD <<  8) ;- (SFR) 
AT91C_SFR_EBIDELAY_DQS0_14 EQU (0xE <<  8) ;- (SFR) 
AT91C_SFR_EBIDELAY_DQS0_15 EQU (0xF <<  8) ;- (SFR) 
AT91C_SFR_EBIDELAY_DQS0_16 EQU (0x10 <<  8) ;- (SFR) 
AT91C_SFR_EBIDELAY_DQS1   EQU (0xFF << 16) ;- (SFR) Control DQS1 clock delay
AT91C_SFR_EBIDELAY_DQS1_0 EQU (0x0 << 16) ;- (SFR) minimum delay
AT91C_SFR_EBIDELAY_DQS1_1 EQU (0x1 << 16) ;- (SFR) 
AT91C_SFR_EBIDELAY_DQS1_2 EQU (0x2 << 16) ;- (SFR) 
AT91C_SFR_EBIDELAY_DQS1_3 EQU (0x3 << 16) ;- (SFR) 
AT91C_SFR_EBIDELAY_DQS1_4 EQU (0x4 << 16) ;- (SFR) 
AT91C_SFR_EBIDELAY_DQS1_5 EQU (0x5 << 16) ;- (SFR) 
AT91C_SFR_EBIDELAY_DQS1_6 EQU (0x6 << 16) ;- (SFR) 
AT91C_SFR_EBIDELAY_DQS1_7 EQU (0x7 << 16) ;- (SFR) 
AT91C_SFR_EBIDELAY_DQS1_8 EQU (0x8 << 16) ;- (SFR) 
AT91C_SFR_EBIDELAY_DQS1_9 EQU (0x9 << 16) ;- (SFR) 
AT91C_SFR_EBIDELAY_DQS1_10 EQU (0xA << 16) ;- (SFR) 
AT91C_SFR_EBIDELAY_DQS1_11 EQU (0xB << 16) ;- (SFR) 
AT91C_SFR_EBIDELAY_DQS1_12 EQU (0xC << 16) ;- (SFR) 
AT91C_SFR_EBIDELAY_DQS1_13 EQU (0xD << 16) ;- (SFR) 
AT91C_SFR_EBIDELAY_DQS1_14 EQU (0xE << 16) ;- (SFR) 
AT91C_SFR_EBIDELAY_DQS1_15 EQU (0xF << 16) ;- (SFR) 
AT91C_SFR_EBIDELAY_DQS1_16 EQU (0x10 << 16) ;- (SFR) 
// - -------- SFR_UTMICFG : (SFR Offset: 0x10) UTMI Software Reset -------- 
AT91C_SFR_UTMICFG_PORT0   EQU (0x1 <<  0) ;- (SFR) UTMI Software Reset port 0
AT91C_SFR_UTMICFG_PORT1   EQU (0x1 <<  1) ;- (SFR) UTMI Software Reset port 1
AT91C_SFR_UTMICFG_OHCI_SUSP_INT_ENABLE EQU (0x1 <<  2) ;- (SFR) OHCI Suspend Interrupt enable
// - -------- SFR_OHCI_SUSP_INT : (SFR Offset: 0x14) OHCI suspend Interrupt status -------- 
AT91C_SFR_OHCI_SUSP_INT_STATUS EQU (0x3 <<  0) ;- (SFR) OHCI suspend Interrupt status
AT91C_SFR_OHCI_SUSP_INT_STATUS_PORT0 EQU (0x1) ;- (SFR) OHCI suspend Interrupt status for port 0
AT91C_SFR_OHCI_SUSP_INT_STATUS_PORT1 EQU (0x2) ;- (SFR) OHCI suspend Interrupt status for port 1

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR System Peripherals
// - *****************************************************************************
// - -------- SLCKSEL : (SYS Offset: 0x3d50) Slow Clock Selection Register -------- 
AT91C_SLCKSEL_RCEN        EQU (0x1 <<  0) ;- (SYS) Enable Internal RC Oscillator
AT91C_SLCKSEL_OSC32EN     EQU (0x1 <<  1) ;- (SYS) Enable External Oscillator
AT91C_SLCKSEL_OSC32BYP    EQU (0x1 <<  2) ;- (SYS) Bypass External Oscillator
AT91C_SLCKSEL_OSCSEL      EQU (0x1 <<  3) ;- (SYS) OSC Selection
// - -------- GPBR : (SYS Offset: 0x3d60) GPBR General Purpose Register -------- 
AT91C_GPBR_GPRV           EQU (0x0 <<  0) ;- (SYS) General Purpose Register Value

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR External Bus Interface
// - *****************************************************************************

