una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9g45.h
// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR AHB Matrix Interface
// - *****************************************************************************
// - -------- MATRIX_MCFG0 : (MATRIX Offset: 0x0) Master Configuration Register ARM-I -------- 
AT91C_MATRIX_ULBT         EQU (0x7 <<  0) ;- (MATRIX) Undefined Length Burst Type
// - -------- MATRIX_MCFG1 : (MATRIX Offset: 0x4) Master Configuration Register ARM-D -------- 
// - -------- MATRIX_MCFG2 : (MATRIX Offset: 0x8) Master Configuration Register PDC -------- 
// - -------- MATRIX_MCFG3 : (MATRIX Offset: 0xc) Master Configuration Register USB Host OHCI -------- 
// - -------- MATRIX_MCFG4 : (MATRIX Offset: 0x10) Master Configuration Register DMA0 -------- 
// - -------- MATRIX_MCFG5 : (MATRIX Offset: 0x14) Master Configuration Register DMA1 -------- 
// - -------- MATRIX_MCFG6 : (MATRIX Offset: 0x18) Master Configuration Register HISI -------- 
// - -------- MATRIX_MCFG7 : (MATRIX Offset: 0x1c) Master Configuration Register LCD -------- 
// - -------- MATRIX_MCFG8 : (MATRIX Offset: 0x20) Master Configuration Register EMAC -------- 
// - -------- MATRIX_MCFG9 : (MATRIX Offset: 0x24) Master Configuration Register USB Device -------- 
// - -------- MATRIX_MCFG10 : (MATRIX Offset: 0x28) Master Configuration Register USB Host EHCI -------- 
// - -------- MATRIX_SCFG0 : (MATRIX Offset: 0x40) Slave Configuration Register 0 -------- 
AT91C_MATRIX_SLOT_CYCLE   EQU (0xFF <<  0) ;- (MATRIX) Maximum Number of Allowed Cycles for a Burst
AT91C_MATRIX_DEFMSTR_TYPE EQU (0x3 << 16) ;- (MATRIX) Default Master Type
AT91C_MATRIX_DEFMSTR_TYPE_NO_DEFMSTR EQU (0x0 << 16) ;- (MATRIX) No Default Master. At the end of current slave access, if no other master request is pending, the slave is deconnected from all masters. This results in having a one cycle latency for the first transfer of a burst.
AT91C_MATRIX_DEFMSTR_TYPE_LAST_DEFMSTR EQU (0x1 << 16) ;- (MATRIX) Last Default Master. At the end of current slave access, if no other master request is pending, the slave stay connected with the last master having accessed it. This results in not having the one cycle latency when the last master re-trying access on the slave.
AT91C_MATRIX_DEFMSTR_TYPE_FIXED_DEFMSTR EQU (0x2 << 16) ;- (MATRIX) Fixed Default Master. At the end of current slave access, if no other master request is pending, the slave connects with fixed which number is in FIXED_DEFMSTR field. This results in not having the one cycle latency when the fixed master re-trying access on the slave.
AT91C_MATRIX_FIXED_DEFMSTR0 EQU (0xF << 18) ;- (MATRIX) Fixed Index of Default Master
AT91C_MATRIX_FIXED_DEFMSTR0_ARM926I EQU (0x0 << 18) ;- (MATRIX) ARM926EJ-S Instruction Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR0_ARM926D EQU (0x1 << 18) ;- (MATRIX) ARM926EJ-S Data Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR0_PDC EQU (0x2 << 18) ;- (MATRIX) PDC Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR0_UHPHS_OHCI EQU (0x3 << 18) ;- (MATRIX) USB Host OHCI Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR0_DMA0 EQU (0x4 << 18) ;- (MATRIX) DMA0 Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR0_DMA1 EQU (0x5 << 18) ;- (MATRIX) DMA1 Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR0_ISI EQU (0x6 << 18) ;- (MATRIX) ISI Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR0_EMAC EQU (0x8 << 18) ;- (MATRIX) EMAC Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR0_UDPHS EQU (0x9 << 18) ;- (MATRIX) USB Device Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR0_UHPHS_EHCI EQU (0xA << 18) ;- (MATRIX) USB Host EHCI Master is Default Master
AT91C_MATRIX_ARBT         EQU (0x3 << 24) ;- (MATRIX) Arbitration Type
// - -------- MATRIX_SCFG1 : (MATRIX Offset: 0x44) Slave Configuration Register 1 -------- 
AT91C_MATRIX_FIXED_DEFMSTR1 EQU (0xF << 18) ;- (MATRIX) Fixed Index of Default Master
AT91C_MATRIX_FIXED_DEFMSTR1_ARM926I EQU (0x0 << 18) ;- (MATRIX) ARM926EJ-S Instruction Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR1_ARM926D EQU (0x1 << 18) ;- (MATRIX) ARM926EJ-S Data Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR1_PDC EQU (0x2 << 18) ;- (MATRIX) PDC Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR1_ISI EQU (0x6 << 18) ;- (MATRIX) ISI Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR1_UDPHS EQU (0x9 << 18) ;- (MATRIX) USB Device Master is Default Master
// - -------- MATRIX_SCFG2 : (MATRIX Offset: 0x48) Slave Configuration Register 2 -------- 
AT91C_MATRIX_FIXED_DEFMSTR2 EQU (0xF << 18) ;- (MATRIX) Fixed Index of Default Master
AT91C_MATRIX_FIXED_DEFMSTR2_ARM926I EQU (0x0 << 18) ;- (MATRIX) ARM926EJ-S Instruction Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR2_VDEC EQU (0xB << 18) ;- (MATRIX) Video Decoder Master is Default Master
// - -------- MATRIX_SCFG3 : (MATRIX Offset: 0x4c) Slave Configuration Register 3 -------- 
AT91C_MATRIX_FIXED_DEFMSTR3 EQU (0xF << 18) ;- (MATRIX) Fixed Index of Default Master
AT91C_MATRIX_FIXED_DEFMSTR3_ARM926D EQU (0x1 << 18) ;- (MATRIX) ARM926EJ-S Data Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR3_LCD EQU (0x7 << 18) ;- (MATRIX) LCD Master is Default Master
// - -------- MATRIX_SCFG4 : (MATRIX Offset: 0x50) Slave Configuration Register 4 -------- 
AT91C_MATRIX_FIXED_DEFMSTR4 EQU (0xF << 18) ;- (MATRIX) Fixed Index of Default Master
AT91C_MATRIX_FIXED_DEFMSTR4_ARM926I EQU (0x0 << 18) ;- (MATRIX) ARM926EJ-S Instruction Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR4_PDC EQU (0x2 << 18) ;- (MATRIX) PDC Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR4_UHPHS_OHCI EQU (0x3 << 18) ;- (MATRIX) USB Host OHCI Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR4_DMA0 EQU (0x4 << 18) ;- (MATRIX) DMA0 Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR4_DMA1 EQU (0x5 << 18) ;- (MATRIX) DMA1 Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR4_ISI EQU (0x6 << 18) ;- (MATRIX) ISI Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR4_EMAC EQU (0x8 << 18) ;- (MATRIX) EMAC Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR4_UDPHS EQU (0x9 << 18) ;- (MATRIX) USB Device Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR4_UHPHS_EHCI EQU (0xA << 18) ;- (MATRIX) USB Host EHCI Master is Default Master
// - -------- MATRIX_SCFG5 : (MATRIX Offset: 0x54) Slave Configuration Register 5 -------- 
AT91C_MATRIX_FIXED_DEFMSTR5 EQU (0xF << 18) ;- (MATRIX) Fixed Index of Default Master
AT91C_MATRIX_FIXED_DEFMSTR5_ARM926D EQU (0x1 << 18) ;- (MATRIX) ARM926EJ-S Data Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR5_PDC EQU (0x2 << 18) ;- (MATRIX) PDC Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR5_UHPHS_OHCI EQU (0x3 << 18) ;- (MATRIX) USB Host OHCI Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR5_DMA0 EQU (0x4 << 18) ;- (MATRIX) DMA0 Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR5_DMA1 EQU (0x5 << 18) ;- (MATRIX) DMA1 Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR5_ISI EQU (0x6 << 18) ;- (MATRIX) ISI Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR5_EMAC EQU (0x8 << 18) ;- (MATRIX) EMAC Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR5_UDPHS EQU (0x9 << 18) ;- (MATRIX) USB Device Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR5_UHPHS_EHCI EQU (0xA << 18) ;- (MATRIX) USB Host EHCI Master is Default Master
// - -------- MATRIX_SCFG6 : (MATRIX Offset: 0x58) Slave Configuration Register 6 -------- 
AT91C_MATRIX_FIXED_DEFMSTR6 EQU (0xF << 18) ;- (MATRIX) Fixed Index of Default Master
AT91C_MATRIX_FIXED_DEFMSTR6_ARM926I EQU (0x0 << 18) ;- (MATRIX) ARM926EJ-S Instruction Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR6_ARM926D EQU (0x1 << 18) ;- (MATRIX) ARM926EJ-S Data Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR6_PDC EQU (0x2 << 18) ;- (MATRIX) PDC Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR6_UHPHS_OHCI EQU (0x3 << 18) ;- (MATRIX) USB Host OHCI Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR6_DMA0 EQU (0x4 << 18) ;- (MATRIX) DMA0 Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR6_DMA1 EQU (0x5 << 18) ;- (MATRIX) DMA1 Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR6_ISI EQU (0x6 << 18) ;- (MATRIX) ISI Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR6_LCD EQU (0x7 << 18) ;- (MATRIX) LCD Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR6_EMAC EQU (0x8 << 18) ;- (MATRIX) EMAC Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR6_UDPHS EQU (0x9 << 18) ;- (MATRIX) USB Device Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR6_UHPHS_EHCI EQU (0xA << 18) ;- (MATRIX) USB Host EHCI Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR6_VDEC EQU (0xB << 18) ;- (MATRIX) Video Decoder Master is Default Master
// - -------- MATRIX_SCFG7 : (MATRIX Offset: 0x5c) Slave Configuration Register 7 -------- 
AT91C_MATRIX_FIXED_DEFMSTR7 EQU (0xF << 18) ;- (MATRIX) Fixed Index of Default Master
AT91C_MATRIX_FIXED_DEFMSTR7_ARM926I EQU (0x0 << 18) ;- (MATRIX) ARM926EJ-S Instruction Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR7_ARM926D EQU (0x1 << 18) ;- (MATRIX) ARM926EJ-S Data Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR7_PDC EQU (0x2 << 18) ;- (MATRIX) PDC Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR7_DMA0 EQU (0x4 << 18) ;- (MATRIX) DMA0 Master is Default Master
AT91C_MATRIX_FIXED_DEFMSTR7_DMA1 EQU (0x5 << 18) ;- (MATRIX) DMA1 Master is Default Master
// - -------- MATRIX_PRAS0 : (MATRIX Offset: 0x80) PRAS0 Register -------- 
AT91C_MATRIX_M0PR         EQU (0x3 <<  0) ;- (MATRIX) ARM926EJ-S Instruction priority
AT91C_MATRIX_M1PR         EQU (0x3 <<  4) ;- (MATRIX) ARM926EJ-S Data priority
AT91C_MATRIX_M2PR         EQU (0x3 <<  8) ;- (MATRIX) PDC priority
AT91C_MATRIX_M3PR         EQU (0x3 << 12) ;- (MATRIX) USB Host OHCI priority
AT91C_MATRIX_M4PR         EQU (0x3 << 16) ;- (MATRIX) DMA0 priority
AT91C_MATRIX_M5PR         EQU (0x3 << 20) ;- (MATRIX) DMA1 priority
AT91C_MATRIX_M6PR         EQU (0x3 << 24) ;- (MATRIX) ISI priority
AT91C_MATRIX_M7PR         EQU (0x3 << 28) ;- (MATRIX) LCD priority
// - -------- MATRIX_PRBS0 : (MATRIX Offset: 0x84) PRBS0 Register -------- 
AT91C_MATRIX_M8PR         EQU (0x3 <<  0) ;- (MATRIX) EMAC priority
AT91C_MATRIX_M9PR         EQU (0x3 <<  4) ;- (MATRIX) USB Device priority
AT91C_MATRIX_M10PR        EQU (0x3 <<  8) ;- (MATRIX) USB Host EHCI priority
AT91C_MATRIX_M11PR        EQU (0x3 << 12) ;- (MATRIX) Video Decoder priority
// - -------- MATRIX_PRAS1 : (MATRIX Offset: 0x88) PRAS1 Register -------- 
// - -------- MATRIX_PRBS1 : (MATRIX Offset: 0x8c) PRBS1 Register -------- 
// - -------- MATRIX_PRAS2 : (MATRIX Offset: 0x90) PRAS2 Register -------- 
// - -------- MATRIX_PRBS2 : (MATRIX Offset: 0x94) PRBS2 Register -------- 
// - -------- MATRIX_PRAS3 : (MATRIX Offset: 0x98) PRAS3 Register -------- 
// - -------- MATRIX_PRBS3 : (MATRIX Offset: 0x9c) PRBS3 Register -------- 
// - -------- MATRIX_PRAS4 : (MATRIX Offset: 0xa0) PRAS4 Register -------- 
// - -------- MATRIX_PRBS4 : (MATRIX Offset: 0xa4) PRBS4 Register -------- 
// - -------- MATRIX_PRAS5 : (MATRIX Offset: 0xa8) PRAS5 Register -------- 
// - -------- MATRIX_PRBS5 : (MATRIX Offset: 0xac) PRBS5 Register -------- 
// - -------- MATRIX_PRAS6 : (MATRIX Offset: 0xb0) PRAS6 Register -------- 
// - -------- MATRIX_PRBS6 : (MATRIX Offset: 0xb4) PRBS6 Register -------- 
// - -------- MATRIX_PRAS7 : (MATRIX Offset: 0xb8) PRAS7 Register -------- 
// - -------- MATRIX_PRBS7 : (MATRIX Offset: 0xbc) PRBS7 Register -------- 
// - -------- MATRIX_MRCR : (MATRIX Offset: 0x100) MRCR Register -------- 
AT91C_MATRIX_RCA926I      EQU (0x1 <<  0) ;- (MATRIX) Remap Command Bit for ARM926EJ-S Instruction
AT91C_MATRIX_RCA926D      EQU (0x1 <<  1) ;- (MATRIX) Remap Command Bit for ARM926EJ-S Data
AT91C_MATRIX_RCB2         EQU (0x1 <<  2) ;- (MATRIX) Remap Command Bit for PDC
AT91C_MATRIX_RCB3         EQU (0x1 <<  3) ;- (MATRIX) Remap Command Bit for USB Host OHCI
AT91C_MATRIX_RCB4         EQU (0x1 <<  4) ;- (MATRIX) Remap Command Bit for DMA0
AT91C_MATRIX_RCB5         EQU (0x1 <<  5) ;- (MATRIX) Remap Command Bit for DMA1
AT91C_MATRIX_RCB6         EQU (0x1 <<  6) ;- (MATRIX) Remap Command Bit for ISI
AT91C_MATRIX_RCB7         EQU (0x1 <<  7) ;- (MATRIX) Remap Command Bit for LCD
AT91C_MATRIX_RCB8         EQU (0x1 <<  8) ;- (MATRIX) Remap Command Bit for EMAC
AT91C_MATRIX_RCB9         EQU (0x1 <<  9) ;- (MATRIX) Remap Command Bit for USB Device
AT91C_MATRIX_RCB10        EQU (0x1 << 10) ;- (MATRIX) Remap Command Bit for USB Host EHCI
AT91C_MATRIX_RCB11        EQU (0x1 << 11) ;- (MATRIX) Remap Command Bit for Video Decoder
// - -------- HMATRIX_CCFG_TCMR : (MATRIX Offset: 0x110) TCMR Register -------- 
AT91C_ITCM_SIZE           EQU (0xF <<  0) ;- (MATRIX) Size of ITCM enabled memory block
AT91C_ITCM_SIZE_0KB       EQU (0x0) ;- (MATRIX) 0 KB (No ITCM Memory)
AT91C_ITCM_SIZE_32KB      EQU (0x6) ;- (MATRIX) 32 KB
AT91C_DTCM_SIZE           EQU (0xF <<  4) ;- (MATRIX) Size of DTCM enabled memory block
AT91C_DTCM_SIZE_0KB       EQU (0x0 <<  4) ;- (MATRIX) 0 KB (No DTCM Memory)
AT91C_DTCM_SIZE_32KB      EQU (0x6 <<  4) ;- (MATRIX) 32 KB
AT91C_DTCM_SIZE_64KB      EQU (0x7 <<  4) ;- (MATRIX) 64 KB
AT91C_TCM_NWS             EQU (0x1 << 11) ;- (MATRIX) TCM Wait State
AT91C_TCM_NWS_NO_WS       EQU (0x0 << 11) ;- (MATRIX) NO WAIT STATE : 0 WS
AT91C_TCM_NWS_ONE_WS      EQU (0x1 << 11) ;- (MATRIX) 1 WS activated (only for RATIO 3:1 or 4:1
// - -------- HMATRIX_CCFG_DDRMPR : (MATRIX Offset: 0x118) DDR Multi-Port Register -------- 
AT91C_DDRMP_DIS           EQU (0x1 <<  0) ;- (MATRIX) DDR Multi-Port Disable
// - -------- HMATRIX_CCFG_EBICSA : (MATRIX Offset: 0x128) CCFG_EBICSA Register -------- 
AT91C_EBI_CS1A            EQU (0x1 <<  1) ;- (MATRIX) EBI Chip Select 1 Assignment
AT91C_EBI_CS1A_SMC        EQU (0x0 <<  1) ;- (MATRIX) Chip Select 1 is assigned to the Static Memory Controller.
AT91C_EBI_CS1A_SDRAMC     EQU (0x1 <<  1) ;- (MATRIX) Chip Select 1 is assigned to the SDRAM Controller.
AT91C_EBI_CS3A            EQU (0x1 <<  3) ;- (MATRIX) EBI Chip Select 3 Assignment
AT91C_EBI_CS3A_SMC        EQU (0x0 <<  3) ;- (MATRIX) Chip Select 3 is only assigned to the Static Memory Controller and NCS3 behaves as defined by the SMC.
AT91C_EBI_CS3A_SM         EQU (0x1 <<  3) ;- (MATRIX) Chip Select 3 is assigned to the Static Memory Controller and the SmartMedia Logic is activated.
AT91C_EBI_CS4A            EQU (0x1 <<  4) ;- (MATRIX) EBI Chip Select 4 Assignment
AT91C_EBI_CS4A_SMC        EQU (0x0 <<  4) ;- (MATRIX) Chip Select 4 is only assigned to the Static Memory Controller and NCS4 behaves as defined by the SMC.
AT91C_EBI_CS4A_CF         EQU (0x1 <<  4) ;- (MATRIX) Chip Select 4 is assigned to the Static Memory Controller and the CompactFlash Logic (first slot) is activated.
AT91C_EBI_CS5A            EQU (0x1 <<  5) ;- (MATRIX) EBI Chip Select 5 Assignment
AT91C_EBI_CS5A_SMC        EQU (0x0 <<  5) ;- (MATRIX) Chip Select 5 is only assigned to the Static Memory Controller and NCS5 behaves as defined by the SMC
AT91C_EBI_CS5A_CF         EQU (0x1 <<  5) ;- (MATRIX) Chip Select 5 is assigned to the Static Memory Controller and the CompactFlash Logic (second slot) is activated.
AT91C_EBI_DBPUC           EQU (0x1 <<  8) ;- (MATRIX) EBI Data Bus Pull-Up Configuration
AT91C_EBI_DRIVE           EQU (0x3 << 16) ;- (MATRIX) EBI I/O Drive Configuration
AT91C_EBI_DRIVE_18RD      EQU (0x0 << 16) ;- (MATRIX) optimized for 1.8V powered memories with Reduced Drive
AT91C_EBI_DRIVE_33RD      EQU (0x1 << 16) ;- (MATRIX) optimized for 3.3V powered memories with Reduced Drive
AT91C_EBI_DRIVE_18ND      EQU (0x2 << 16) ;- (MATRIX) optimized for 1.8V powered memories with Normal Drive
AT91C_EBI_DRIVE_33ND      EQU (0x3 << 16) ;- (MATRIX) optimized for 3.3V powered memories with Normal Drive
AT91C_DDR_DRIVE           EQU (0x1 << 18) ;- (MATRIX) DDR2 dedicated port I/O slew rate selection
// - -------- MATRIX_WRPROTEN : (MATRIX Offset: 0x1e4) Write Protection Control Register -------- 
AT91C_MATRIX_WRPROT       EQU (0x1 <<  0) ;- (MATRIX) Enable/Disable Write Protection of HMATRIX2 configuration registers (requires key)
AT91C_MATRIX_WRPROT_DISABLE EQU (0x0) ;- (MATRIX) Disable Write Protection of HMATRIX2 configuration registers
AT91C_MATRIX_WRPROT_ENABLE EQU (0x1) ;- (MATRIX) Enable  Write Protection of HMATRIX2 configuration registers
// - -------- MATRIX_WRPROTST : (MATRIX Offset: 0x1e8) Write Protection Status Register -------- 
AT91C_MATRIX_WRPROT_VIOLATION EQU (0x1 <<  0) ;- (MATRIX) Violation of Write Protection of HMATRIX2 configuration registers
AT91C_MATRIX_WRPROT_VIOLATION_UNDETECTED EQU (0x0) ;- (MATRIX) No violation of Write Protection of HMATRIX2 configuration registers
AT91C_MATRIX_WRPROT_VIOLATION_DETECTED EQU (0x1) ;- (MATRIX) Violation of  Write Protection of HMATRIX2 configuration registers
AT91C_MATRIX_WRPROT_VIOLATION_OFFSET EQU (0x1FF <<  8) ;- (MATRIX) Offset where violation of Write Protection of HMATRIX2 configuration registers is detected

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Advanced Interrupt Controller
// - *****************************************************************************
// - -------- AIC_SMR : (AIC Offset: 0x0) Control Register -------- 
AT91C_AIC_PRIOR           EQU (0x7 <<  0) ;- (AIC) Priority Level
AT91C_AIC_PRIOR_LOWEST    EQU (0x0) ;- (AIC) Lowest priority level
AT91C_AIC_PRIOR_HIGHEST   EQU (0x7) ;- (AIC) Highest priority level
AT91C_AIC_SRCTYPE         EQU (0x3 <<  5) ;- (AIC) Interrupt Source Type
AT91C_AIC_SRCTYPE_INT_LEVEL_SENSITIVE EQU (0x0 <<  5) ;- (AIC) Internal Sources Code Label Level Sensitive
AT91C_AIC_SRCTYPE_INT_EDGE_TRIGGERED EQU (0x1 <<  5) ;- (AIC) Internal Sources Code Label Edge triggered
AT91C_AIC_SRCTYPE_EXT_HIGH_LEVEL EQU (0x2 <<  5) ;- (AIC) External Sources Code Label High-level Sensitive
AT91C_AIC_SRCTYPE_EXT_POSITIVE_EDGE EQU (0x3 <<  5) ;- (AIC) External Sources Code Label Positive Edge triggered
// - -------- AIC_CISR : (AIC Offset: 0x114) AIC Core Interrupt Status Register -------- 
AT91C_AIC_NFIQ            EQU (0x1 <<  0) ;- (AIC) NFIQ Status
AT91C_AIC_NIRQ            EQU (0x1 <<  1) ;- (AIC) NIRQ Status
// - -------- AIC_DCR : (AIC Offset: 0x138) AIC Debug Control Register (Protect) -------- 
AT91C_AIC_DCR_PROT        EQU (0x1 <<  0) ;- (AIC) Protection Mode
AT91C_AIC_DCR_GMSK        EQU (0x1 <<  1) ;- (AIC) General Mask

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Peripheral DMA Controller
// - *****************************************************************************
// - -------- PDC_PTCR : (PDC Offset: 0x20) PDC Transfer Control Register -------- 
AT91C_PDC_RXTEN           EQU (0x1 <<  0) ;- (PDC) Receiver Transfer Enable
AT91C_PDC_RXTDIS          EQU (0x1 <<  1) ;- (PDC) Receiver Transfer Disable
AT91C_PDC_TXTEN           EQU (0x1 <<  8) ;- (PDC) Transmitter Transfer Enable
AT91C_PDC_TXTDIS          EQU (0x1 <<  9) ;- (PDC) Transmitter Transfer Disable
// - -------- PDC_PTSR : (PDC Offset: 0x24) PDC Transfer Status Register -------- 

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Debug Unit
// - *****************************************************************************
// - -------- DBGU_CR : (DBGU Offset: 0x0) Debug Unit Control Register -------- 
AT91C_US_RSTRX            EQU (0x1 <<  2) ;- (DBGU) Reset Receiver
AT91C_US_RSTTX            EQU (0x1 <<  3) ;- (DBGU) Reset Transmitter
AT91C_US_RXEN             EQU (0x1 <<  4) ;- (DBGU) Receiver Enable
AT91C_US_RXDIS            EQU (0x1 <<  5) ;- (DBGU) Receiver Disable
AT91C_US_TXEN             EQU (0x1 <<  6) ;- (DBGU) Transmitter Enable
AT91C_US_TXDIS            EQU (0x1 <<  7) ;- (DBGU) Transmitter Disable
AT91C_US_RSTSTA           EQU (0x1 <<  8) ;- (DBGU) Reset Status Bits
// - -------- DBGU_MR : (DBGU Offset: 0x4) Debug Unit Mode Register -------- 
AT91C_US_PAR              EQU (0x7 <<  9) ;- (DBGU) Parity type
AT91C_US_PAR_EVEN         EQU (0x0 <<  9) ;- (DBGU) Even Parity
AT91C_US_PAR_ODD          EQU (0x1 <<  9) ;- (DBGU) Odd Parity
AT91C_US_PAR_SPACE        EQU (0x2 <<  9) ;- (DBGU) Parity forced to 0 (Space)
AT91C_US_PAR_MARK         EQU (0x3 <<  9) ;- (DBGU) Parity forced to 1 (Mark)
AT91C_US_PAR_NONE         EQU (0x4 <<  9) ;- (DBGU) No Parity
AT91C_US_PAR_MULTI_DROP   EQU (0x6 <<  9) ;- (DBGU) Multi-drop mode
AT91C_US_CHMODE           EQU (0x3 << 14) ;- (DBGU) Channel Mode
AT91C_US_CHMODE_NORMAL    EQU (0x0 << 14) ;- (DBGU) Normal Mode: The USART channel operates as an RX/TX USART.
AT91C_US_CHMODE_AUTO      EQU (0x1 << 14) ;- (DBGU) Automatic Echo: Receiver Data Input is connected to the TXD pin.
AT91C_US_CHMODE_LOCAL     EQU (0x2 << 14) ;- (DBGU) Local Loopback: Transmitter Output Signal is connected to Receiver Input Signal.
AT91C_US_CHMODE_REMOTE    EQU (0x3 << 14) ;- (DBGU) Remote Loopback: RXD pin is internally connected to TXD pin.
// - -------- DBGU_IER : (DBGU Offset: 0x8) Debug Unit Interrupt Enable Register -------- 
AT91C_US_RXRDY            EQU (0x1 <<  0) ;- (DBGU) RXRDY Interrupt
AT91C_US_TXRDY            EQU (0x1 <<  1) ;- (DBGU) TXRDY Interrupt
AT91C_US_ENDRX            EQU (0x1 <<  3) ;- (DBGU) End of Receive Transfer Interrupt
AT91C_US_ENDTX            EQU (0x1 <<  4) ;- (DBGU) End of Transmit Interrupt
AT91C_US_OVRE             EQU (0x1 <<  5) ;- (DBGU) Overrun Interrupt
AT91C_US_FRAME            EQU (0x1 <<  6) ;- (DBGU) Framing Error Interrupt
AT91C_US_PARE             EQU (0x1 <<  7) ;- (DBGU) Parity Error Interrupt
AT91C_US_TXEMPTY          EQU (0x1 <<  9) ;- (DBGU) TXEMPTY Interrupt
AT91C_US_TXBUFE           EQU (0x1 << 11) ;- (DBGU) TXBUFE Interrupt
AT91C_US_RXBUFF           EQU (0x1 << 12) ;- (DBGU) RXBUFF Interrupt
AT91C_US_COMM_TX          EQU (0x1 << 30) ;- (DBGU) COMM_TX Interrupt
AT91C_US_COMM_RX          EQU (0x1 << 31) ;- (DBGU) COMM_RX Interrupt
// - -------- DBGU_IDR : (DBGU Offset: 0xc) Debug Unit Interrupt Disable Register -------- 
// - -------- DBGU_IMR : (DBGU Offset: 0x10) Debug Unit Interrupt Mask Register -------- 
// - -------- DBGU_CSR : (DBGU Offset: 0x14) Debug Unit Channel Status Register -------- 
// - -------- DBGU_FNTR : (DBGU Offset: 0x48) Debug Unit FORCE_NTRST Register -------- 
AT91C_US_FORCE_NTRST      EQU (0x1 <<  0) ;- (DBGU) Force NTRST in JTAG

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Parallel Input Output Controler
// - *****************************************************************************

