una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9g45.h
// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Power Management Controller V610
// - *****************************************************************************
// - -------- PMC_SCER : (PMC Offset: 0x0) System Clock Enable Register -------- 
AT91C_PMC_DDR             EQU (0x1 <<  2) ;- (PMC) DDR controller Clock2x
AT91C_PMC_UHP             EQU (0x1 <<  6) ;- (PMC) USB Host Port Clock
AT91C_PMC_UDP             EQU (0x1 <<  7) ;- (PMC) USB Device Port Clock
AT91C_PMC_PCK0            EQU (0x1 <<  8) ;- (PMC) Programmable Clock Output
AT91C_PMC_PCK1            EQU (0x1 <<  9) ;- (PMC) Programmable Clock Output
// - -------- PMC_SCDR : (PMC Offset: 0x4) System Clock Disable Register -------- 
AT91C_PMC_PCK             EQU (0x1 <<  0) ;- (PMC) Processor Clock
// - -------- PMC_SCSR : (PMC Offset: 0x8) System Clock Status Register -------- 
// - -------- CKGR_UCKR : (PMC Offset: 0x1c) UTMI Clock Configuration Register -------- 
AT91C_CKGR_UPLLEN         EQU (0x1 << 16) ;- (PMC) UTMI PLL Enable
AT91C_CKGR_UPLLEN_DISABLED EQU (0x0 << 16) ;- (PMC) The UTMI PLL is disabled
AT91C_CKGR_UPLLEN_ENABLED EQU (0x1 << 16) ;- (PMC) The UTMI PLL is enabled
AT91C_CKGR_PLLCOUNT       EQU (0xF << 20) ;- (PMC) UTMI Oscillator Start-up Time
AT91C_CKGR_BIASEN         EQU (0x1 << 24) ;- (PMC) UTMI BIAS Enable
AT91C_CKGR_BIASEN_DISABLED EQU (0x0 << 24) ;- (PMC) The UTMI BIAS is disabled
AT91C_CKGR_BIASEN_ENABLED EQU (0x1 << 24) ;- (PMC) The UTMI BIAS is enabled
AT91C_CKGR_BIASCOUNT      EQU (0xF << 28) ;- (PMC) UTMI BIAS Start-up Time
// - -------- CKGR_MOR : (PMC Offset: 0x20) Main Oscillator Register -------- 
AT91C_CKGR_MOSCEN         EQU (0x1 <<  0) ;- (PMC) Main Oscillator Enable
AT91C_CKGR_OSCBYPASS      EQU (0x1 <<  1) ;- (PMC) Main Oscillator Bypass
AT91C_CKGR_OSCOUNT        EQU (0xFF <<  8) ;- (PMC) Main Oscillator Start-up Time
// - -------- CKGR_MCFR : (PMC Offset: 0x24) Main Clock Frequency Register -------- 
AT91C_CKGR_MAINF          EQU (0xFFFF <<  0) ;- (PMC) Main Clock Frequency
AT91C_CKGR_MAINRDY        EQU (0x1 << 16) ;- (PMC) Main Clock Ready
// - -------- CKGR_PLLAR : (PMC Offset: 0x28) PLL A Register -------- 
AT91C_CKGR_DIVA           EQU (0xFF <<  0) ;- (PMC) Divider A Selected
AT91C_CKGR_DIVA_0         EQU (0x0) ;- (PMC) Divider A output is 0
AT91C_CKGR_DIVA_BYPASS    EQU (0x1) ;- (PMC) Divider A is bypassed
AT91C_CKGR_PLLACOUNT      EQU (0x3F <<  8) ;- (PMC) PLL A Counter
AT91C_CKGR_OUTA           EQU (0x3 << 14) ;- (PMC) PLL A Output Frequency Range
AT91C_CKGR_OUTA_0         EQU (0x0 << 14) ;- (PMC) Please refer to the PLLA datasheet
AT91C_CKGR_OUTA_1         EQU (0x1 << 14) ;- (PMC) Please refer to the PLLA datasheet
AT91C_CKGR_OUTA_2         EQU (0x2 << 14) ;- (PMC) Please refer to the PLLA datasheet
AT91C_CKGR_OUTA_3         EQU (0x3 << 14) ;- (PMC) Please refer to the PLLA datasheet
AT91C_CKGR_MULA           EQU (0xFF << 16) ;- (PMC) PLL A Multiplier
AT91C_CKGR_SRCA           EQU (0x1 << 29) ;- (PMC) 
// - -------- PMC_MCKR : (PMC Offset: 0x30) Master Clock Register -------- 
AT91C_PMC_CSS             EQU (0x3 <<  0) ;- (PMC) Programmable Clock Selection
AT91C_PMC_CSS_SLOW_CLK    EQU (0x0) ;- (PMC) Slow Clock is selected
AT91C_PMC_CSS_MAIN_CLK    EQU (0x1) ;- (PMC) Main Clock is selected
AT91C_PMC_CSS_PLLA_CLK    EQU (0x2) ;- (PMC) Clock from PLL A is selected
AT91C_PMC_CSS_UPLL_CLK    EQU (0x3) ;- (PMC) Clock from UTMI PLL is selected
AT91C_PMC_PRES            EQU (0x7 <<  2) ;- (PMC) Programmable Clock Prescaler
AT91C_PMC_PRES_CLK        EQU (0x0 <<  2) ;- (PMC) Selected clock
AT91C_PMC_PRES_CLK_2      EQU (0x1 <<  2) ;- (PMC) Selected clock divided by 2
AT91C_PMC_PRES_CLK_4      EQU (0x2 <<  2) ;- (PMC) Selected clock divided by 4
AT91C_PMC_PRES_CLK_8      EQU (0x3 <<  2) ;- (PMC) Selected clock divided by 8
AT91C_PMC_PRES_CLK_16     EQU (0x4 <<  2) ;- (PMC) Selected clock divided by 16
AT91C_PMC_PRES_CLK_32     EQU (0x5 <<  2) ;- (PMC) Selected clock divided by 32
AT91C_PMC_PRES_CLK_64     EQU (0x6 <<  2) ;- (PMC) Selected clock divided by 64
AT91C_PMC_MDIV            EQU (0x3 <<  8) ;- (PMC) Master Clock Division
AT91C_PMC_MDIV_1          EQU (0x0 <<  8) ;- (PMC) Processor clock = Master Clock ; DDR Clock = Master Clock
AT91C_PMC_MDIV_2          EQU (0x1 <<  8) ;- (PMC) Processor clock = 2 * Master Clock ; DDR Clock = 2 * Master Clock
AT91C_PMC_MDIV_4          EQU (0x2 <<  8) ;- (PMC) Processor clock = 4 * Master Clock ; DDR Clock = 2 * Master Clock
AT91C_PMC_MDIV_3          EQU (0x3 <<  8) ;- (PMC) Processor clock = 3 * Master Clock ; DDR Clock = 2 * Master Clock
AT91C_PMC_PLLADIV2        EQU (0x1 << 12) ;- (PMC) PLLA divisor by 2
AT91C_PMC_PLLADIV2_1      EQU (0x0 << 12) ;- (PMC) PLLA clock frequency is divided by 1
AT91C_PMC_PLLADIV2_2      EQU (0x1 << 12) ;- (PMC) PLLA clock frequency is divided by 2
// - -------- PMC_USB : (PMC Offset: 0x38) USB Clock Register -------- 
AT91C_PMC_USBS            EQU (0x1 <<  0) ;- (PMC) USBS
AT91C_PMC_USBS_USB_PLLA   EQU (0x0) ;- (PMC) USB Clock Input is PLLA
AT91C_PMC_USBS_USB_UPLL   EQU (0x1) ;- (PMC) USB Clock Input is UPLL
AT91C_PMC_USBDIV          EQU (0xF <<  8) ;- (PMC) USBDIV
AT91C_PMC_USBDIV_1        EQU (0x0 <<  8) ;- (PMC) USB Clock divided by 1
AT91C_PMC_USBDIV_2        EQU (0x1 <<  8) ;- (PMC) USB Clock divided by 2
AT91C_PMC_USBDIV_3        EQU (0x2 <<  8) ;- (PMC) USB Clock divided by 3
AT91C_PMC_USBDIV_4        EQU (0x3 <<  8) ;- (PMC) USB Clock divided by 4
AT91C_PMC_USBDIV_5        EQU (0x4 <<  8) ;- (PMC) USB Clock divided by 5
AT91C_PMC_USBDIV_6        EQU (0x5 <<  8) ;- (PMC) USB Clock divided by 6
AT91C_PMC_USBDIV_7        EQU (0x6 <<  8) ;- (PMC) USB Clock divided by 7
AT91C_PMC_USBDIV_8        EQU (0x7 <<  8) ;- (PMC) USB Clock divided by 8
AT91C_PMC_USBDIV_9        EQU (0x8 <<  8) ;- (PMC) USB Clock divided by 9
AT91C_PMC_USBDIV_10       EQU (0x9 <<  8) ;- (PMC) USB Clock divided by 10
AT91C_PMC_USBDIV_11       EQU (0xA <<  8) ;- (PMC) USB Clock divided by 11
AT91C_PMC_USBDIV_12       EQU (0xB <<  8) ;- (PMC) USB Clock divided by 12
AT91C_PMC_USBDIV_13       EQU (0xC <<  8) ;- (PMC) USB Clock divided by 13
AT91C_PMC_USBDIV_14       EQU (0xD <<  8) ;- (PMC) USB Clock divided by 14
AT91C_PMC_USBDIV_15       EQU (0xE <<  8) ;- (PMC) USB Clock divided by 15
AT91C_PMC_USBDIV_16       EQU (0xF <<  8) ;- (PMC) USB Clock divided by 16
// - -------- PMC_PCKR : (PMC Offset: 0x40) Programmable Clock 0 Register -------- 
AT91C_PMC_SLCKMCK         EQU (0x1 <<  8) ;- (PMC) Programmable Clock Prescaler
AT91C_PMC_SLCKMCK_SLCK    EQU (0x0 <<  8) ;- (PMC) Slow Clock selected
AT91C_PMC_SLCKMCK_MCK     EQU (0x1 <<  8) ;- (PMC) Master Clock selected
// - -------- PMC_IER : (PMC Offset: 0x60) PMC Interrupt Enable Register -------- 
AT91C_PMC_MOSCS           EQU (0x1 <<  0) ;- (PMC) MOSC Status/Enable/Disable/Mask
AT91C_PMC_LOCKA           EQU (0x1 <<  1) ;- (PMC) PLL A Status/Enable/Disable/Mask
AT91C_PMC_MCKRDY          EQU (0x1 <<  3) ;- (PMC) Master Clock Status/Enable/Disable/Mask
AT91C_PMC_LOCKU           EQU (0x1 <<  6) ;- (PMC) PLL UTMI Status/Enable/Disable/Mask
AT91C_PMC_PCK0RDY         EQU (0x1 <<  8) ;- (PMC) PCK0_RDY Status/Enable/Disable/Mask
AT91C_PMC_PCK1RDY         EQU (0x1 <<  9) ;- (PMC) PCK1_RDY Status/Enable/Disable/Mask
// - -------- PMC_IDR : (PMC Offset: 0x64) PMC Interrupt Disable Register -------- 
// - -------- PMC_SR : (PMC Offset: 0x68) PMC Status Register -------- 
// - -------- PMC_IMR : (PMC Offset: 0x6c) PMC Interrupt Mask Register -------- 
// - -------- PMC_PLLICPR : (PMC Offset: 0x80) PLL Charge Pump Current Register -------- 
AT91C_PMC_ICPPLLA         EQU (0xF <<  0) ;- (PMC) PLLA charge pump current setting
AT91C_PMC_ICPPLLA_0       EQU (0x0) ;- (PMC) 595-800 MHz
AT91C_PMC_ICPPLLA_1       EQU (0x1) ;- (PMC) 395-600 MHz
AT91C_PMC_REALLOCK        EQU (0x1 <<  7) ;- (PMC) PLLs use real lock signals when 1
AT91C_PMC_IPLLA           EQU (0xF <<  8) ;- (PMC) PLLA special setting
AT91C_PMC_IPLLA_0         EQU (0x0 <<  8) ;- (PMC) Internal LFT
AT91C_PMC_IPLLA_1         EQU (0x1 <<  8) ;- (PMC) External LFT
// - -------- PMC_FEATURES : (PMC Offset: 0xf8)   -------- 
AT91C_PMC_CFGAHBCLK       EQU (0x1 <<  0) ;- (PMC) 
AT91C_PMC_CFGAHBCLK_0     EQU (0x0) ;- (PMC) 
AT91C_PMC_CFGAHBCLK_1     EQU (0x1) ;- (PMC) 
AT91C_PMC_HCLKEN          EQU (0x1 <<  1) ;- (PMC) 
AT91C_PMC_HCLKEN_0        EQU (0x0 <<  1) ;- (PMC) 
AT91C_PMC_HCLKEN_1        EQU (0x1 <<  1) ;- (PMC) 
AT91C_PMC_PERMCLK         EQU (0x1 <<  2) ;- (PMC) 
AT91C_PMC_PERMCLK_0       EQU (0x0 <<  2) ;- (PMC) 
AT91C_PMC_PERMCLK_1       EQU (0x1 <<  2) ;- (PMC) 
AT91C_PMC_CORE2           EQU (0x1 <<  3) ;- (PMC) 
AT91C_PMC_CORE2_0         EQU (0x0 <<  3) ;- (PMC) 
AT91C_PMC_CORE2_1         EQU (0x1 <<  3) ;- (PMC) 
AT91C_PMC_USBDEVCK        EQU (0x1 <<  4) ;- (PMC) 
AT91C_PMC_USBDEVCK_0      EQU (0x0 <<  4) ;- (PMC) 
AT91C_PMC_USBDEVCK_1      EQU (0x1 <<  4) ;- (PMC) 
AT91C_PMC_USBHOSTCK       EQU (0x1 <<  5) ;- (PMC) 
AT91C_PMC_USBHOSTCK_0     EQU (0x0 <<  5) ;- (PMC) 
AT91C_PMC_USBHOSTCK_1     EQU (0x1 <<  5) ;- (PMC) 
AT91C_PMC_USBOTGCK        EQU (0x1 <<  6) ;- (PMC) 
AT91C_PMC_USBOTGCK_0      EQU (0x0 <<  6) ;- (PMC) 
AT91C_PMC_USBOTGCK_1      EQU (0x1 <<  6) ;- (PMC) 
AT91C_PMC_UHSYNRST        EQU (0x1 <<  7) ;- (PMC) 
AT91C_PMC_UHSYNRST_0      EQU (0x0 <<  7) ;- (PMC) 
AT91C_PMC_UHSYNRST_1      EQU (0x1 <<  7) ;- (PMC) 
AT91C_PMC_UOSYNRST        EQU (0x1 <<  8) ;- (PMC) 
AT91C_PMC_UOSYNRST_0      EQU (0x0 <<  8) ;- (PMC) 
AT91C_PMC_UOSYNRST_1      EQU (0x1 <<  8) ;- (PMC) 
AT91C_PMC_PLLENPOL        EQU (0x1 <<  9) ;- (PMC) 
AT91C_PMC_PLLENPOL_0      EQU (0x0 <<  9) ;- (PMC) 
AT91C_PMC_PLLENPOL_1      EQU (0x1 <<  9) ;- (PMC) 
AT91C_PMC_BIASREG         EQU (0x1 << 10) ;- (PMC) 
AT91C_PMC_BIASREG_0       EQU (0x0 << 10) ;- (PMC) 
AT91C_PMC_BIASREG_1       EQU (0x1 << 10) ;- (PMC) 
AT91C_PMC_OUTPLL          EQU (0x1 << 11) ;- (PMC) 
AT91C_PMC_OUTPLL_0        EQU (0x0 << 11) ;- (PMC) 
AT91C_PMC_OUTPLL_1        EQU (0x1 << 11) ;- (PMC) 
AT91C_PMC_OUTCURR         EQU (0x1 << 12) ;- (PMC) 
AT91C_PMC_OUTCURR_0       EQU (0x0 << 12) ;- (PMC) 
AT91C_PMC_OUTCURR_1       EQU (0x1 << 12) ;- (PMC) 
AT91C_PMC_FWUP            EQU (0x1 << 13) ;- (PMC) 
AT91C_PMC_FWUP_0          EQU (0x0 << 13) ;- (PMC) 
AT91C_PMC_FWUP_1          EQU (0x1 << 13) ;- (PMC) 
AT91C_PMC_SELMAINCLK      EQU (0x1 << 14) ;- (PMC) 
AT91C_PMC_SELMAINCLK_0    EQU (0x0 << 14) ;- (PMC) 
AT91C_PMC_SELMAINCLK_1    EQU (0x1 << 14) ;- (PMC) 
AT91C_PMC_RSTCLKM         EQU (0x1 << 15) ;- (PMC) 
AT91C_PMC_RSTCLKM_0       EQU (0x0 << 15) ;- (PMC) 
AT91C_PMC_RSTCLKM_1       EQU (0x1 << 15) ;- (PMC) 
AT91C_PMC_NB_PERIPH_CLOCK EQU (0xFF << 16) ;- (PMC) 
// - -------- PMC_VERSION : (PMC Offset: 0xfc)   -------- 
AT91C_PMC_Version         EQU (0xFFFF <<  0) ;- (PMC) 
AT91C_PMC_Version_0       EQU (0x0) ;- (PMC) 
AT91C_PMC_Version_1       EQU (0x1) ;- (PMC) 
AT91C_PMC_MFN             EQU (0x7 << 16) ;- (PMC) 
AT91C_PMC_MFN_0           EQU (0x0 << 16) ;- (PMC) 
AT91C_PMC_MFN_1           EQU (0x1 << 16) ;- (PMC) 

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Clock Generator Controler
// - *****************************************************************************
// - -------- CKGR_UCKR : (CKGR Offset: 0x0) UTMI Clock Configuration Register -------- 
// - -------- CKGR_MOR : (CKGR Offset: 0x4) Main Oscillator Register -------- 
// - -------- CKGR_MCFR : (CKGR Offset: 0x8) Main Clock Frequency Register -------- 
// - -------- CKGR_PLLAR : (CKGR Offset: 0xc) PLL A Register -------- 

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Reset Controller Interface
// - *****************************************************************************
// - -------- RSTC_RCR : (RSTC Offset: 0x0) Reset Control Register -------- 
AT91C_RSTC_PROCRST        EQU (0x1 <<  0) ;- (RSTC) Processor Reset
AT91C_RSTC_ICERST         EQU (0x1 <<  1) ;- (RSTC) ICE Interface Reset
AT91C_RSTC_PERRST         EQU (0x1 <<  2) ;- (RSTC) Peripheral Reset
AT91C_RSTC_EXTRST         EQU (0x1 <<  3) ;- (RSTC) External Reset
AT91C_RSTC_KEY            EQU (0xFF << 24) ;- (RSTC) Password
// - -------- RSTC_RSR : (RSTC Offset: 0x4) Reset Status Register -------- 
AT91C_RSTC_URSTS          EQU (0x1 <<  0) ;- (RSTC) User Reset Status
AT91C_RSTC_RSTTYP         EQU (0x7 <<  8) ;- (RSTC) Reset Type
AT91C_RSTC_RSTTYP_GENERAL EQU (0x0 <<  8) ;- (RSTC) General reset. Both VDDCORE and VDDBU rising.
AT91C_RSTC_RSTTYP_WAKEUP  EQU (0x1 <<  8) ;- (RSTC) WakeUp Reset. VDDCORE rising.
AT91C_RSTC_RSTTYP_WATCHDOG EQU (0x2 <<  8) ;- (RSTC) Watchdog Reset. Watchdog overflow occured.
AT91C_RSTC_RSTTYP_SOFTWARE EQU (0x3 <<  8) ;- (RSTC) Software Reset. Processor reset required by the software.
AT91C_RSTC_RSTTYP_USER    EQU (0x4 <<  8) ;- (RSTC) User Reset. NRST pin detected low.
AT91C_RSTC_NRSTL          EQU (0x1 << 16) ;- (RSTC) NRST pin level
AT91C_RSTC_SRCMP          EQU (0x1 << 17) ;- (RSTC) Software Reset Command in Progress.
// - -------- RSTC_RMR : (RSTC Offset: 0x8) Reset Mode Register -------- 
AT91C_RSTC_URSTEN         EQU (0x1 <<  0) ;- (RSTC) User Reset Enable
AT91C_RSTC_URSTIEN        EQU (0x1 <<  4) ;- (RSTC) User Reset Interrupt Enable
AT91C_RSTC_ERSTL          EQU (0xF <<  8) ;- (RSTC) User Reset Enable

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Shut Down Controller Interface
// - *****************************************************************************
// - -------- SHDWC_SHCR : (SHDWC Offset: 0x0) Shut Down Control Register -------- 
AT91C_SHDWC_SHDW          EQU (0x1 <<  0) ;- (SHDWC) Processor Reset
AT91C_SHDWC_KEY           EQU (0xFF << 24) ;- (SHDWC) Shut down KEY Password
// - -------- SHDWC_SHMR : (SHDWC Offset: 0x4) Shut Down Mode Register -------- 
AT91C_SHDWC_WKMODE0       EQU (0x3 <<  0) ;- (SHDWC) Wake Up 0 Mode Selection
AT91C_SHDWC_WKMODE0_NONE  EQU (0x0) ;- (SHDWC) None. No detection is performed on the wake up input.
AT91C_SHDWC_WKMODE0_HIGH  EQU (0x1) ;- (SHDWC) High Level.
AT91C_SHDWC_WKMODE0_LOW   EQU (0x2) ;- (SHDWC) Low Level.
AT91C_SHDWC_WKMODE0_ANYLEVEL EQU (0x3) ;- (SHDWC) Any level change.
AT91C_SHDWC_CPTWK0        EQU (0xF <<  4) ;- (SHDWC) Counter On Wake Up 0
AT91C_SHDWC_WKMODE1       EQU (0x3 <<  8) ;- (SHDWC) Wake Up 1 Mode Selection
AT91C_SHDWC_WKMODE1_NONE  EQU (0x0 <<  8) ;- (SHDWC) None. No detection is performed on the wake up input.
AT91C_SHDWC_WKMODE1_HIGH  EQU (0x1 <<  8) ;- (SHDWC) High Level.
AT91C_SHDWC_WKMODE1_LOW   EQU (0x2 <<  8) ;- (SHDWC) Low Level.
AT91C_SHDWC_WKMODE1_ANYLEVEL EQU (0x3 <<  8) ;- (SHDWC) Any level change.
AT91C_SHDWC_CPTWK1        EQU (0xF << 12) ;- (SHDWC) Counter On Wake Up 1
AT91C_SHDWC_RTTWKEN       EQU (0x1 << 16) ;- (SHDWC) Real Time Timer Wake Up Enable
AT91C_SHDWC_RTCWKEN       EQU (0x1 << 17) ;- (SHDWC) Real Time Clock Wake Up Enable
// - -------- SHDWC_SHSR : (SHDWC Offset: 0x8) Shut Down Status Register -------- 
AT91C_SHDWC_WAKEUP0       EQU (0x1 <<  0) ;- (SHDWC) Wake Up 0 Status
AT91C_SHDWC_WAKEUP1       EQU (0x1 <<  1) ;- (SHDWC) Wake Up 1 Status
AT91C_SHDWC_FWKUP         EQU (0x1 <<  2) ;- (SHDWC) Force Wake Up Status
AT91C_SHDWC_RTTWK         EQU (0x1 << 16) ;- (SHDWC) Real Time Timer wake Up
AT91C_SHDWC_RTCWK         EQU (0x1 << 17) ;- (SHDWC) Real Time Clock wake Up

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Real Time Timer Controller Interface
// - *****************************************************************************
// - -------- RTTC_RTMR : (RTTC Offset: 0x0) Real-time Mode Register -------- 
AT91C_RTTC_RTPRES         EQU (0xFFFF <<  0) ;- (RTTC) Real-time Timer Prescaler Value
AT91C_RTTC_ALMIEN         EQU (0x1 << 16) ;- (RTTC) Alarm Interrupt Enable
AT91C_RTTC_RTTINCIEN      EQU (0x1 << 17) ;- (RTTC) Real Time Timer Increment Interrupt Enable
AT91C_RTTC_RTTRST         EQU (0x1 << 18) ;- (RTTC) Real Time Timer Restart
// - -------- RTTC_RTAR : (RTTC Offset: 0x4) Real-time Alarm Register -------- 
AT91C_RTTC_ALMV           EQU (0x0 <<  0) ;- (RTTC) Alarm Value
// - -------- RTTC_RTVR : (RTTC Offset: 0x8) Current Real-time Value Register -------- 
AT91C_RTTC_CRTV           EQU (0x0 <<  0) ;- (RTTC) Current Real-time Value
// - -------- RTTC_RTSR : (RTTC Offset: 0xc) Real-time Status Register -------- 
AT91C_RTTC_ALMS           EQU (0x1 <<  0) ;- (RTTC) Real-time Alarm Status
AT91C_RTTC_RTTINC         EQU (0x1 <<  1) ;- (RTTC) Real-time Timer Increment

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Periodic Interval Timer Controller Interface
// - *****************************************************************************
// - -------- PITC_PIMR : (PITC Offset: 0x0) Periodic Interval Mode Register -------- 
AT91C_PITC_PIV            EQU (0xFFFFF <<  0) ;- (PITC) Periodic Interval Value
AT91C_PITC_PITEN          EQU (0x1 << 24) ;- (PITC) Periodic Interval Timer Enabled
AT91C_PITC_PITIEN         EQU (0x1 << 25) ;- (PITC) Periodic Interval Timer Interrupt Enable
// - -------- PITC_PISR : (PITC Offset: 0x4) Periodic Interval Status Register -------- 
AT91C_PITC_PITS           EQU (0x1 <<  0) ;- (PITC) Periodic Interval Timer Status
// - -------- PITC_PIVR : (PITC Offset: 0x8) Periodic Interval Value Register -------- 
AT91C_PITC_CPIV           EQU (0xFFFFF <<  0) ;- (PITC) Current Periodic Interval Value
AT91C_PITC_PICNT          EQU (0xFFF << 20) ;- (PITC) Periodic Interval Counter
// - -------- PITC_PIIR : (PITC Offset: 0xc) Periodic Interval Image Register -------- 

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Watchdog Timer Controller Interface
// - *****************************************************************************
// - -------- WDTC_WDCR : (WDTC Offset: 0x0) Periodic Interval Image Register -------- 
AT91C_WDTC_WDRSTT         EQU (0x1 <<  0) ;- (WDTC) Watchdog Restart
AT91C_WDTC_KEY            EQU (0xFF << 24) ;- (WDTC) Watchdog KEY Password
// - -------- WDTC_WDMR : (WDTC Offset: 0x4) Watchdog Mode Register -------- 
AT91C_WDTC_WDV            EQU (0xFFF <<  0) ;- (WDTC) Watchdog Timer Restart
AT91C_WDTC_WDFIEN         EQU (0x1 << 12) ;- (WDTC) Watchdog Fault Interrupt Enable
AT91C_WDTC_WDRSTEN        EQU (0x1 << 13) ;- (WDTC) Watchdog Reset Enable
AT91C_WDTC_WDRPROC        EQU (0x1 << 14) ;- (WDTC) Watchdog Timer Restart
AT91C_WDTC_WDDIS          EQU (0x1 << 15) ;- (WDTC) Watchdog Disable
AT91C_WDTC_WDD            EQU (0xFFF << 16) ;- (WDTC) Watchdog Delta Value
AT91C_WDTC_WDDBGHLT       EQU (0x1 << 28) ;- (WDTC) Watchdog Debug Halt
AT91C_WDTC_WDIDLEHLT      EQU (0x1 << 29) ;- (WDTC) Watchdog Idle Halt
// - -------- WDTC_WDSR : (WDTC Offset: 0x8) Watchdog Status Register -------- 
AT91C_WDTC_WDUNF          EQU (0x1 <<  0) ;- (WDTC) Watchdog Underflow
AT91C_WDTC_WDERR          EQU (0x1 <<  1) ;- (WDTC) Watchdog Error

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Real-time Clock Alarm and Parallel Load Interface
// - *****************************************************************************
// - -------- RTC_CR : (RTC Offset: 0x0) RTC Control Register -------- 
AT91C_RTC_UPDTIM          EQU (0x1 <<  0) ;- (RTC) Update Request Time Register
AT91C_RTC_UPDCAL          EQU (0x1 <<  1) ;- (RTC) Update Request Calendar Register
AT91C_RTC_TIMEVSEL        EQU (0x3 <<  8) ;- (RTC) Time Event Selection
AT91C_RTC_TIMEVSEL_MINUTE EQU (0x0 <<  8) ;- (RTC) Minute change.
AT91C_RTC_TIMEVSEL_HOUR   EQU (0x1 <<  8) ;- (RTC) Hour change.
AT91C_RTC_TIMEVSEL_DAY24  EQU (0x2 <<  8) ;- (RTC) Every day at midnight.
AT91C_RTC_TIMEVSEL_DAY12  EQU (0x3 <<  8) ;- (RTC) Every day at noon.
AT91C_RTC_CALEVSEL        EQU (0x3 << 16) ;- (RTC) Calendar Event Selection
AT91C_RTC_CALEVSEL_WEEK   EQU (0x0 << 16) ;- (RTC) Week change (every Monday at time 00:00:00).
AT91C_RTC_CALEVSEL_MONTH  EQU (0x1 << 16) ;- (RTC) Month change (every 01 of each month at time 00:00:00).
AT91C_RTC_CALEVSEL_YEAR   EQU (0x2 << 16) ;- (RTC) Year change (every January 1 at time 00:00:00).
// - -------- RTC_MR : (RTC Offset: 0x4) RTC Mode Register -------- 
AT91C_RTC_HRMOD           EQU (0x1 <<  0) ;- (RTC) 12-24 hour Mode
// - -------- RTC_TIMR : (RTC Offset: 0x8) RTC Time Register -------- 
AT91C_RTC_SEC             EQU (0x7F <<  0) ;- (RTC) Current Second
AT91C_RTC_MIN             EQU (0x7F <<  8) ;- (RTC) Current Minute
AT91C_RTC_HOUR            EQU (0x3F << 16) ;- (RTC) Current Hour
AT91C_RTC_AMPM            EQU (0x1 << 22) ;- (RTC) Ante Meridiem, Post Meridiem Indicator
// - -------- RTC_CALR : (RTC Offset: 0xc) RTC Calendar Register -------- 
AT91C_RTC_CENT            EQU (0x3F <<  0) ;- (RTC) Current Century
AT91C_RTC_YEAR            EQU (0xFF <<  8) ;- (RTC) Current Year
AT91C_RTC_MONTH           EQU (0x1F << 16) ;- (RTC) Current Month
AT91C_RTC_DAY             EQU (0x7 << 21) ;- (RTC) Current Day
AT91C_RTC_DATE            EQU (0x3F << 24) ;- (RTC) Current Date
// - -------- RTC_TIMALR : (RTC Offset: 0x10) RTC Time Alarm Register -------- 
AT91C_RTC_SECEN           EQU (0x1 <<  7) ;- (RTC) Second Alarm Enable
AT91C_RTC_MINEN           EQU (0x1 << 15) ;- (RTC) Minute Alarm
AT91C_RTC_HOUREN          EQU (0x1 << 23) ;- (RTC) Current Hour
// - -------- RTC_CALALR : (RTC Offset: 0x14) RTC Calendar Alarm Register -------- 
AT91C_RTC_MONTHEN         EQU (0x1 << 23) ;- (RTC) Month Alarm Enable
AT91C_RTC_DATEEN          EQU (0x1 << 31) ;- (RTC) Date Alarm Enable
// - -------- RTC_SR : (RTC Offset: 0x18) RTC Status Register -------- 
AT91C_RTC_ACKUPD          EQU (0x1 <<  0) ;- (RTC) Acknowledge for Update
AT91C_RTC_ALARM           EQU (0x1 <<  1) ;- (RTC) Alarm Flag
AT91C_RTC_SECEV           EQU (0x1 <<  2) ;- (RTC) Second Event
AT91C_RTC_TIMEV           EQU (0x1 <<  3) ;- (RTC) Time Event
AT91C_RTC_CALEV           EQU (0x1 <<  4) ;- (RTC) Calendar event
// - -------- RTC_SCCR : (RTC Offset: 0x1c) RTC Status Clear Command Register -------- 
// - -------- RTC_IER : (RTC Offset: 0x20) RTC Interrupt Enable Register -------- 
// - -------- RTC_IDR : (RTC Offset: 0x24) RTC Interrupt Disable Register -------- 
// - -------- RTC_IMR : (RTC Offset: 0x28) RTC Interrupt Mask Register -------- 
// - -------- RTC_VER : (RTC Offset: 0x2c) RTC Valid Entry Register -------- 
AT91C_RTC_NVTIM           EQU (0x1 <<  0) ;- (RTC) Non valid Time
AT91C_RTC_NVCAL           EQU (0x1 <<  1) ;- (RTC) Non valid Calendar
AT91C_RTC_NVTIMALR        EQU (0x1 <<  2) ;- (RTC) Non valid time Alarm
AT91C_RTC_NVCALALR        EQU (0x1 <<  3) ;- (RTC) Nonvalid Calendar Alarm

