una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9g45.h
// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR TSADC
// - *****************************************************************************
// - -------- TSADC_CR : (TSADC Offset: 0x0) Control Register -------- 
AT91C_TSADC_SWRST         EQU (0x1 <<  0) ;- (TSADC) Software Reset
AT91C_TSADC_START         EQU (0x1 <<  1) ;- (TSADC) Start Conversion
// - -------- TSADC_MR : (TSADC Offset: 0x4) Mode Register -------- 
AT91C_TSADC_TSAMOD        EQU (0x3 <<  0) ;- (TSADC) Touch Screen ADC Mode
AT91C_TSADC_TSAMOD_ADC_ONLY_MODE EQU (0x0) ;- (TSADC) ADC Mode
AT91C_TSADC_TSAMOD_TS_ONLY_MODE EQU (0x1) ;- (TSADC) Touch Screen Only Mode
AT91C_TSADC_LOWRES        EQU (0x1 <<  4) ;- (TSADC) ADC Resolution
AT91C_TSADC_SLEEP         EQU (0x1 <<  5) ;- (TSADC) Sleep Mode
AT91C_TSADC_PENDET        EQU (0x1 <<  6) ;- (TSADC) Pen Detect Selection
AT91C_TSADC_PRESCAL       EQU (0xFF <<  8) ;- (TSADC) Prescaler Rate Selection
AT91C_TSADC_STARTUP       EQU (0x7F << 16) ;- (TSADC) Startup Time
AT91C_TSADC_SHTIM         EQU (0xF << 24) ;- (TSADC) Sample and Hold Time for ADC Channels
AT91C_TSADC_PENDBC        EQU (0xF << 28) ;- (TSADC) Pen Detect Debouncing Period
// - -------- TSADC_TRGR : (TSADC Offset: 0x8) Trigger Register -------- 
AT91C_TSADC_TRGMOD        EQU (0x7 <<  0) ;- (TSADC) Trigger Mode
AT91C_TSADC_TRGMOD_NO_TRIGGER EQU (0x0) ;- (TSADC) No Trigger
AT91C_TSADC_TRGMOD_EXTERNAL_TRIGGER_RE EQU (0x1) ;- (TSADC) External Trigger Rising Edge
AT91C_TSADC_TRGMOD_EXTERNAL_TRIGGER_FE EQU (0x2) ;- (TSADC) External Trigger Falling Edge
AT91C_TSADC_TRGMOD_EXTERNAL_TRIGGER_AE EQU (0x3) ;- (TSADC) External Trigger Any Edge
AT91C_TSADC_TRGMOD_PENDET_TRIGGER EQU (0x4) ;- (TSADC) Pen Detect Trigger (only if PENDET is set and in Touch Screen mode only)
AT91C_TSADC_TRGMOD_PERIODIC_TRIGGER EQU (0x5) ;- (TSADC) Periodic Trigger (wrt TRGPER)
AT91C_TSADC_TRGMOD_CONT_TRIGGER EQU (0x6) ;- (TSADC) Continuous Trigger
AT91C_TSADC_TRGPER        EQU (0xFFFF << 16) ;- (TSADC) Trigger Period
// - -------- TSADC_TSR : (TSADC Offset: 0xc) Touch Screen Register -------- 
AT91C_TSADC_TSSHTIM       EQU (0xF << 24) ;- (TSADC) Sample and Hold Time for Touch Screen Channels
// - -------- TSADC_CHER : (TSADC Offset: 0x10) Channel Enable Register -------- 
AT91C_TSADC_CHENA0        EQU (0x1 <<  0) ;- (TSADC) Channel 0 Enable
AT91C_TSADC_CHENA1        EQU (0x1 <<  1) ;- (TSADC) Channel 1 Enable
AT91C_TSADC_CHENA2        EQU (0x1 <<  2) ;- (TSADC) Channel 2 Enable
AT91C_TSADC_CHENA3        EQU (0x1 <<  3) ;- (TSADC) Channel 3 Enable
AT91C_TSADC_CHENA4        EQU (0x1 <<  4) ;- (TSADC) Channel 4 Enable
AT91C_TSADC_CHENA5        EQU (0x1 <<  5) ;- (TSADC) Channel 5 Enable
AT91C_TSADC_CHENA6        EQU (0x1 <<  6) ;- (TSADC) Channel 6 Enable
AT91C_TSADC_CHENA7        EQU (0x1 <<  7) ;- (TSADC) Channel 7 Enable
// - -------- TSADC_CHDR : (TSADC Offset: 0x14) Channel Disable Register -------- 
AT91C_TSADC_CHDIS0        EQU (0x1 <<  0) ;- (TSADC) Channel 0 Disable
AT91C_TSADC_CHDIS1        EQU (0x1 <<  1) ;- (TSADC) Channel 1 Disable
AT91C_TSADC_CHDIS2        EQU (0x1 <<  2) ;- (TSADC) Channel 2 Disable
AT91C_TSADC_CHDIS3        EQU (0x1 <<  3) ;- (TSADC) Channel 3 Disable
AT91C_TSADC_CHDIS4        EQU (0x1 <<  4) ;- (TSADC) Channel 4 Disable
AT91C_TSADC_CHDIS5        EQU (0x1 <<  5) ;- (TSADC) Channel 5 Disable
AT91C_TSADC_CHDIS6        EQU (0x1 <<  6) ;- (TSADC) Channel 6 Disable
AT91C_TSADC_CHDIS7        EQU (0x1 <<  7) ;- (TSADC) Channel 7 Disable
// - -------- TSADC_CHSR : (TSADC Offset: 0x18) Channel Status Register -------- 
AT91C_TSADC_CHS0          EQU (0x1 <<  0) ;- (TSADC) Channel 0 Status
AT91C_TSADC_CHS1          EQU (0x1 <<  1) ;- (TSADC) Channel 1 Status
AT91C_TSADC_CHS2          EQU (0x1 <<  2) ;- (TSADC) Channel 2 Status
AT91C_TSADC_CHS3          EQU (0x1 <<  3) ;- (TSADC) Channel 3 Status
AT91C_TSADC_CHS4          EQU (0x1 <<  4) ;- (TSADC) Channel 4 Status
AT91C_TSADC_CHS5          EQU (0x1 <<  5) ;- (TSADC) Channel 5 Status
AT91C_TSADC_CHS6          EQU (0x1 <<  6) ;- (TSADC) Channel 6 Status
AT91C_TSADC_CHS7          EQU (0x1 <<  7) ;- (TSADC) Channel 7 Status
// - -------- TSADC_SR : (TSADC Offset: 0x1c) Status Register -------- 
AT91C_TSADC_EOC0          EQU (0x1 <<  0) ;- (TSADC) Channel 0 End Of Conversion
AT91C_TSADC_EOC1          EQU (0x1 <<  1) ;- (TSADC) Channel 1 End Of Conversion
AT91C_TSADC_EOC2          EQU (0x1 <<  2) ;- (TSADC) Channel 2 End Of Conversion
AT91C_TSADC_EOC3          EQU (0x1 <<  3) ;- (TSADC) Channel 3 End Of Conversion
AT91C_TSADC_EOC4          EQU (0x1 <<  4) ;- (TSADC) Channel 4 End Of Conversion
AT91C_TSADC_EOC5          EQU (0x1 <<  5) ;- (TSADC) Channel 5 End Of Conversion
AT91C_TSADC_EOC6          EQU (0x1 <<  6) ;- (TSADC) Channel 6 End Of Conversion
AT91C_TSADC_EOC7          EQU (0x1 <<  7) ;- (TSADC) Channel 7 End Of Conversion
AT91C_TSADC_OVRE0         EQU (0x1 <<  8) ;- (TSADC) Channel 0 Overrun Error
AT91C_TSADC_OVRE1         EQU (0x1 <<  9) ;- (TSADC) Channel 1 Overrun Error
AT91C_TSADC_OVRE2         EQU (0x1 << 10) ;- (TSADC) Channel 2 Overrun Error
AT91C_TSADC_OVRE3         EQU (0x1 << 11) ;- (TSADC) Channel 3 Overrun Error
AT91C_TSADC_OVRE4         EQU (0x1 << 12) ;- (TSADC) Channel 4 Overrun Error
AT91C_TSADC_OVRE5         EQU (0x1 << 13) ;- (TSADC) Channel 5 Overrun Error
AT91C_TSADC_OVRE6         EQU (0x1 << 14) ;- (TSADC) Channel 6 Overrun Error
AT91C_TSADC_OVRE7         EQU (0x1 << 15) ;- (TSADC) Channel 7 Overrun Error
AT91C_TSADC_DRDY          EQU (0x1 << 16) ;- (TSADC) Data Ready
AT91C_TSADC_GOVRE         EQU (0x1 << 17) ;- (TSADC) General Overrun Error
AT91C_TSADC_ENDRX         EQU (0x1 << 18) ;- (TSADC) End of RX Buffer
AT91C_TSADC_RXBUFF        EQU (0x1 << 19) ;- (TSADC) RX Buffer Full
AT91C_TSADC_PENCNT        EQU (0x1 << 20) ;- (TSADC) Pen Contact
AT91C_TSADC_NOCNT         EQU (0x1 << 21) ;- (TSADC) No Contact
// - -------- TSADC_LCDR : (TSADC Offset: 0x20) Last Converted Data Register -------- 
AT91C_TSADC_LDATA         EQU (0x3FF <<  0) ;- (TSADC) Last Converted Data
// - -------- TSADC_IER : (TSADC Offset: 0x24) Interrupt Enable Register -------- 
AT91C_TSADC_IENAEOC0      EQU (0x1 <<  0) ;- (TSADC) Channel 0 End Of Conversion Interrupt Enable
AT91C_TSADC_IENAEOC1      EQU (0x1 <<  1) ;- (TSADC) Channel 1 End Of Conversion Interrupt Enable
AT91C_TSADC_IENAEOC2      EQU (0x1 <<  2) ;- (TSADC) Channel 2 End Of Conversion Interrupt Enable
AT91C_TSADC_IENAEOC3      EQU (0x1 <<  3) ;- (TSADC) Channel 3 End Of Conversion Interrupt Enable
AT91C_TSADC_IENAEOC4      EQU (0x1 <<  4) ;- (TSADC) Channel 4 End Of Conversion Interrupt Enable
AT91C_TSADC_IENAEOC5      EQU (0x1 <<  5) ;- (TSADC) Channel 5 End Of Conversion Interrupt Enable
AT91C_TSADC_IENAEOC6      EQU (0x1 <<  6) ;- (TSADC) Channel 6 End Of Conversion Interrupt Enable
AT91C_TSADC_IENAEOC7      EQU (0x1 <<  7) ;- (TSADC) Channel 7 End Of Conversion Interrupt Enable
AT91C_TSADC_IENAOVRE0     EQU (0x1 <<  8) ;- (TSADC) Channel 0 Overrun Error Interrupt Enable
AT91C_TSADC_IENAOVRE1     EQU (0x1 <<  9) ;- (TSADC) Channel 1 Overrun Error Interrupt Enable
AT91C_TSADC_IENAOVRE2     EQU (0x1 << 10) ;- (TSADC) Channel 2 Overrun Error Interrupt Enable
AT91C_TSADC_IENAOVRE3     EQU (0x1 << 11) ;- (TSADC) Channel 3 Overrun Error Interrupt Enable
AT91C_TSADC_IENAOVRE4     EQU (0x1 << 12) ;- (TSADC) Channel 4 Overrun Error Interrupt Enable
AT91C_TSADC_IENAOVRE5     EQU (0x1 << 13) ;- (TSADC) Channel 5 Overrun Error Interrupt Enable
AT91C_TSADC_IENAOVRE6     EQU (0x1 << 14) ;- (TSADC) Channel 6 Overrun Error Interrupt Enable
AT91C_TSADC_IENAOVRE7     EQU (0x1 << 15) ;- (TSADC) Channel 7 Overrun Error Interrupt Enable
AT91C_TSADC_IENADRDY      EQU (0x1 << 16) ;- (TSADC) Data Ready Interrupt Enable
AT91C_TSADC_IENAGOVRE     EQU (0x1 << 17) ;- (TSADC) General Overrun Error Interrupt Enable
AT91C_TSADC_IENAENDRX     EQU (0x1 << 18) ;- (TSADC) End of RX Buffer Interrupt Enable
AT91C_TSADC_IENARXBUFF    EQU (0x1 << 19) ;- (TSADC) RX Buffer Full Interrupt Enable
AT91C_TSADC_IENAPENCNT    EQU (0x1 << 20) ;- (TSADC) Pen Contact Interrupt Enable
AT91C_TSADC_IENANOCNT     EQU (0x1 << 21) ;- (TSADC) No Contact Interrupt Enable
// - -------- TSADC_IDR : (TSADC Offset: 0x28) Interrupt Disable Register -------- 
AT91C_TSADC_IDISEOC0      EQU (0x1 <<  0) ;- (TSADC) Channel 0 End Of Conversion Interrupt Disable
AT91C_TSADC_IDISEOC1      EQU (0x1 <<  1) ;- (TSADC) Channel 1 End Of Conversion Interrupt Disable
AT91C_TSADC_IDISEOC2      EQU (0x1 <<  2) ;- (TSADC) Channel 2 End Of Conversion Interrupt Disable
AT91C_TSADC_IDISEOC3      EQU (0x1 <<  3) ;- (TSADC) Channel 3 End Of Conversion Interrupt Disable
AT91C_TSADC_IDISEOC4      EQU (0x1 <<  4) ;- (TSADC) Channel 4 End Of Conversion Interrupt Disable
AT91C_TSADC_IDISEOC5      EQU (0x1 <<  5) ;- (TSADC) Channel 5 End Of Conversion Interrupt Disable
AT91C_TSADC_IDISEOC6      EQU (0x1 <<  6) ;- (TSADC) Channel 6 End Of Conversion Interrupt Disable
AT91C_TSADC_IDISEOC7      EQU (0x1 <<  7) ;- (TSADC) Channel 7 End Of Conversion Interrupt Disable
AT91C_TSADC_IDISOVRE0     EQU (0x1 <<  8) ;- (TSADC) Channel 0 Overrun Error Interrupt Disable
AT91C_TSADC_IDISOVRE1     EQU (0x1 <<  9) ;- (TSADC) Channel 1 Overrun Error Interrupt Disable
AT91C_TSADC_IDISOVRE2     EQU (0x1 << 10) ;- (TSADC) Channel 2 Overrun Error Interrupt Disable
AT91C_TSADC_IDISOVRE3     EQU (0x1 << 11) ;- (TSADC) Channel 3 Overrun Error Interrupt Disable
AT91C_TSADC_IDISOVRE4     EQU (0x1 << 12) ;- (TSADC) Channel 4 Overrun Error Interrupt Disable
AT91C_TSADC_IDISOVRE5     EQU (0x1 << 13) ;- (TSADC) Channel 5 Overrun Error Interrupt Disable
AT91C_TSADC_IDISOVRE6     EQU (0x1 << 14) ;- (TSADC) Channel 6 Overrun Error Interrupt Disable
AT91C_TSADC_IDISOVRE7     EQU (0x1 << 15) ;- (TSADC) Channel 7 Overrun Error Interrupt Disable
AT91C_TSADC_IDISDRDY      EQU (0x1 << 16) ;- (TSADC) Data Ready Interrupt Disable
AT91C_TSADC_IDISGOVRE     EQU (0x1 << 17) ;- (TSADC) General Overrun Error Interrupt Disable
AT91C_TSADC_IDISENDRX     EQU (0x1 << 18) ;- (TSADC) End of RX Buffer Interrupt Disable
AT91C_TSADC_IDISRXBUFF    EQU (0x1 << 19) ;- (TSADC) RX Buffer Full Interrupt Disable
AT91C_TSADC_IDISPENCNT    EQU (0x1 << 20) ;- (TSADC) Pen Contact Interrupt Disable
AT91C_TSADC_IDISNOCNT     EQU (0x1 << 21) ;- (TSADC) No Contact Interrupt Disable
// - -------- TSADC_IMR : (TSADC Offset: 0x2c) Interrupt Mask Register -------- 
AT91C_TSADC_IMSKEOC0      EQU (0x1 <<  0) ;- (TSADC) Channel 0 End Of Conversion Interrupt Mask
AT91C_TSADC_IMSKEOC1      EQU (0x1 <<  1) ;- (TSADC) Channel 1 End Of Conversion Interrupt Mask
AT91C_TSADC_IMSKEOC2      EQU (0x1 <<  2) ;- (TSADC) Channel 2 End Of Conversion Interrupt Mask
AT91C_TSADC_IMSKEOC3      EQU (0x1 <<  3) ;- (TSADC) Channel 3 End Of Conversion Interrupt Mask
AT91C_TSADC_IMSKEOC4      EQU (0x1 <<  4) ;- (TSADC) Channel 4 End Of Conversion Interrupt Mask
AT91C_TSADC_IMSKEOC5      EQU (0x1 <<  5) ;- (TSADC) Channel 5 End Of Conversion Interrupt Mask
AT91C_TSADC_IMSKEOC6      EQU (0x1 <<  6) ;- (TSADC) Channel 6 End Of Conversion Interrupt Mask
AT91C_TSADC_IMSKEOC7      EQU (0x1 <<  7) ;- (TSADC) Channel 7 End Of Conversion Interrupt Mask
AT91C_TSADC_IMSKOVRE0     EQU (0x1 <<  8) ;- (TSADC) Channel 0 Overrun Error Interrupt Mask
AT91C_TSADC_IMSKOVRE1     EQU (0x1 <<  9) ;- (TSADC) Channel 1 Overrun Error Interrupt Mask
AT91C_TSADC_IMSKOVRE2     EQU (0x1 << 10) ;- (TSADC) Channel 2 Overrun Error Interrupt Mask
AT91C_TSADC_IMSKOVRE3     EQU (0x1 << 11) ;- (TSADC) Channel 3 Overrun Error Interrupt Mask
AT91C_TSADC_IMSKOVRE4     EQU (0x1 << 12) ;- (TSADC) Channel 4 Overrun Error Interrupt Mask
AT91C_TSADC_IMSKOVRE5     EQU (0x1 << 13) ;- (TSADC) Channel 5 Overrun Error Interrupt Mask
AT91C_TSADC_IMSKOVRE6     EQU (0x1 << 14) ;- (TSADC) Channel 6 Overrun Error Interrupt Mask
AT91C_TSADC_IMSKOVRE7     EQU (0x1 << 15) ;- (TSADC) Channel 7 Overrun Error Interrupt Mask
AT91C_TSADC_IMSKDRDY      EQU (0x1 << 16) ;- (TSADC) Data Ready Interrupt Mask
AT91C_TSADC_IMSKGOVRE     EQU (0x1 << 17) ;- (TSADC) General Overrun Error Interrupt Mask
AT91C_TSADC_IMSKENDRX     EQU (0x1 << 18) ;- (TSADC) End of RX Buffer Interrupt Mask
AT91C_TSADC_IMSKRXBUFF    EQU (0x1 << 19) ;- (TSADC) RX Buffer Full Interrupt Mask
AT91C_TSADC_IMSKPENCNT    EQU (0x1 << 20) ;- (TSADC) Pen Contact Interrupt Mask
AT91C_TSADC_IMSKNOCNT     EQU (0x1 << 21) ;- (TSADC) No Contact Interrupt Mask
// - -------- TSADC_CDR0 : (TSADC Offset: 0x30) Channel 0 Data Register -------- 
AT91C_TSADC_DATA0         EQU (0x3FF <<  0) ;- (TSADC) Channel 0 Data
// - -------- TSADC_CDR1 : (TSADC Offset: 0x34) Channel 1 Data Register -------- 
AT91C_TSADC_DATA1         EQU (0x3FF <<  0) ;- (TSADC) Channel 1 Data
// - -------- TSADC_CDR2 : (TSADC Offset: 0x38) Channel 2 Data Register -------- 
AT91C_TSADC_DATA2         EQU (0x3FF <<  0) ;- (TSADC) Channel 2 Data
// - -------- TSADC_CDR3 : (TSADC Offset: 0x3c) Channel 3 Data Register -------- 
AT91C_TSADC_DATA3         EQU (0x3FF <<  0) ;- (TSADC) Channel 3 Data
// - -------- TSADC_CDR4 : (TSADC Offset: 0x40) Channel 4 Data Register -------- 
AT91C_TSADC_DATA4         EQU (0x3FF <<  0) ;- (TSADC) Channel 4 Data
// - -------- TSADC_CDR5 : (TSADC Offset: 0x44) Channel 5 Data Register -------- 
AT91C_TSADC_DATA5         EQU (0x3FF <<  0) ;- (TSADC) Channel 5 Data
// - -------- TSADC_CDR6 : (TSADC Offset: 0x48) Channel 6 Data Register -------- 
AT91C_TSADC_DATA6         EQU (0x3FF <<  0) ;- (TSADC) Channel 6 Data
// - -------- TSADC_CDR7 : (TSADC Offset: 0x4c) Channel 7 Data Register -------- 
AT91C_TSADC_DATA7         EQU (0x3FF <<  0) ;- (TSADC) Channel 7 Data

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR UDPHS Enpoint FIFO data register
// - *****************************************************************************

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR UDPHS Endpoint struct
// - *****************************************************************************
// - -------- UDPHS_EPTCFG : (UDPHS_EPT Offset: 0x0) UDPHS Endpoint Config Register -------- 
AT91C_UDPHS_EPT_SIZE      EQU (0x7 <<  0) ;- (UDPHS_EPT) Endpoint Size
AT91C_UDPHS_EPT_SIZE_8    EQU (0x0) ;- (UDPHS_EPT)    8 bytes
AT91C_UDPHS_EPT_SIZE_16   EQU (0x1) ;- (UDPHS_EPT)   16 bytes
AT91C_UDPHS_EPT_SIZE_32   EQU (0x2) ;- (UDPHS_EPT)   32 bytes
AT91C_UDPHS_EPT_SIZE_64   EQU (0x3) ;- (UDPHS_EPT)   64 bytes
AT91C_UDPHS_EPT_SIZE_128  EQU (0x4) ;- (UDPHS_EPT)  128 bytes
AT91C_UDPHS_EPT_SIZE_256  EQU (0x5) ;- (UDPHS_EPT)  256 bytes (if possible)
AT91C_UDPHS_EPT_SIZE_512  EQU (0x6) ;- (UDPHS_EPT)  512 bytes (if possible)
AT91C_UDPHS_EPT_SIZE_1024 EQU (0x7) ;- (UDPHS_EPT) 1024 bytes (if possible)
AT91C_UDPHS_EPT_DIR       EQU (0x1 <<  3) ;- (UDPHS_EPT) Endpoint Direction 0:OUT, 1:IN
AT91C_UDPHS_EPT_DIR_OUT   EQU (0x0 <<  3) ;- (UDPHS_EPT) Direction OUT
AT91C_UDPHS_EPT_DIR_IN    EQU (0x1 <<  3) ;- (UDPHS_EPT) Direction IN
AT91C_UDPHS_EPT_TYPE      EQU (0x3 <<  4) ;- (UDPHS_EPT) Endpoint Type
AT91C_UDPHS_EPT_TYPE_CTL_EPT EQU (0x0 <<  4) ;- (UDPHS_EPT) Control endpoint
AT91C_UDPHS_EPT_TYPE_ISO_EPT EQU (0x1 <<  4) ;- (UDPHS_EPT) Isochronous endpoint
AT91C_UDPHS_EPT_TYPE_BUL_EPT EQU (0x2 <<  4) ;- (UDPHS_EPT) Bulk endpoint
AT91C_UDPHS_EPT_TYPE_INT_EPT EQU (0x3 <<  4) ;- (UDPHS_EPT) Interrupt endpoint
AT91C_UDPHS_BK_NUMBER     EQU (0x3 <<  6) ;- (UDPHS_EPT) Number of Banks
AT91C_UDPHS_BK_NUMBER_0   EQU (0x0 <<  6) ;- (UDPHS_EPT) Zero Bank, the EndPoint is not mapped in memory
AT91C_UDPHS_BK_NUMBER_1   EQU (0x1 <<  6) ;- (UDPHS_EPT) One Bank (Bank0)
AT91C_UDPHS_BK_NUMBER_2   EQU (0x2 <<  6) ;- (UDPHS_EPT) Double bank (Ping-Pong : Bank0 / Bank1)
AT91C_UDPHS_BK_NUMBER_3   EQU (0x3 <<  6) ;- (UDPHS_EPT) Triple Bank (Bank0 / Bank1 / Bank2) (if possible)
AT91C_UDPHS_NB_TRANS      EQU (0x3 <<  8) ;- (UDPHS_EPT) Number Of Transaction per Micro-Frame (High-Bandwidth iso only)
AT91C_UDPHS_EPT_MAPD      EQU (0x1 << 31) ;- (UDPHS_EPT) Endpoint Mapped (read only
// - -------- UDPHS_EPTCTLENB : (UDPHS_EPT Offset: 0x4) UDPHS Endpoint Control Enable Register -------- 
AT91C_UDPHS_EPT_ENABL     EQU (0x1 <<  0) ;- (UDPHS_EPT) Endpoint Enable
AT91C_UDPHS_AUTO_VALID    EQU (0x1 <<  1) ;- (UDPHS_EPT) Packet Auto-Valid Enable/Disable
AT91C_UDPHS_INTDIS_DMA    EQU (0x1 <<  3) ;- (UDPHS_EPT) Endpoint Interrupts DMA Request Enable/Disable
AT91C_UDPHS_NYET_DIS      EQU (0x1 <<  4) ;- (UDPHS_EPT) NYET Enable/Disable
AT91C_UDPHS_DATAX_RX      EQU (0x1 <<  6) ;- (UDPHS_EPT) DATAx Interrupt Enable/Disable
AT91C_UDPHS_MDATA_RX      EQU (0x1 <<  7) ;- (UDPHS_EPT) MDATA Interrupt Enabled/Disable
AT91C_UDPHS_ERR_OVFLW     EQU (0x1 <<  8) ;- (UDPHS_EPT) OverFlow Error Interrupt Enable/Disable/Status
AT91C_UDPHS_RX_BK_RDY     EQU (0x1 <<  9) ;- (UDPHS_EPT) Received OUT Data
AT91C_UDPHS_TX_COMPLT     EQU (0x1 << 10) ;- (UDPHS_EPT) Transmitted IN Data Complete Interrupt Enable/Disable or Transmitted IN Data Complete (clear)
AT91C_UDPHS_ERR_TRANS     EQU (0x1 << 11) ;- (UDPHS_EPT) Transaction Error Interrupt Enable/Disable
AT91C_UDPHS_TX_PK_RDY     EQU (0x1 << 11) ;- (UDPHS_EPT) TX Packet Ready Interrupt Enable/Disable
AT91C_UDPHS_RX_SETUP      EQU (0x1 << 12) ;- (UDPHS_EPT) Received SETUP Interrupt Enable/Disable
AT91C_UDPHS_ERR_FL_ISO    EQU (0x1 << 12) ;- (UDPHS_EPT) Error Flow Clear/Interrupt Enable/Disable
AT91C_UDPHS_STALL_SNT     EQU (0x1 << 13) ;- (UDPHS_EPT) Stall Sent Clear
AT91C_UDPHS_ERR_CRISO     EQU (0x1 << 13) ;- (UDPHS_EPT) CRC error / Error NB Trans / Interrupt Enable/Disable
AT91C_UDPHS_NAK_IN        EQU (0x1 << 14) ;- (UDPHS_EPT) NAKIN ERROR FLUSH / Clear / Interrupt Enable/Disable
AT91C_UDPHS_NAK_OUT       EQU (0x1 << 15) ;- (UDPHS_EPT) NAKOUT / Clear / Interrupt Enable/Disable
AT91C_UDPHS_BUSY_BANK     EQU (0x1 << 18) ;- (UDPHS_EPT) Busy Bank Interrupt Enable/Disable
AT91C_UDPHS_SHRT_PCKT     EQU (0x1 << 31) ;- (UDPHS_EPT) Short Packet / Interrupt Enable/Disable
// - -------- UDPHS_EPTCTLDIS : (UDPHS_EPT Offset: 0x8) UDPHS Endpoint Control Disable Register -------- 
AT91C_UDPHS_EPT_DISABL    EQU (0x1 <<  0) ;- (UDPHS_EPT) Endpoint Disable
// - -------- UDPHS_EPTCTL : (UDPHS_EPT Offset: 0xc) UDPHS Endpoint Control Register -------- 
// - -------- UDPHS_EPTSETSTA : (UDPHS_EPT Offset: 0x14) UDPHS Endpoint Set Status Register -------- 
AT91C_UDPHS_FRCESTALL     EQU (0x1 <<  5) ;- (UDPHS_EPT) Stall Handshake Request Set/Clear/Status
AT91C_UDPHS_KILL_BANK     EQU (0x1 <<  9) ;- (UDPHS_EPT) KILL Bank
// - -------- UDPHS_EPTCLRSTA : (UDPHS_EPT Offset: 0x18) UDPHS Endpoint Clear Status Register -------- 
AT91C_UDPHS_TOGGLESQ      EQU (0x1 <<  6) ;- (UDPHS_EPT) Data Toggle Clear
// - -------- UDPHS_EPTSTA : (UDPHS_EPT Offset: 0x1c) UDPHS Endpoint Status Register -------- 
AT91C_UDPHS_TOGGLESQ_STA  EQU (0x3 <<  6) ;- (UDPHS_EPT) Toggle Sequencing
AT91C_UDPHS_TOGGLESQ_STA_00 EQU (0x0 <<  6) ;- (UDPHS_EPT) Data0
AT91C_UDPHS_TOGGLESQ_STA_01 EQU (0x1 <<  6) ;- (UDPHS_EPT) Data1
AT91C_UDPHS_TOGGLESQ_STA_10 EQU (0x2 <<  6) ;- (UDPHS_EPT) Data2 (only for High-Bandwidth Isochronous EndPoint)
AT91C_UDPHS_TOGGLESQ_STA_11 EQU (0x3 <<  6) ;- (UDPHS_EPT) MData (only for High-Bandwidth Isochronous EndPoint)
AT91C_UDPHS_CONTROL_DIR   EQU (0x3 << 16) ;- (UDPHS_EPT) 
AT91C_UDPHS_CONTROL_DIR_00 EQU (0x0 << 16) ;- (UDPHS_EPT) Bank 0
AT91C_UDPHS_CONTROL_DIR_01 EQU (0x1 << 16) ;- (UDPHS_EPT) Bank 1
AT91C_UDPHS_CONTROL_DIR_10 EQU (0x2 << 16) ;- (UDPHS_EPT) Bank 2
AT91C_UDPHS_CONTROL_DIR_11 EQU (0x3 << 16) ;- (UDPHS_EPT) Invalid
AT91C_UDPHS_CURRENT_BANK  EQU (0x3 << 16) ;- (UDPHS_EPT) 
AT91C_UDPHS_CURRENT_BANK_00 EQU (0x0 << 16) ;- (UDPHS_EPT) Bank 0
AT91C_UDPHS_CURRENT_BANK_01 EQU (0x1 << 16) ;- (UDPHS_EPT) Bank 1
AT91C_UDPHS_CURRENT_BANK_10 EQU (0x2 << 16) ;- (UDPHS_EPT) Bank 2
AT91C_UDPHS_CURRENT_BANK_11 EQU (0x3 << 16) ;- (UDPHS_EPT) Invalid
AT91C_UDPHS_BUSY_BANK_STA EQU (0x3 << 18) ;- (UDPHS_EPT) Busy Bank Number
AT91C_UDPHS_BUSY_BANK_STA_00 EQU (0x0 << 18) ;- (UDPHS_EPT) All banks are free
AT91C_UDPHS_BUSY_BANK_STA_01 EQU (0x1 << 18) ;- (UDPHS_EPT) 1 busy bank
AT91C_UDPHS_BUSY_BANK_STA_10 EQU (0x2 << 18) ;- (UDPHS_EPT) 2 busy banks
AT91C_UDPHS_BUSY_BANK_STA_11 EQU (0x3 << 18) ;- (UDPHS_EPT) 3 busy banks (if possible)
AT91C_UDPHS_BYTE_COUNT    EQU (0x7FF << 20) ;- (UDPHS_EPT) UDPHS Byte Count

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR UDPHS DMA struct
// - *****************************************************************************
// - -------- UDPHS_DMANXTDSC : (UDPHS_DMA Offset: 0x0) UDPHS DMA Next Descriptor Address Register -------- 
AT91C_UDPHS_NXT_DSC_ADD   EQU (0xFFFFFFF <<  4) ;- (UDPHS_DMA) next Channel Descriptor
// - -------- UDPHS_DMAADDRESS : (UDPHS_DMA Offset: 0x4) UDPHS DMA Channel Address Register -------- 
AT91C_UDPHS_BUFF_ADD      EQU (0x0 <<  0) ;- (UDPHS_DMA) starting address of a DMA Channel transfer
// - -------- UDPHS_DMACONTROL : (UDPHS_DMA Offset: 0x8) UDPHS DMA Channel Control Register -------- 
AT91C_UDPHS_CHANN_ENB     EQU (0x1 <<  0) ;- (UDPHS_DMA) Channel Enabled
AT91C_UDPHS_LDNXT_DSC     EQU (0x1 <<  1) ;- (UDPHS_DMA) Load Next Channel Transfer Descriptor Enable
AT91C_UDPHS_END_TR_EN     EQU (0x1 <<  2) ;- (UDPHS_DMA) Buffer Close Input Enable
AT91C_UDPHS_END_B_EN      EQU (0x1 <<  3) ;- (UDPHS_DMA) End of DMA Buffer Packet Validation
AT91C_UDPHS_END_TR_IT     EQU (0x1 <<  4) ;- (UDPHS_DMA) End Of Transfer Interrupt Enable
AT91C_UDPHS_END_BUFFIT    EQU (0x1 <<  5) ;- (UDPHS_DMA) End Of Channel Buffer Interrupt Enable
AT91C_UDPHS_DESC_LD_IT    EQU (0x1 <<  6) ;- (UDPHS_DMA) Descriptor Loaded Interrupt Enable
AT91C_UDPHS_BURST_LCK     EQU (0x1 <<  7) ;- (UDPHS_DMA) Burst Lock Enable
AT91C_UDPHS_BUFF_LENGTH   EQU (0xFFFF << 16) ;- (UDPHS_DMA) Buffer Byte Length (write only)
// - -------- UDPHS_DMASTATUS : (UDPHS_DMA Offset: 0xc) UDPHS DMA Channelx Status Register -------- 
AT91C_UDPHS_CHANN_ACT     EQU (0x1 <<  1) ;- (UDPHS_DMA) 
AT91C_UDPHS_END_TR_ST     EQU (0x1 <<  4) ;- (UDPHS_DMA) 
AT91C_UDPHS_END_BF_ST     EQU (0x1 <<  5) ;- (UDPHS_DMA) 
AT91C_UDPHS_DESC_LDST     EQU (0x1 <<  6) ;- (UDPHS_DMA) 
AT91C_UDPHS_BUFF_COUNT    EQU (0xFFFF << 16) ;- (UDPHS_DMA) 

