una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9g45.h
// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR UDPHS High Speed Device Interface
// - *****************************************************************************
// - -------- UDPHS_CTRL : (UDPHS Offset: 0x0) UDPHS Control Register -------- 
AT91C_UDPHS_DEV_ADDR      EQU (0x7F <<  0) ;- (UDPHS) UDPHS Address
AT91C_UDPHS_FADDR_EN      EQU (0x1 <<  7) ;- (UDPHS) Function Address Enable
AT91C_UDPHS_EN_UDPHS      EQU (0x1 <<  8) ;- (UDPHS) UDPHS Enable
AT91C_UDPHS_DETACH        EQU (0x1 <<  9) ;- (UDPHS) Detach Command
AT91C_UDPHS_REWAKEUP      EQU (0x1 << 10) ;- (UDPHS) Send Remote Wake Up
AT91C_UDPHS_PULLD_DIS     EQU (0x1 << 11) ;- (UDPHS) PullDown Disable
// - -------- UDPHS_FNUM : (UDPHS Offset: 0x4) UDPHS Frame Number Register -------- 
AT91C_UDPHS_MICRO_FRAME_NUM EQU (0x7 <<  0) ;- (UDPHS) Micro Frame Number
AT91C_UDPHS_FRAME_NUMBER  EQU (0x7FF <<  3) ;- (UDPHS) Frame Number as defined in the Packet Field Formats
AT91C_UDPHS_FNUM_ERR      EQU (0x1 << 31) ;- (UDPHS) Frame Number CRC Error
// - -------- UDPHS_IEN : (UDPHS Offset: 0x10) UDPHS Interrupt Enable Register -------- 
AT91C_UDPHS_DET_SUSPD     EQU (0x1 <<  1) ;- (UDPHS) Suspend Interrupt Enable/Clear/Status
AT91C_UDPHS_MICRO_SOF     EQU (0x1 <<  2) ;- (UDPHS) Micro-SOF Interrupt Enable/Clear/Status
AT91C_UDPHS_IEN_SOF       EQU (0x1 <<  3) ;- (UDPHS) SOF Interrupt Enable/Clear/Status
AT91C_UDPHS_ENDRESET      EQU (0x1 <<  4) ;- (UDPHS) End Of Reset Interrupt Enable/Clear/Status
AT91C_UDPHS_WAKE_UP       EQU (0x1 <<  5) ;- (UDPHS) Wake Up CPU Interrupt Enable/Clear/Status
AT91C_UDPHS_ENDOFRSM      EQU (0x1 <<  6) ;- (UDPHS) End Of Resume Interrupt Enable/Clear/Status
AT91C_UDPHS_UPSTR_RES     EQU (0x1 <<  7) ;- (UDPHS) Upstream Resume Interrupt Enable/Clear/Status
AT91C_UDPHS_EPT_INT_0     EQU (0x1 <<  8) ;- (UDPHS) Endpoint 0 Interrupt Enable/Status
AT91C_UDPHS_EPT_INT_1     EQU (0x1 <<  9) ;- (UDPHS) Endpoint 1 Interrupt Enable/Status
AT91C_UDPHS_EPT_INT_2     EQU (0x1 << 10) ;- (UDPHS) Endpoint 2 Interrupt Enable/Status
AT91C_UDPHS_EPT_INT_3     EQU (0x1 << 11) ;- (UDPHS) Endpoint 3 Interrupt Enable/Status
AT91C_UDPHS_EPT_INT_4     EQU (0x1 << 12) ;- (UDPHS) Endpoint 4 Interrupt Enable/Status
AT91C_UDPHS_EPT_INT_5     EQU (0x1 << 13) ;- (UDPHS) Endpoint 5 Interrupt Enable/Status
AT91C_UDPHS_EPT_INT_6     EQU (0x1 << 14) ;- (UDPHS) Endpoint 6 Interrupt Enable/Status
AT91C_UDPHS_DMA_INT_1     EQU (0x1 << 25) ;- (UDPHS) DMA Channel 1 Interrupt Enable/Status
AT91C_UDPHS_DMA_INT_2     EQU (0x1 << 26) ;- (UDPHS) DMA Channel 2 Interrupt Enable/Status
AT91C_UDPHS_DMA_INT_3     EQU (0x1 << 27) ;- (UDPHS) DMA Channel 3 Interrupt Enable/Status
AT91C_UDPHS_DMA_INT_4     EQU (0x1 << 28) ;- (UDPHS) DMA Channel 4 Interrupt Enable/Status
AT91C_UDPHS_DMA_INT_5     EQU (0x1 << 29) ;- (UDPHS) DMA Channel 5 Interrupt Enable/Status
AT91C_UDPHS_DMA_INT_6     EQU (0x1 << 30) ;- (UDPHS) DMA Channel 6 Interrupt Enable/Status
// - -------- UDPHS_INTSTA : (UDPHS Offset: 0x14) UDPHS Interrupt Status Register -------- 
AT91C_UDPHS_SPEED         EQU (0x1 <<  0) ;- (UDPHS) Speed Status
// - -------- UDPHS_CLRINT : (UDPHS Offset: 0x18) UDPHS Clear Interrupt Register -------- 
// - -------- UDPHS_EPTRST : (UDPHS Offset: 0x1c) UDPHS Endpoints Reset Register -------- 
AT91C_UDPHS_RST_EPT_0     EQU (0x1 <<  0) ;- (UDPHS) Endpoint Reset 0
AT91C_UDPHS_RST_EPT_1     EQU (0x1 <<  1) ;- (UDPHS) Endpoint Reset 1
AT91C_UDPHS_RST_EPT_2     EQU (0x1 <<  2) ;- (UDPHS) Endpoint Reset 2
AT91C_UDPHS_RST_EPT_3     EQU (0x1 <<  3) ;- (UDPHS) Endpoint Reset 3
AT91C_UDPHS_RST_EPT_4     EQU (0x1 <<  4) ;- (UDPHS) Endpoint Reset 4
AT91C_UDPHS_RST_EPT_5     EQU (0x1 <<  5) ;- (UDPHS) Endpoint Reset 5
AT91C_UDPHS_RST_EPT_6     EQU (0x1 <<  6) ;- (UDPHS) Endpoint Reset 6
// - -------- UDPHS_TSTSOFCNT : (UDPHS Offset: 0xd0) UDPHS Test SOF Counter Register -------- 
AT91C_UDPHS_SOFCNTMAX     EQU (0x3 <<  0) ;- (UDPHS) SOF Counter Max Value
AT91C_UDPHS_SOFCTLOAD     EQU (0x1 <<  7) ;- (UDPHS) SOF Counter Load
// - -------- UDPHS_TSTCNTA : (UDPHS Offset: 0xd4) UDPHS Test A Counter Register -------- 
AT91C_UDPHS_CNTAMAX       EQU (0x7FFF <<  0) ;- (UDPHS) A Counter Max Value
AT91C_UDPHS_CNTALOAD      EQU (0x1 << 15) ;- (UDPHS) A Counter Load
// - -------- UDPHS_TSTCNTB : (UDPHS Offset: 0xd8) UDPHS Test B Counter Register -------- 
AT91C_UDPHS_CNTBMAX       EQU (0x7FFF <<  0) ;- (UDPHS) B Counter Max Value
AT91C_UDPHS_CNTBLOAD      EQU (0x1 << 15) ;- (UDPHS) B Counter Load
// - -------- UDPHS_TSTMODREG : (UDPHS Offset: 0xdc) UDPHS Test Mode Register -------- 
AT91C_UDPHS_TSTMODE       EQU (0x1F <<  1) ;- (UDPHS) UDPHS Core TestModeReg
// - -------- UDPHS_TST : (UDPHS Offset: 0xe0) UDPHS Test Register -------- 
AT91C_UDPHS_SPEED_CFG     EQU (0x3 <<  0) ;- (UDPHS) Speed Configuration
AT91C_UDPHS_SPEED_CFG_NM  EQU (0x0) ;- (UDPHS) Normal Mode
AT91C_UDPHS_SPEED_CFG_RS  EQU (0x1) ;- (UDPHS) Reserved
AT91C_UDPHS_SPEED_CFG_HS  EQU (0x2) ;- (UDPHS) Force High Speed
AT91C_UDPHS_SPEED_CFG_FS  EQU (0x3) ;- (UDPHS) Force Full-Speed
AT91C_UDPHS_TST_J         EQU (0x1 <<  2) ;- (UDPHS) TestJMode
AT91C_UDPHS_TST_K         EQU (0x1 <<  3) ;- (UDPHS) TestKMode
AT91C_UDPHS_TST_PKT       EQU (0x1 <<  4) ;- (UDPHS) TestPacketMode
AT91C_UDPHS_OPMODE2       EQU (0x1 <<  5) ;- (UDPHS) OpMode2
// - -------- UDPHS_RIPPADDRSIZE : (UDPHS Offset: 0xec) UDPHS PADDRSIZE Register -------- 
AT91C_UDPHS_IPPADDRSIZE   EQU (0x0 <<  0) ;- (UDPHS) 2^UDPHSDEV_PADDR_SIZE
// - -------- UDPHS_RIPNAME1 : (UDPHS Offset: 0xf0) UDPHS Name Register -------- 
AT91C_UDPHS_IPNAME1       EQU (0x0 <<  0) ;- (UDPHS) ASCII string HUSB
// - -------- UDPHS_RIPNAME2 : (UDPHS Offset: 0xf4) UDPHS Name Register -------- 
AT91C_UDPHS_IPNAME2       EQU (0x0 <<  0) ;- (UDPHS) ASCII string 2DEV
// - -------- UDPHS_IPFEATURES : (UDPHS Offset: 0xf8) UDPHS Features Register -------- 
AT91C_UDPHS_EPT_NBR_MAX   EQU (0xF <<  0) ;- (UDPHS) Max Number of Endpoints
AT91C_UDPHS_DMA_CHANNEL_NBR EQU (0x7 <<  4) ;- (UDPHS) Number of DMA Channels
AT91C_UDPHS_DMA_B_SIZ     EQU (0x1 <<  7) ;- (UDPHS) DMA Buffer Size
AT91C_UDPHS_DMA_FIFO_WORD_DEPTH EQU (0xF <<  8) ;- (UDPHS) DMA FIFO Depth in words
AT91C_UDPHS_FIFO_MAX_SIZE EQU (0x7 << 12) ;- (UDPHS) DPRAM size
AT91C_UDPHS_BW_DPRAM      EQU (0x1 << 15) ;- (UDPHS) DPRAM byte write capability
AT91C_UDPHS_DATAB16_8     EQU (0x1 << 16) ;- (UDPHS) UTMI DataBus16_8
AT91C_UDPHS_ISO_EPT_1     EQU (0x1 << 17) ;- (UDPHS) Endpoint 1 High Bandwidth Isochronous Capability
AT91C_UDPHS_ISO_EPT_2     EQU (0x1 << 18) ;- (UDPHS) Endpoint 2 High Bandwidth Isochronous Capability
AT91C_UDPHS_ISO_EPT_5     EQU (0x1 << 21) ;- (UDPHS) Endpoint 5 High Bandwidth Isochronous Capability
AT91C_UDPHS_ISO_EPT_6     EQU (0x1 << 22) ;- (UDPHS) Endpoint 6 High Bandwidth Isochronous Capability
// - -------- UDPHS_IPVERSION : (UDPHS Offset: 0xfc) UDPHS Version Register -------- 
AT91C_UDPHS_VERSION_NUM   EQU (0xFFFF <<  0) ;- (UDPHS) Give the IP version
AT91C_UDPHS_METAL_FIX_NUM EQU (0x7 << 16) ;- (UDPHS) Give the number of metal fixes

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR AC97 Controller Interface
// - *****************************************************************************
// - -------- AC97C_MR : (AC97C Offset: 0x8) AC97C Mode Register -------- 
AT91C_AC97C_ENA           EQU (0x1 <<  0) ;- (AC97C) AC97 Controller Global Enable
AT91C_AC97C_WRST          EQU (0x1 <<  1) ;- (AC97C) Warm Reset
AT91C_AC97C_VRA           EQU (0x1 <<  2) ;- (AC97C) Variable RAte (for Data Slots)
// - -------- AC97C_ICA : (AC97C Offset: 0x10) AC97C Input Channel Assignement Register -------- 
AT91C_AC97C_CHID3         EQU (0x7 <<  0) ;- (AC97C) Channel Id for the input slot 3
AT91C_AC97C_CHID3_NONE    EQU (0x0) ;- (AC97C) No data will be transmitted during this slot
AT91C_AC97C_CHID3_CA      EQU (0x1) ;- (AC97C) Channel A data will be transmitted during this slot
AT91C_AC97C_CHID3_CB      EQU (0x2) ;- (AC97C) Channel B data will be transmitted during this slot
AT91C_AC97C_CHID3_CC      EQU (0x3) ;- (AC97C) Channel C data will be transmitted during this slot
AT91C_AC97C_CHID4         EQU (0x7 <<  3) ;- (AC97C) Channel Id for the input slot 4
AT91C_AC97C_CHID4_NONE    EQU (0x0 <<  3) ;- (AC97C) No data will be transmitted during this slot
AT91C_AC97C_CHID4_CA      EQU (0x1 <<  3) ;- (AC97C) Channel A data will be transmitted during this slot
AT91C_AC97C_CHID4_CB      EQU (0x2 <<  3) ;- (AC97C) Channel B data will be transmitted during this slot
AT91C_AC97C_CHID4_CC      EQU (0x3 <<  3) ;- (AC97C) Channel C data will be transmitted during this slot
AT91C_AC97C_CHID5         EQU (0x7 <<  6) ;- (AC97C) Channel Id for the input slot 5
AT91C_AC97C_CHID5_NONE    EQU (0x0 <<  6) ;- (AC97C) No data will be transmitted during this slot
AT91C_AC97C_CHID5_CA      EQU (0x1 <<  6) ;- (AC97C) Channel A data will be transmitted during this slot
AT91C_AC97C_CHID5_CB      EQU (0x2 <<  6) ;- (AC97C) Channel B data will be transmitted during this slot
AT91C_AC97C_CHID5_CC      EQU (0x3 <<  6) ;- (AC97C) Channel C data will be transmitted during this slot
AT91C_AC97C_CHID6         EQU (0x7 <<  9) ;- (AC97C) Channel Id for the input slot 6
AT91C_AC97C_CHID6_NONE    EQU (0x0 <<  9) ;- (AC97C) No data will be transmitted during this slot
AT91C_AC97C_CHID6_CA      EQU (0x1 <<  9) ;- (AC97C) Channel A data will be transmitted during this slot
AT91C_AC97C_CHID6_CB      EQU (0x2 <<  9) ;- (AC97C) Channel B data will be transmitted during this slot
AT91C_AC97C_CHID6_CC      EQU (0x3 <<  9) ;- (AC97C) Channel C data will be transmitted during this slot
AT91C_AC97C_CHID7         EQU (0x7 << 12) ;- (AC97C) Channel Id for the input slot 7
AT91C_AC97C_CHID7_NONE    EQU (0x0 << 12) ;- (AC97C) No data will be transmitted during this slot
AT91C_AC97C_CHID7_CA      EQU (0x1 << 12) ;- (AC97C) Channel A data will be transmitted during this slot
AT91C_AC97C_CHID7_CB      EQU (0x2 << 12) ;- (AC97C) Channel B data will be transmitted during this slot
AT91C_AC97C_CHID7_CC      EQU (0x3 << 12) ;- (AC97C) Channel C data will be transmitted during this slot
AT91C_AC97C_CHID8         EQU (0x7 << 15) ;- (AC97C) Channel Id for the input slot 8
AT91C_AC97C_CHID8_NONE    EQU (0x0 << 15) ;- (AC97C) No data will be transmitted during this slot
AT91C_AC97C_CHID8_CA      EQU (0x1 << 15) ;- (AC97C) Channel A data will be transmitted during this slot
AT91C_AC97C_CHID8_CB      EQU (0x2 << 15) ;- (AC97C) Channel B data will be transmitted during this slot
AT91C_AC97C_CHID8_CC      EQU (0x3 << 15) ;- (AC97C) Channel C data will be transmitted during this slot
AT91C_AC97C_CHID9         EQU (0x7 << 18) ;- (AC97C) Channel Id for the input slot 9
AT91C_AC97C_CHID9_NONE    EQU (0x0 << 18) ;- (AC97C) No data will be transmitted during this slot
AT91C_AC97C_CHID9_CA      EQU (0x1 << 18) ;- (AC97C) Channel A data will be transmitted during this slot
AT91C_AC97C_CHID9_CB      EQU (0x2 << 18) ;- (AC97C) Channel B data will be transmitted during this slot
AT91C_AC97C_CHID9_CC      EQU (0x3 << 18) ;- (AC97C) Channel C data will be transmitted during this slot
AT91C_AC97C_CHID10        EQU (0x7 << 21) ;- (AC97C) Channel Id for the input slot 10
AT91C_AC97C_CHID10_NONE   EQU (0x0 << 21) ;- (AC97C) No data will be transmitted during this slot
AT91C_AC97C_CHID10_CA     EQU (0x1 << 21) ;- (AC97C) Channel A data will be transmitted during this slot
AT91C_AC97C_CHID10_CB     EQU (0x2 << 21) ;- (AC97C) Channel B data will be transmitted during this slot
AT91C_AC97C_CHID10_CC     EQU (0x3 << 21) ;- (AC97C) Channel C data will be transmitted during this slot
AT91C_AC97C_CHID11        EQU (0x7 << 24) ;- (AC97C) Channel Id for the input slot 11
AT91C_AC97C_CHID11_NONE   EQU (0x0 << 24) ;- (AC97C) No data will be transmitted during this slot
AT91C_AC97C_CHID11_CA     EQU (0x1 << 24) ;- (AC97C) Channel A data will be transmitted during this slot
AT91C_AC97C_CHID11_CB     EQU (0x2 << 24) ;- (AC97C) Channel B data will be transmitted during this slot
AT91C_AC97C_CHID11_CC     EQU (0x3 << 24) ;- (AC97C) Channel C data will be transmitted during this slot
AT91C_AC97C_CHID12        EQU (0x7 << 27) ;- (AC97C) Channel Id for the input slot 12
AT91C_AC97C_CHID12_NONE   EQU (0x0 << 27) ;- (AC97C) No data will be transmitted during this slot
AT91C_AC97C_CHID12_CA     EQU (0x1 << 27) ;- (AC97C) Channel A data will be transmitted during this slot
AT91C_AC97C_CHID12_CB     EQU (0x2 << 27) ;- (AC97C) Channel B data will be transmitted during this slot
AT91C_AC97C_CHID12_CC     EQU (0x3 << 27) ;- (AC97C) Channel C data will be transmitted during this slot
// - -------- AC97C_OCA : (AC97C Offset: 0x14) AC97C Output Channel Assignement Register -------- 
// - -------- AC97C_CARHR : (AC97C Offset: 0x20) AC97C Channel A Receive Holding Register -------- 
AT91C_AC97C_RDATA         EQU (0xFFFFF <<  0) ;- (AC97C) Receive data
// - -------- AC97C_CATHR : (AC97C Offset: 0x24) AC97C Channel A Transmit Holding Register -------- 
AT91C_AC97C_TDATA         EQU (0xFFFFF <<  0) ;- (AC97C) Transmit data
// - -------- AC97C_CASR : (AC97C Offset: 0x28) AC97C Channel A Status Register -------- 
AT91C_AC97C_TXRDY         EQU (0x1 <<  0) ;- (AC97C) 
AT91C_AC97C_TXEMPTY       EQU (0x1 <<  1) ;- (AC97C) 
AT91C_AC97C_UNRUN         EQU (0x1 <<  2) ;- (AC97C) 
AT91C_AC97C_RXRDY         EQU (0x1 <<  4) ;- (AC97C) 
AT91C_AC97C_OVRUN         EQU (0x1 <<  5) ;- (AC97C) 
AT91C_AC97C_ENDTX         EQU (0x1 << 10) ;- (AC97C) 
AT91C_AC97C_TXBUFE        EQU (0x1 << 11) ;- (AC97C) 
AT91C_AC97C_ENDRX         EQU (0x1 << 14) ;- (AC97C) 
AT91C_AC97C_RXBUFF        EQU (0x1 << 15) ;- (AC97C) 
// - -------- AC97C_CAMR : (AC97C Offset: 0x2c) AC97C Channel A Mode Register -------- 
AT91C_AC97C_SIZE          EQU (0x3 << 16) ;- (AC97C) 
AT91C_AC97C_SIZE_20_BITS  EQU (0x0 << 16) ;- (AC97C) Data size is 20 bits
AT91C_AC97C_SIZE_18_BITS  EQU (0x1 << 16) ;- (AC97C) Data size is 18 bits
AT91C_AC97C_SIZE_16_BITS  EQU (0x2 << 16) ;- (AC97C) Data size is 16 bits
AT91C_AC97C_SIZE_10_BITS  EQU (0x3 << 16) ;- (AC97C) Data size is 10 bits
AT91C_AC97C_CEM           EQU (0x1 << 18) ;- (AC97C) 
AT91C_AC97C_CEN           EQU (0x1 << 21) ;- (AC97C) 
AT91C_AC97C_PDCEN         EQU (0x1 << 22) ;- (AC97C) 
// - -------- AC97C_CBRHR : (AC97C Offset: 0x30) AC97C Channel B Receive Holding Register -------- 
// - -------- AC97C_CBTHR : (AC97C Offset: 0x34) AC97C Channel B Transmit Holding Register -------- 
// - -------- AC97C_CBSR : (AC97C Offset: 0x38) AC97C Channel B Status Register -------- 
// - -------- AC97C_CBMR : (AC97C Offset: 0x3c) AC97C Channel B Mode Register -------- 
// - -------- AC97C_CORHR : (AC97C Offset: 0x40) AC97C Codec Channel Receive Holding Register -------- 
AT91C_AC97C_SDATA         EQU (0xFFFF <<  0) ;- (AC97C) Status Data
// - -------- AC97C_COTHR : (AC97C Offset: 0x44) AC97C Codec Channel Transmit Holding Register -------- 
AT91C_AC97C_CDATA         EQU (0xFFFF <<  0) ;- (AC97C) Command Data
AT91C_AC97C_CADDR         EQU (0x7F << 16) ;- (AC97C) COdec control register index
AT91C_AC97C_READ          EQU (0x1 << 23) ;- (AC97C) Read/Write command
// - -------- AC97C_COSR : (AC97C Offset: 0x48) AC97C CODEC Status Register -------- 
// - -------- AC97C_COMR : (AC97C Offset: 0x4c) AC97C CODEC Mode Register -------- 
// - -------- AC97C_SR : (AC97C Offset: 0x50) AC97C Status Register -------- 
AT91C_AC97C_SOF           EQU (0x1 <<  0) ;- (AC97C) 
AT91C_AC97C_WKUP          EQU (0x1 <<  1) ;- (AC97C) 
AT91C_AC97C_COEVT         EQU (0x1 <<  2) ;- (AC97C) 
AT91C_AC97C_CAEVT         EQU (0x1 <<  3) ;- (AC97C) 
AT91C_AC97C_CBEVT         EQU (0x1 <<  4) ;- (AC97C) 
// - -------- AC97C_IER : (AC97C Offset: 0x54) AC97C Interrupt Enable Register -------- 
// - -------- AC97C_IDR : (AC97C Offset: 0x58) AC97C Interrupt Disable Register -------- 
// - -------- AC97C_IMR : (AC97C Offset: 0x5c) AC97C Interrupt Mask Register -------- 

