una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9g45.h
// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR HDMA Channel structure
// - *****************************************************************************
// - -------- HDMA_SADDR : (HDMA_CH Offset: 0x0)  -------- 
AT91C_SADDR               EQU (0x0 <<  0) ;- (HDMA_CH) 
// - -------- HDMA_DADDR : (HDMA_CH Offset: 0x4)  -------- 
AT91C_DADDR               EQU (0x0 <<  0) ;- (HDMA_CH) 
// - -------- HDMA_DSCR : (HDMA_CH Offset: 0x8)  -------- 
AT91C_HDMA_DSCR_IF        EQU (0x3 <<  0) ;- (HDMA_CH) Select AHB-Lite Interface for current channel
AT91C_HDMA_DSCR_IF_0      EQU (0x0) ;- (HDMA_CH) The Buffer Transfer descriptor is fetched via AHB-Lite Interface 0.
AT91C_HDMA_DSCR_IF_1      EQU (0x1) ;- (HDMA_CH) The Buffer Transfer descriptor is fetched via AHB-Lite Interface 1.
AT91C_HDMA_DSCR_IF_2      EQU (0x2) ;- (HDMA_CH) The Buffer Transfer descriptor is fetched via AHB-Lite Interface 2.
AT91C_HDMA_DSCR_IF_3      EQU (0x3) ;- (HDMA_CH) The Buffer Transfer descriptor is fetched via AHB-Lite Interface 3.
AT91C_HDMA_DSCR           EQU (0x3FFFFFFF <<  2) ;- (HDMA_CH) Buffer Transfer descriptor address. This address is word aligned.
// - -------- HDMA_CTRLA : (HDMA_CH Offset: 0xc)  -------- 
AT91C_HDMA_BTSIZE         EQU (0xFFFF <<  0) ;- (HDMA_CH) Buffer Transfer Size.
AT91C_HDMA_SCSIZE         EQU (0x7 << 16) ;- (HDMA_CH) Source Chunk Transfer Size.
AT91C_HDMA_SCSIZE_1       EQU (0x0 << 16) ;- (HDMA_CH) 1.
AT91C_HDMA_SCSIZE_4       EQU (0x1 << 16) ;- (HDMA_CH) 4.
AT91C_HDMA_SCSIZE_8       EQU (0x2 << 16) ;- (HDMA_CH) 8.
AT91C_HDMA_SCSIZE_16      EQU (0x3 << 16) ;- (HDMA_CH) 16.
AT91C_HDMA_SCSIZE_32      EQU (0x4 << 16) ;- (HDMA_CH) 32.
AT91C_HDMA_SCSIZE_64      EQU (0x5 << 16) ;- (HDMA_CH) 64.
AT91C_HDMA_SCSIZE_128     EQU (0x6 << 16) ;- (HDMA_CH) 128.
AT91C_HDMA_SCSIZE_256     EQU (0x7 << 16) ;- (HDMA_CH) 256.
AT91C_HDMA_DCSIZE         EQU (0x7 << 20) ;- (HDMA_CH) Destination Chunk Transfer Size
AT91C_HDMA_DCSIZE_1       EQU (0x0 << 20) ;- (HDMA_CH) 1.
AT91C_HDMA_DCSIZE_4       EQU (0x1 << 20) ;- (HDMA_CH) 4.
AT91C_HDMA_DCSIZE_8       EQU (0x2 << 20) ;- (HDMA_CH) 8.
AT91C_HDMA_DCSIZE_16      EQU (0x3 << 20) ;- (HDMA_CH) 16.
AT91C_HDMA_DCSIZE_32      EQU (0x4 << 20) ;- (HDMA_CH) 32.
AT91C_HDMA_DCSIZE_64      EQU (0x5 << 20) ;- (HDMA_CH) 64.
AT91C_HDMA_DCSIZE_128     EQU (0x6 << 20) ;- (HDMA_CH) 128.
AT91C_HDMA_DCSIZE_256     EQU (0x7 << 20) ;- (HDMA_CH) 256.
AT91C_HDMA_SRC_WIDTH      EQU (0x3 << 24) ;- (HDMA_CH) Source Single Transfer Size
AT91C_HDMA_SRC_WIDTH_BYTE EQU (0x0 << 24) ;- (HDMA_CH) BYTE.
AT91C_HDMA_SRC_WIDTH_HALFWORD EQU (0x1 << 24) ;- (HDMA_CH) HALF-WORD.
AT91C_HDMA_SRC_WIDTH_WORD EQU (0x2 << 24) ;- (HDMA_CH) WORD.
AT91C_HDMA_DST_WIDTH      EQU (0x3 << 28) ;- (HDMA_CH) Destination Single Transfer Size
AT91C_HDMA_DST_WIDTH_BYTE EQU (0x0 << 28) ;- (HDMA_CH) BYTE.
AT91C_HDMA_DST_WIDTH_HALFWORD EQU (0x1 << 28) ;- (HDMA_CH) HALF-WORD.
AT91C_HDMA_DST_WIDTH_WORD EQU (0x2 << 28) ;- (HDMA_CH) WORD.
AT91C_HDMA_DONE           EQU (0x1 << 31) ;- (HDMA_CH) 
// - -------- HDMA_CTRLB : (HDMA_CH Offset: 0x10)  -------- 
AT91C_HDMA_SIF            EQU (0x3 <<  0) ;- (HDMA_CH) Source Interface Selection Field.
AT91C_HDMA_SIF_0          EQU (0x0) ;- (HDMA_CH) The Source Transfer is done via AHB-Lite Interface 0.
AT91C_HDMA_SIF_1          EQU (0x1) ;- (HDMA_CH) The Source Transfer is done via AHB-Lite Interface 1.
AT91C_HDMA_SIF_2          EQU (0x2) ;- (HDMA_CH) The Source Transfer is done via AHB-Lite Interface 2.
AT91C_HDMA_SIF_3          EQU (0x3) ;- (HDMA_CH) The Source Transfer is done via AHB-Lite Interface 3.
AT91C_HDMA_DIF            EQU (0x3 <<  4) ;- (HDMA_CH) Destination Interface Selection Field.
AT91C_HDMA_DIF_0          EQU (0x0 <<  4) ;- (HDMA_CH) The Destination Transfer is done via AHB-Lite Interface 0.
AT91C_HDMA_DIF_1          EQU (0x1 <<  4) ;- (HDMA_CH) The Destination Transfer is done via AHB-Lite Interface 1.
AT91C_HDMA_DIF_2          EQU (0x2 <<  4) ;- (HDMA_CH) The Destination Transfer is done via AHB-Lite Interface 2.
AT91C_HDMA_DIF_3          EQU (0x3 <<  4) ;- (HDMA_CH) The Destination Transfer is done via AHB-Lite Interface 3.
AT91C_HDMA_SRC_PIP        EQU (0x1 <<  8) ;- (HDMA_CH) Source Picture-in-Picture Mode
AT91C_HDMA_SRC_PIP_DISABLE EQU (0x0 <<  8) ;- (HDMA_CH) Source Picture-in-Picture mode is disabled.
AT91C_HDMA_SRC_PIP_ENABLE EQU (0x1 <<  8) ;- (HDMA_CH) Source Picture-in-Picture mode is enabled.
AT91C_HDMA_DST_PIP        EQU (0x1 << 12) ;- (HDMA_CH) Destination Picture-in-Picture Mode
AT91C_HDMA_DST_PIP_DISABLE EQU (0x0 << 12) ;- (HDMA_CH) Destination Picture-in-Picture mode is disabled.
AT91C_HDMA_DST_PIP_ENABLE EQU (0x1 << 12) ;- (HDMA_CH) Destination Picture-in-Picture mode is enabled.
AT91C_HDMA_SRC_DSCR       EQU (0x1 << 16) ;- (HDMA_CH) Source Buffer Descriptor Fetch operation
AT91C_HDMA_SRC_DSCR_FETCH_FROM_MEM EQU (0x0 << 16) ;- (HDMA_CH) Source address is updated when the descriptor is fetched from the memory.
AT91C_HDMA_SRC_DSCR_FETCH_DISABLE EQU (0x1 << 16) ;- (HDMA_CH) Buffer Descriptor Fetch operation is disabled for the Source.
AT91C_HDMA_DST_DSCR       EQU (0x1 << 20) ;- (HDMA_CH) Destination Buffer Descriptor operation
AT91C_HDMA_DST_DSCR_FETCH_FROM_MEM EQU (0x0 << 20) ;- (HDMA_CH) Destination address is updated when the descriptor is fetched from the memory.
AT91C_HDMA_DST_DSCR_FETCH_DISABLE EQU (0x1 << 20) ;- (HDMA_CH) Buffer Descriptor Fetch operation is disabled for the destination.
AT91C_HDMA_FC             EQU (0x7 << 21) ;- (HDMA_CH) This field defines which devices controls the size of the buffer transfer, also referred as to the Flow Controller.
AT91C_HDMA_FC_MEM2MEM     EQU (0x0 << 21) ;- (HDMA_CH) Memory-to-Memory (DMA Controller).
AT91C_HDMA_FC_MEM2PER     EQU (0x1 << 21) ;- (HDMA_CH) Memory-to-Peripheral (DMA Controller).
AT91C_HDMA_FC_PER2MEM     EQU (0x2 << 21) ;- (HDMA_CH) Peripheral-to-Memory (DMA Controller).
AT91C_HDMA_FC_PER2PER     EQU (0x3 << 21) ;- (HDMA_CH) Peripheral-to-Peripheral (DMA Controller).
AT91C_HDMA_FC_PER2MEM_PER EQU (0x4 << 21) ;- (HDMA_CH) Peripheral-to-Memory (Peripheral).
AT91C_HDMA_FC_MEM2PER_PER EQU (0x5 << 21) ;- (HDMA_CH) Memory-to-Peripheral (Peripheral).
AT91C_HDMA_FC_PER2PER_PER EQU (0x6 << 21) ;- (HDMA_CH) Peripheral-to-Peripheral (Source Peripheral).
AT91C_HDMA_SRC_ADDRESS_MODE EQU (0x3 << 24) ;- (HDMA_CH) Type of addressing mode
AT91C_HDMA_SRC_ADDRESS_MODE_INCR EQU (0x0 << 24) ;- (HDMA_CH) Incrementing Mode.
AT91C_HDMA_SRC_ADDRESS_MODE_DECR EQU (0x1 << 24) ;- (HDMA_CH) Decrementing Mode.
AT91C_HDMA_SRC_ADDRESS_MODE_FIXED EQU (0x2 << 24) ;- (HDMA_CH) Fixed Mode.
AT91C_HDMA_DST_ADDRESS_MODE EQU (0x3 << 28) ;- (HDMA_CH) Type of addressing mode
AT91C_HDMA_DST_ADDRESS_MODE_INCR EQU (0x0 << 28) ;- (HDMA_CH) Incrementing Mode.
AT91C_HDMA_DST_ADDRESS_MODE_DECR EQU (0x1 << 28) ;- (HDMA_CH) Decrementing Mode.
AT91C_HDMA_DST_ADDRESS_MODE_FIXED EQU (0x2 << 28) ;- (HDMA_CH) Fixed Mode.
AT91C_HDMA_AUTO           EQU (0x1 << 31) ;- (HDMA_CH) Automatic multiple buffer transfer enable
AT91C_HDMA_AUTO_DISABLE   EQU (0x0 << 31) ;- (HDMA_CH) Automatic multiple buffer transfer is disabled.
AT91C_HDMA_AUTO_ENABLE    EQU (0x1 << 31) ;- (HDMA_CH) Automatic multiple buffer transfer is enabled. This enables replay mode or contiguous mode when several buffers are transferred.
// - -------- HDMA_CFG : (HDMA_CH Offset: 0x14)  -------- 
AT91C_HDMA_SRC_PER        EQU (0xF <<  0) ;- (HDMA_CH) Channel Source Request is associated with peripheral identifier coded SRC_PER handshaking interface.
AT91C_HDMA_SRC_PER_0      EQU (0x0) ;- (HDMA_CH) HW Handshaking Interface number 0.
AT91C_HDMA_SRC_PER_1      EQU (0x1) ;- (HDMA_CH) HW Handshaking Interface number 1.
AT91C_HDMA_SRC_PER_2      EQU (0x2) ;- (HDMA_CH) HW Handshaking Interface number 2.
AT91C_HDMA_SRC_PER_3      EQU (0x3) ;- (HDMA_CH) HW Handshaking Interface number 3.
AT91C_HDMA_SRC_PER_4      EQU (0x4) ;- (HDMA_CH) HW Handshaking Interface number 4.
AT91C_HDMA_SRC_PER_5      EQU (0x5) ;- (HDMA_CH) HW Handshaking Interface number 5.
AT91C_HDMA_SRC_PER_6      EQU (0x6) ;- (HDMA_CH) HW Handshaking Interface number 6.
AT91C_HDMA_SRC_PER_7      EQU (0x7) ;- (HDMA_CH) HW Handshaking Interface number 7.
AT91C_HDMA_SRC_PER_8      EQU (0x8) ;- (HDMA_CH) HW Handshaking Interface number 8.
AT91C_HDMA_SRC_PER_9      EQU (0x9) ;- (HDMA_CH) HW Handshaking Interface number 9.
AT91C_HDMA_SRC_PER_10     EQU (0xA) ;- (HDMA_CH) HW Handshaking Interface number 10.
AT91C_HDMA_SRC_PER_11     EQU (0xB) ;- (HDMA_CH) HW Handshaking Interface number 11.
AT91C_HDMA_SRC_PER_12     EQU (0xC) ;- (HDMA_CH) HW Handshaking Interface number 12.
AT91C_HDMA_SRC_PER_13     EQU (0xD) ;- (HDMA_CH) HW Handshaking Interface number 13.
AT91C_HDMA_SRC_PER_14     EQU (0xE) ;- (HDMA_CH) HW Handshaking Interface number 14.
AT91C_HDMA_SRC_PER_15     EQU (0xF) ;- (HDMA_CH) HW Handshaking Interface number 15.
AT91C_HDMA_DST_PER        EQU (0xF <<  4) ;- (HDMA_CH) Channel Destination Request is associated with peripheral identifier coded DST_PER handshaking interface.
AT91C_HDMA_DST_PER_0      EQU (0x0 <<  4) ;- (HDMA_CH) HW Handshaking Interface number 0.
AT91C_HDMA_DST_PER_1      EQU (0x1 <<  4) ;- (HDMA_CH) HW Handshaking Interface number 1.
AT91C_HDMA_DST_PER_2      EQU (0x2 <<  4) ;- (HDMA_CH) HW Handshaking Interface number 2.
AT91C_HDMA_DST_PER_3      EQU (0x3 <<  4) ;- (HDMA_CH) HW Handshaking Interface number 3.
AT91C_HDMA_DST_PER_4      EQU (0x4 <<  4) ;- (HDMA_CH) HW Handshaking Interface number 4.
AT91C_HDMA_DST_PER_5      EQU (0x5 <<  4) ;- (HDMA_CH) HW Handshaking Interface number 5.
AT91C_HDMA_DST_PER_6      EQU (0x6 <<  4) ;- (HDMA_CH) HW Handshaking Interface number 6.
AT91C_HDMA_DST_PER_7      EQU (0x7 <<  4) ;- (HDMA_CH) HW Handshaking Interface number 7.
AT91C_HDMA_DST_PER_8      EQU (0x8 <<  4) ;- (HDMA_CH) HW Handshaking Interface number 8.
AT91C_HDMA_DST_PER_9      EQU (0x9 <<  4) ;- (HDMA_CH) HW Handshaking Interface number 9.
AT91C_HDMA_DST_PER_10     EQU (0xA <<  4) ;- (HDMA_CH) HW Handshaking Interface number 10.
AT91C_HDMA_DST_PER_11     EQU (0xB <<  4) ;- (HDMA_CH) HW Handshaking Interface number 11.
AT91C_HDMA_DST_PER_12     EQU (0xC <<  4) ;- (HDMA_CH) HW Handshaking Interface number 12.
AT91C_HDMA_DST_PER_13     EQU (0xD <<  4) ;- (HDMA_CH) HW Handshaking Interface number 13.
AT91C_HDMA_DST_PER_14     EQU (0xE <<  4) ;- (HDMA_CH) HW Handshaking Interface number 14.
AT91C_HDMA_DST_PER_15     EQU (0xF <<  4) ;- (HDMA_CH) HW Handshaking Interface number 15.
AT91C_HDMA_SRC_REP        EQU (0x1 <<  8) ;- (HDMA_CH) Source Replay Mode
AT91C_HDMA_SRC_REP_CONTIGUOUS_ADDR EQU (0x0 <<  8) ;- (HDMA_CH) When automatic mode is activated, source address is contiguous between two buffers.
AT91C_HDMA_SRC_REP_RELOAD_ADDR EQU (0x1 <<  8) ;- (HDMA_CH) When automatic mode is activated, the source address and the control register are reloaded from previous transfer..
AT91C_HDMA_SRC_H2SEL      EQU (0x1 <<  9) ;- (HDMA_CH) Source Handshaking Mode
AT91C_HDMA_SRC_H2SEL_SW   EQU (0x0 <<  9) ;- (HDMA_CH) Software handshaking interface is used to trigger a transfer request.
AT91C_HDMA_SRC_H2SEL_HW   EQU (0x1 <<  9) ;- (HDMA_CH) Hardware handshaking interface is used to trigger a transfer request.
AT91C_HDMA_DST_REP        EQU (0x1 << 12) ;- (HDMA_CH) Destination Replay Mode
AT91C_HDMA_DST_REP_CONTIGUOUS_ADDR EQU (0x0 << 12) ;- (HDMA_CH) When automatic mode is activated, destination address is contiguous between two buffers.
AT91C_HDMA_DST_REP_RELOAD_ADDR EQU (0x1 << 12) ;- (HDMA_CH) When automatic mode is activated, the destination address and the control register are reloaded from previous transfer..
AT91C_HDMA_DST_H2SEL      EQU (0x1 << 13) ;- (HDMA_CH) Destination Handshaking Mode
AT91C_HDMA_DST_H2SEL_SW   EQU (0x0 << 13) ;- (HDMA_CH) Software handshaking interface is used to trigger a transfer request.
AT91C_HDMA_DST_H2SEL_HW   EQU (0x1 << 13) ;- (HDMA_CH) Hardware handshaking interface is used to trigger a transfer request.
AT91C_HDMA_SOD            EQU (0x1 << 16) ;- (HDMA_CH) STOP ON DONE
AT91C_HDMA_SOD_DISABLE    EQU (0x0 << 16) ;- (HDMA_CH) STOP ON DONE disabled, the descriptor fetch operation ignores DONE Field of CTRLA register.
AT91C_HDMA_SOD_ENABLE     EQU (0x1 << 16) ;- (HDMA_CH) STOP ON DONE activated, the DMAC module is automatically disabled if DONE FIELD is set to 1.
AT91C_HDMA_LOCK_IF        EQU (0x1 << 20) ;- (HDMA_CH) Interface Lock
AT91C_HDMA_LOCK_IF_DISABLE EQU (0x0 << 20) ;- (HDMA_CH) Interface Lock capability is disabled.
AT91C_HDMA_LOCK_IF_ENABLE EQU (0x1 << 20) ;- (HDMA_CH) Interface Lock capability is enabled.
AT91C_HDMA_LOCK_B         EQU (0x1 << 21) ;- (HDMA_CH) AHB Bus Lock
AT91C_HDMA_LOCK_B_DISABLE EQU (0x0 << 21) ;- (HDMA_CH) AHB Bus Locking capability is disabled.
AT91C_HDMA_LOCK_B_ENABLE  EQU (0x1 << 21) ;- (HDMA_CH) AHB Bus Locking capability is enabled.
AT91C_HDMA_LOCK_IF_L      EQU (0x1 << 22) ;- (HDMA_CH) Master Interface Arbiter Lock
AT91C_HDMA_LOCK_IF_L_CHUNK EQU (0x0 << 22) ;- (HDMA_CH) The Master Interface Arbiter is locked by the channel x for a chunk transfer.
AT91C_HDMA_LOCK_IF_L_BUFFER EQU (0x1 << 22) ;- (HDMA_CH) The Master Interface Arbiter is locked by the channel x for a buffer transfer.
AT91C_HDMA_AHB_PROT       EQU (0x7 << 24) ;- (HDMA_CH) AHB Prot
AT91C_HDMA_FIFOCFG        EQU (0x3 << 28) ;- (HDMA_CH) FIFO Request Configuration
AT91C_HDMA_FIFOCFG_LARGESTBURST EQU (0x0 << 28) ;- (HDMA_CH) The largest defined length AHB burst is performed on the destination AHB interface.
AT91C_HDMA_FIFOCFG_HALFFIFO EQU (0x1 << 28) ;- (HDMA_CH) When half fifo size is available/filled a source/destination request is serviced.
AT91C_HDMA_FIFOCFG_ENOUGHSPACE EQU (0x2 << 28) ;- (HDMA_CH) When there is enough space/data available to perfom a single AHB access then the request is serviced.
// - -------- HDMA_SPIP : (HDMA_CH Offset: 0x18)  -------- 
AT91C_SPIP_HOLE           EQU (0xFFFF <<  0) ;- (HDMA_CH) This field indicates the value to add to the address when the programmable boundary has been reached.
AT91C_SPIP_BOUNDARY       EQU (0x3FF << 16) ;- (HDMA_CH) This field indicates the number of source transfers to perform before the automatic address increment operation.
// - -------- HDMA_DPIP : (HDMA_CH Offset: 0x1c)  -------- 
AT91C_DPIP_HOLE           EQU (0xFFFF <<  0) ;- (HDMA_CH) This field indicates the value to add to the address when the programmable boundary has been reached.
AT91C_DPIP_BOUNDARY       EQU (0x3FF << 16) ;- (HDMA_CH) This field indicates the number of source transfers to perform before the automatic address increment operation.
// - -------- HDMA_BDSCR : (HDMA_CH Offset: 0x20)  -------- 
// - -------- HDMA_CADDR : (HDMA_CH Offset: 0x24)  -------- 

