una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9g45.h
AT91C_HDMA_KEEP3          EQU (0x1 << 27) ;- (HDMA) When set, it resumes the channel 3 from an automatic stall state.
AT91C_HDMA_KEEP3_0        EQU (0x0 << 27) ;- (HDMA) No effect.
AT91C_HDMA_KEEP3_1        EQU (0x1 << 27) ;- (HDMA) Resumes the channel 3.
AT91C_HDMA_KEEP4          EQU (0x1 << 28) ;- (HDMA) When set, it resumes the channel 4 from an automatic stall state.
AT91C_HDMA_KEEP4_0        EQU (0x0 << 28) ;- (HDMA) No effect.
AT91C_HDMA_KEEP4_1        EQU (0x1 << 28) ;- (HDMA) Resumes the channel 4.
AT91C_HDMA_KEEP5          EQU (0x1 << 29) ;- (HDMA) When set, it resumes the channel 5 from an automatic stall state.
AT91C_HDMA_KEEP5_0        EQU (0x0 << 29) ;- (HDMA) No effect.
AT91C_HDMA_KEEP5_1        EQU (0x1 << 29) ;- (HDMA) Resumes the channel 5.
AT91C_HDMA_KEEP6          EQU (0x1 << 30) ;- (HDMA) When set, it resumes the channel 6 from an automatic stall state.
AT91C_HDMA_KEEP6_0        EQU (0x0 << 30) ;- (HDMA) No effect.
AT91C_HDMA_KEEP6_1        EQU (0x1 << 30) ;- (HDMA) Resumes the channel 6.
AT91C_HDMA_KEEP7          EQU (0x1 << 31) ;- (HDMA) When set, it resumes the channel 7 from an automatic stall state.
AT91C_HDMA_KEEP7_0        EQU (0x0 << 31) ;- (HDMA) No effect.
AT91C_HDMA_KEEP7_1        EQU (0x1 << 31) ;- (HDMA) Resumes the channel 7.
// - -------- HDMA_CHDR : (HDMA Offset: 0x2c)  -------- 
AT91C_HDMA_DIS0           EQU (0x1 <<  0) ;- (HDMA) Write one to this field to disable the channel 0.
AT91C_HDMA_DIS0_0         EQU (0x0) ;- (HDMA) No effect.
AT91C_HDMA_DIS0_1         EQU (0x1) ;- (HDMA) Disables the channel 0.
AT91C_HDMA_DIS1           EQU (0x1 <<  1) ;- (HDMA) Write one to this field to disable the channel 1.
AT91C_HDMA_DIS1_0         EQU (0x0 <<  1) ;- (HDMA) No effect.
AT91C_HDMA_DIS1_1         EQU (0x1 <<  1) ;- (HDMA) Disables the channel 1.
AT91C_HDMA_DIS2           EQU (0x1 <<  2) ;- (HDMA) Write one to this field to disable the channel 2.
AT91C_HDMA_DIS2_0         EQU (0x0 <<  2) ;- (HDMA) No effect.
AT91C_HDMA_DIS2_1         EQU (0x1 <<  2) ;- (HDMA) Disables the channel 2.
AT91C_HDMA_DIS3           EQU (0x1 <<  3) ;- (HDMA) Write one to this field to disable the channel 3.
AT91C_HDMA_DIS3_0         EQU (0x0 <<  3) ;- (HDMA) No effect.
AT91C_HDMA_DIS3_1         EQU (0x1 <<  3) ;- (HDMA) Disables the channel 3.
AT91C_HDMA_DIS4           EQU (0x1 <<  4) ;- (HDMA) Write one to this field to disable the channel 4.
AT91C_HDMA_DIS4_0         EQU (0x0 <<  4) ;- (HDMA) No effect.
AT91C_HDMA_DIS4_1         EQU (0x1 <<  4) ;- (HDMA) Disables the channel 4.
AT91C_HDMA_DIS5           EQU (0x1 <<  5) ;- (HDMA) Write one to this field to disable the channel 5.
AT91C_HDMA_DIS5_0         EQU (0x0 <<  5) ;- (HDMA) No effect.
AT91C_HDMA_DIS5_1         EQU (0x1 <<  5) ;- (HDMA) Disables the channel 5.
AT91C_HDMA_DIS6           EQU (0x1 <<  6) ;- (HDMA) Write one to this field to disable the channel 6.
AT91C_HDMA_DIS6_0         EQU (0x0 <<  6) ;- (HDMA) No effect.
AT91C_HDMA_DIS6_1         EQU (0x1 <<  6) ;- (HDMA) Disables the channel 6.
AT91C_HDMA_DIS7           EQU (0x1 <<  7) ;- (HDMA) Write one to this field to disable the channel 7.
AT91C_HDMA_DIS7_0         EQU (0x0 <<  7) ;- (HDMA) No effect.
AT91C_HDMA_DIS7_1         EQU (0x1 <<  7) ;- (HDMA) Disables the channel 7.
AT91C_HDMA_RES0           EQU (0x1 <<  8) ;- (HDMA) Write one to this field to resume the channel 0 transfer restoring its context.
AT91C_HDMA_RES0_0         EQU (0x0 <<  8) ;- (HDMA) No effect.
AT91C_HDMA_RES0_1         EQU (0x1 <<  8) ;- (HDMA) Resumes the channel 0.
AT91C_HDMA_RES1           EQU (0x1 <<  9) ;- (HDMA) Write one to this field to resume the channel 1 transfer restoring its context.
AT91C_HDMA_RES1_0         EQU (0x0 <<  9) ;- (HDMA) No effect.
AT91C_HDMA_RES1_1         EQU (0x1 <<  9) ;- (HDMA) Resumes the channel 1.
AT91C_HDMA_RES2           EQU (0x1 << 10) ;- (HDMA) Write one to this field to resume the channel 2 transfer restoring its context.
AT91C_HDMA_RES2_0         EQU (0x0 << 10) ;- (HDMA) No effect.
AT91C_HDMA_RES2_1         EQU (0x1 << 10) ;- (HDMA) Resumes the channel 2.
AT91C_HDMA_RES3           EQU (0x1 << 11) ;- (HDMA) Write one to this field to resume the channel 3 transfer restoring its context.
AT91C_HDMA_RES3_0         EQU (0x0 << 11) ;- (HDMA) No effect.
AT91C_HDMA_RES3_1         EQU (0x1 << 11) ;- (HDMA) Resumes the channel 3.
AT91C_HDMA_RES4           EQU (0x1 << 12) ;- (HDMA) Write one to this field to resume the channel 4 transfer restoring its context.
AT91C_HDMA_RES4_0         EQU (0x0 << 12) ;- (HDMA) No effect.
AT91C_HDMA_RES4_1         EQU (0x1 << 12) ;- (HDMA) Resumes the channel 4.
AT91C_HDMA_RES5           EQU (0x1 << 13) ;- (HDMA) Write one to this field to resume the channel 5 transfer restoring its context.
AT91C_HDMA_RES5_0         EQU (0x0 << 13) ;- (HDMA) No effect.
AT91C_HDMA_RES5_1         EQU (0x1 << 13) ;- (HDMA) Resumes the channel 5.
AT91C_HDMA_RES6           EQU (0x1 << 14) ;- (HDMA) Write one to this field to resume the channel 6 transfer restoring its context.
AT91C_HDMA_RES6_0         EQU (0x0 << 14) ;- (HDMA) No effect.
AT91C_HDMA_RES6_1         EQU (0x1 << 14) ;- (HDMA) Resumes the channel 6.
AT91C_HDMA_RES7           EQU (0x1 << 15) ;- (HDMA) Write one to this field to resume the channel 7 transfer restoring its context.
AT91C_HDMA_RES7_0         EQU (0x0 << 15) ;- (HDMA) No effect.
AT91C_HDMA_RES7_1         EQU (0x1 << 15) ;- (HDMA) Resumes the channel 7.
// - -------- HDMA_CHSR : (HDMA Offset: 0x30)  -------- 
AT91C_HDMA_EMPT0          EQU (0x1 << 16) ;- (HDMA) When set, channel 0 is empty.
AT91C_HDMA_EMPT0_0        EQU (0x0 << 16) ;- (HDMA) No effect.
AT91C_HDMA_EMPT0_1        EQU (0x1 << 16) ;- (HDMA) Channel 0 empty.
AT91C_HDMA_EMPT1          EQU (0x1 << 17) ;- (HDMA) When set, channel 1 is empty.
AT91C_HDMA_EMPT1_0        EQU (0x0 << 17) ;- (HDMA) No effect.
AT91C_HDMA_EMPT1_1        EQU (0x1 << 17) ;- (HDMA) Channel 1 empty.
AT91C_HDMA_EMPT2          EQU (0x1 << 18) ;- (HDMA) When set, channel 2 is empty.
AT91C_HDMA_EMPT2_0        EQU (0x0 << 18) ;- (HDMA) No effect.
AT91C_HDMA_EMPT2_1        EQU (0x1 << 18) ;- (HDMA) Channel 2 empty.
AT91C_HDMA_EMPT3          EQU (0x1 << 19) ;- (HDMA) When set, channel 3 is empty.
AT91C_HDMA_EMPT3_0        EQU (0x0 << 19) ;- (HDMA) No effect.
AT91C_HDMA_EMPT3_1        EQU (0x1 << 19) ;- (HDMA) Channel 3 empty.
AT91C_HDMA_EMPT4          EQU (0x1 << 20) ;- (HDMA) When set, channel 4 is empty.
AT91C_HDMA_EMPT4_0        EQU (0x0 << 20) ;- (HDMA) No effect.
AT91C_HDMA_EMPT4_1        EQU (0x1 << 20) ;- (HDMA) Channel 4 empty.
AT91C_HDMA_EMPT5          EQU (0x1 << 21) ;- (HDMA) When set, channel 5 is empty.
AT91C_HDMA_EMPT5_0        EQU (0x0 << 21) ;- (HDMA) No effect.
AT91C_HDMA_EMPT5_1        EQU (0x1 << 21) ;- (HDMA) Channel 5 empty.
AT91C_HDMA_EMPT6          EQU (0x1 << 22) ;- (HDMA) When set, channel 6 is empty.
AT91C_HDMA_EMPT6_0        EQU (0x0 << 22) ;- (HDMA) No effect.
AT91C_HDMA_EMPT6_1        EQU (0x1 << 22) ;- (HDMA) Channel 6 empty.
AT91C_HDMA_EMPT7          EQU (0x1 << 23) ;- (HDMA) When set, channel 7 is empty.
AT91C_HDMA_EMPT7_0        EQU (0x0 << 23) ;- (HDMA) No effect.
AT91C_HDMA_EMPT7_1        EQU (0x1 << 23) ;- (HDMA) Channel 7 empty.
AT91C_HDMA_STAL0          EQU (0x1 << 24) ;- (HDMA) When set, channel 0 is stalled.
AT91C_HDMA_STAL0_0        EQU (0x0 << 24) ;- (HDMA) No effect.
AT91C_HDMA_STAL0_1        EQU (0x1 << 24) ;- (HDMA) Channel 0 stalled.
AT91C_HDMA_STAL1          EQU (0x1 << 25) ;- (HDMA) When set, channel 1 is stalled.
AT91C_HDMA_STAL1_0        EQU (0x0 << 25) ;- (HDMA) No effect.
AT91C_HDMA_STAL1_1        EQU (0x1 << 25) ;- (HDMA) Channel 1 stalled.
AT91C_HDMA_STAL2          EQU (0x1 << 26) ;- (HDMA) When set, channel 2 is stalled.
AT91C_HDMA_STAL2_0        EQU (0x0 << 26) ;- (HDMA) No effect.
AT91C_HDMA_STAL2_1        EQU (0x1 << 26) ;- (HDMA) Channel 2 stalled.
AT91C_HDMA_STAL3          EQU (0x1 << 27) ;- (HDMA) When set, channel 3 is stalled.
AT91C_HDMA_STAL3_0        EQU (0x0 << 27) ;- (HDMA) No effect.
AT91C_HDMA_STAL3_1        EQU (0x1 << 27) ;- (HDMA) Channel 3 stalled.
AT91C_HDMA_STAL4          EQU (0x1 << 28) ;- (HDMA) When set, channel 4 is stalled.
AT91C_HDMA_STAL4_0        EQU (0x0 << 28) ;- (HDMA) No effect.
AT91C_HDMA_STAL4_1        EQU (0x1 << 28) ;- (HDMA) Channel 4 stalled.
AT91C_HDMA_STAL5          EQU (0x1 << 29) ;- (HDMA) When set, channel 5 is stalled.
AT91C_HDMA_STAL5_0        EQU (0x0 << 29) ;- (HDMA) No effect.
AT91C_HDMA_STAL5_1        EQU (0x1 << 29) ;- (HDMA) Channel 5 stalled.
AT91C_HDMA_STAL6          EQU (0x1 << 30) ;- (HDMA) When set, channel 6 is stalled.
AT91C_HDMA_STAL6_0        EQU (0x0 << 30) ;- (HDMA) No effect.
AT91C_HDMA_STAL6_1        EQU (0x1 << 30) ;- (HDMA) Channel 6 stalled.
AT91C_HDMA_STAL7          EQU (0x1 << 31) ;- (HDMA) When set, channel 7 is stalled.
AT91C_HDMA_STAL7_0        EQU (0x0 << 31) ;- (HDMA) No effect.
AT91C_HDMA_STAL7_1        EQU (0x1 << 31) ;- (HDMA) Channel 7 stalled.
// - -------- HDMA_RSVD : (HDMA Offset: 0x34)  -------- 
// - -------- HDMA_RSVD : (HDMA Offset: 0x38)  -------- 

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Error Correction Code controller
// - *****************************************************************************
// - -------- ECC_CR : (ECC Offset: 0x0) ECC reset register -------- 
AT91C_ECC_RST             EQU (0x1 <<  0) ;- (ECC) ECC reset parity
// - -------- ECC_MR : (ECC Offset: 0x4) ECC page size register -------- 
AT91C_ECC_PAGE_SIZE       EQU (0x3 <<  0) ;- (ECC) Nand Flash page size
// - -------- ECC_SR : (ECC Offset: 0x8) ECC status register -------- 
AT91C_ECC_RECERR          EQU (0x1 <<  0) ;- (ECC) ECC error
AT91C_ECC_ECCERR          EQU (0x1 <<  1) ;- (ECC) ECC single error
AT91C_ECC_MULERR          EQU (0x1 <<  2) ;- (ECC) ECC_MULERR
// - -------- ECC_PR : (ECC Offset: 0xc) ECC parity register -------- 
AT91C_ECC_BITADDR         EQU (0xF <<  0) ;- (ECC) Bit address error
AT91C_ECC_WORDADDR        EQU (0xFFF <<  4) ;- (ECC) address of the failing bit
// - -------- ECC_NPR : (ECC Offset: 0x10) ECC N parity register -------- 
AT91C_ECC_NPARITY         EQU (0xFFFF <<  0) ;- (ECC) ECC parity N 
// - -------- ECC_VR : (ECC Offset: 0xfc) ECC version register -------- 
AT91C_ECC_VR              EQU (0xF <<  0) ;- (ECC) ECC version register

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Ethernet MAC 10/100
// - *****************************************************************************
// - -------- EMAC_NCR : (EMAC Offset: 0x0)  -------- 
AT91C_EMAC_LB             EQU (0x1 <<  0) ;- (EMAC) Loopback. Optional. When set, loopback signal is at high level.
AT91C_EMAC_LLB            EQU (0x1 <<  1) ;- (EMAC) Loopback local. 
AT91C_EMAC_RE             EQU (0x1 <<  2) ;- (EMAC) Receive enable. 
AT91C_EMAC_TE             EQU (0x1 <<  3) ;- (EMAC) Transmit enable. 
AT91C_EMAC_MPE            EQU (0x1 <<  4) ;- (EMAC) Management port enable. 
AT91C_EMAC_CLRSTAT        EQU (0x1 <<  5) ;- (EMAC) Clear statistics registers. 
AT91C_EMAC_INCSTAT        EQU (0x1 <<  6) ;- (EMAC) Increment statistics registers. 
AT91C_EMAC_WESTAT         EQU (0x1 <<  7) ;- (EMAC) Write enable for statistics registers. 
AT91C_EMAC_BP             EQU (0x1 <<  8) ;- (EMAC) Back pressure. 
AT91C_EMAC_TSTART         EQU (0x1 <<  9) ;- (EMAC) Start Transmission. 
AT91C_EMAC_THALT          EQU (0x1 << 10) ;- (EMAC) Transmission Halt. 
AT91C_EMAC_TPFR           EQU (0x1 << 11) ;- (EMAC) Transmit pause frame 
AT91C_EMAC_TZQ            EQU (0x1 << 12) ;- (EMAC) Transmit zero quantum pause frame
// - -------- EMAC_NCFGR : (EMAC Offset: 0x4) Network Configuration Register -------- 
AT91C_EMAC_SPD            EQU (0x1 <<  0) ;- (EMAC) Speed. 
AT91C_EMAC_FD             EQU (0x1 <<  1) ;- (EMAC) Full duplex. 
AT91C_EMAC_JFRAME         EQU (0x1 <<  3) ;- (EMAC) Jumbo Frames. 
AT91C_EMAC_CAF            EQU (0x1 <<  4) ;- (EMAC) Copy all frames. 
AT91C_EMAC_NBC            EQU (0x1 <<  5) ;- (EMAC) No broadcast. 
AT91C_EMAC_MTI            EQU (0x1 <<  6) ;- (EMAC) Multicast hash event enable
AT91C_EMAC_UNI            EQU (0x1 <<  7) ;- (EMAC) Unicast hash enable. 
AT91C_EMAC_BIG            EQU (0x1 <<  8) ;- (EMAC) Receive 1522 bytes. 
AT91C_EMAC_EAE            EQU (0x1 <<  9) ;- (EMAC) External address match enable. 
AT91C_EMAC_CLK            EQU (0x3 << 10) ;- (EMAC) 
AT91C_EMAC_CLK_HCLK_8     EQU (0x0 << 10) ;- (EMAC) HCLK divided by 8
AT91C_EMAC_CLK_HCLK_16    EQU (0x1 << 10) ;- (EMAC) HCLK divided by 16
AT91C_EMAC_CLK_HCLK_32    EQU (0x2 << 10) ;- (EMAC) HCLK divided by 32
AT91C_EMAC_CLK_HCLK_64    EQU (0x3 << 10) ;- (EMAC) HCLK divided by 64
AT91C_EMAC_RTY            EQU (0x1 << 12) ;- (EMAC) 
AT91C_EMAC_PAE            EQU (0x1 << 13) ;- (EMAC) 
AT91C_EMAC_RBOF           EQU (0x3 << 14) ;- (EMAC) 
AT91C_EMAC_RBOF_OFFSET_0  EQU (0x0 << 14) ;- (EMAC) no offset from start of receive buffer
AT91C_EMAC_RBOF_OFFSET_1  EQU (0x1 << 14) ;- (EMAC) one byte offset from start of receive buffer
AT91C_EMAC_RBOF_OFFSET_2  EQU (0x2 << 14) ;- (EMAC) two bytes offset from start of receive buffer
AT91C_EMAC_RBOF_OFFSET_3  EQU (0x3 << 14) ;- (EMAC) three bytes offset from start of receive buffer
AT91C_EMAC_RLCE           EQU (0x1 << 16) ;- (EMAC) Receive Length field Checking Enable
AT91C_EMAC_DRFCS          EQU (0x1 << 17) ;- (EMAC) Discard Receive FCS
AT91C_EMAC_EFRHD          EQU (0x1 << 18) ;- (EMAC) 
AT91C_EMAC_IRXFCS         EQU (0x1 << 19) ;- (EMAC) Ignore RX FCS
// - -------- EMAC_NSR : (EMAC Offset: 0x8) Network Status Register -------- 
AT91C_EMAC_LINKR          EQU (0x1 <<  0) ;- (EMAC) 
AT91C_EMAC_MDIO           EQU (0x1 <<  1) ;- (EMAC) 
AT91C_EMAC_IDLE           EQU (0x1 <<  2) ;- (EMAC) 
// - -------- EMAC_TSR : (EMAC Offset: 0x14) Transmit Status Register -------- 
AT91C_EMAC_UBR            EQU (0x1 <<  0) ;- (EMAC) 
AT91C_EMAC_COL            EQU (0x1 <<  1) ;- (EMAC) 
AT91C_EMAC_RLES           EQU (0x1 <<  2) ;- (EMAC) 
AT91C_EMAC_TGO            EQU (0x1 <<  3) ;- (EMAC) Transmit Go
AT91C_EMAC_BEX            EQU (0x1 <<  4) ;- (EMAC) Buffers exhausted mid frame
AT91C_EMAC_COMP           EQU (0x1 <<  5) ;- (EMAC) 
AT91C_EMAC_UND            EQU (0x1 <<  6) ;- (EMAC) 
// - -------- EMAC_RSR : (EMAC Offset: 0x20) Receive Status Register -------- 
AT91C_EMAC_BNA            EQU (0x1 <<  0) ;- (EMAC) 
AT91C_EMAC_REC            EQU (0x1 <<  1) ;- (EMAC) 
AT91C_EMAC_OVR            EQU (0x1 <<  2) ;- (EMAC) 
// - -------- EMAC_ISR : (EMAC Offset: 0x24) Interrupt Status Register -------- 
AT91C_EMAC_MFD            EQU (0x1 <<  0) ;- (EMAC) 
AT91C_EMAC_RCOMP          EQU (0x1 <<  1) ;- (EMAC) 
AT91C_EMAC_RXUBR          EQU (0x1 <<  2) ;- (EMAC) 
AT91C_EMAC_TXUBR          EQU (0x1 <<  3) ;- (EMAC) 
AT91C_EMAC_TUNDR          EQU (0x1 <<  4) ;- (EMAC) 
AT91C_EMAC_RLEX           EQU (0x1 <<  5) ;- (EMAC) 
AT91C_EMAC_TXERR          EQU (0x1 <<  6) ;- (EMAC) 
AT91C_EMAC_TCOMP          EQU (0x1 <<  7) ;- (EMAC) 
AT91C_EMAC_LINK           EQU (0x1 <<  9) ;- (EMAC) 
AT91C_EMAC_ROVR           EQU (0x1 << 10) ;- (EMAC) 
AT91C_EMAC_HRESP          EQU (0x1 << 11) ;- (EMAC) 
AT91C_EMAC_PFRE           EQU (0x1 << 12) ;- (EMAC) 
AT91C_EMAC_PTZ            EQU (0x1 << 13) ;- (EMAC) 
AT91C_EMAC_WOLEV          EQU (0x1 << 14) ;- (EMAC) 
// - -------- EMAC_IER : (EMAC Offset: 0x28) Interrupt Enable Register -------- 
// - -------- EMAC_IDR : (EMAC Offset: 0x2c) Interrupt Disable Register -------- 
// - -------- EMAC_IMR : (EMAC Offset: 0x30) Interrupt Mask Register -------- 
// - -------- EMAC_MAN : (EMAC Offset: 0x34) PHY Maintenance Register -------- 
AT91C_EMAC_DATA           EQU (0xFFFF <<  0) ;- (EMAC) 
AT91C_EMAC_CODE           EQU (0x3 << 16) ;- (EMAC) 
AT91C_EMAC_REGA           EQU (0x1F << 18) ;- (EMAC) 
AT91C_EMAC_PHYA           EQU (0x1F << 23) ;- (EMAC) 
AT91C_EMAC_RW             EQU (0x3 << 28) ;- (EMAC) 
AT91C_EMAC_SOF            EQU (0x3 << 30) ;- (EMAC) 
// - -------- EMAC_USRIO : (EMAC Offset: 0xc0) USER Input Output Register -------- 
AT91C_EMAC_RMII           EQU (0x1 <<  0) ;- (EMAC) Reduce MII
AT91C_EMAC_CLKEN          EQU (0x1 <<  1) ;- (EMAC) Clock Enable
// - -------- EMAC_WOL : (EMAC Offset: 0xc4) Wake On LAN Register -------- 
AT91C_EMAC_IP             EQU (0xFFFF <<  0) ;- (EMAC) ARP request IP address
AT91C_EMAC_MAG            EQU (0x1 << 16) ;- (EMAC) Magic packet event enable
AT91C_EMAC_ARP            EQU (0x1 << 17) ;- (EMAC) ARP request event enable
AT91C_EMAC_SA1            EQU (0x1 << 18) ;- (EMAC) Specific address register 1 event enable
// - -------- EMAC_REV : (EMAC Offset: 0xfc) Revision Register -------- 
AT91C_EMAC_REVREF         EQU (0xFFFF <<  0) ;- (EMAC) 
AT91C_EMAC_PARTREF        EQU (0xFFFF << 16) ;- (EMAC) 

