una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9g45.h
// - *****************************************************************************
// -               REGISTER ADDRESS DEFINITION FOR AT91SAM9G45
// - *****************************************************************************
// - ========== Register definition for SFR peripheral ========== 
AT91C_SFR_INT             EQU (0xFFF74014) ;- (SFR) OHCI suspend Interrupt status
AT91C_SFR_DDRCFG          EQU (0xFFF74004) ;- (SFR) DDR2 SSTL18 control
AT91C_SFR_UTMICFG         EQU (0xFFF74010) ;- (SFR) UTMI Software Reset, and OHCI suspend interrupt control
AT91C_SFR_EBIDELAY        EQU (0xFFF7400C) ;- (SFR) EBI DDR controller clock delay
AT91C_SFR_DDRDELAY        EQU (0xFFF74008) ;- (SFR) DDR2 controller clock delay
AT91C_SFR_EMA             EQU (0xFFF74000) ;- (SFR) memory Extra Margin Adjustment control
// - ========== Register definition for SYS peripheral ========== 
AT91C_SYS_SLCKSEL         EQU (0xFFFFFD50) ;- (SYS) Slow Clock Selection Register
AT91C_SYS_GPBR            EQU (0xFFFFFD60) ;- (SYS) General Purpose Register
// - ========== Register definition for EBI peripheral ========== 
AT91C_EBI_DUMMY           EQU (0xFFFFE200) ;- (EBI) Dummy register - Do not use
// - ========== Register definition for DDR2CP1 peripheral ========== 
AT91C_DDR2CP1_DELAY2      EQU (0xFFFFE434) ;- (DDR2CP1) Pad delay2 Register
AT91C_DDR2CP1_T3PR        EQU (0xFFFFE418) ;- (DDR2CP1) Timing3 Register
AT91C_DDR2CP1_RTR         EQU (0xFFFFE404) ;- (DDR2CP1) Refresh Timer Register
AT91C_DDR2CP1_T0PR        EQU (0xFFFFE40C) ;- (DDR2CP1) Timing0 Register
AT91C_DDR2CP1_WPSR        EQU (0xFFFFE4E8) ;- (DDR2CP1) High Speed Register
AT91C_DDR2CP1_DELAY8      EQU (0xFFFFE44C) ;- (DDR2CP1) Pad delay8 Register
AT91C_DDR2CP1_LPR         EQU (0xFFFFE41C) ;- (DDR2CP1) Low-power Register
AT91C_DDR2CP1_VER         EQU (0xFFFFE428) ;- (DDR2CP1) DLL Version Register
AT91C_DDR2CP1_DELAY7      EQU (0xFFFFE448) ;- (DDR2CP1) Pad delay7 Register
AT91C_DDR2CP1_CR          EQU (0xFFFFE408) ;- (DDR2CP1) Configuration Register
AT91C_DDR2CP1_WPCR        EQU (0xFFFFE4E4) ;- (DDR2CP1) High Speed Register
AT91C_DDR2CP1_MR          EQU (0xFFFFE400) ;- (DDR2CP1) Mode Register
AT91C_DDR2CP1_DELAY5      EQU (0xFFFFE440) ;- (DDR2CP1) Pad delay5 Register
AT91C_DDR2CP1_T2PR        EQU (0xFFFFE414) ;- (DDR2CP1) Timing2 Register
AT91C_DDR2CP1_HS          EQU (0xFFFFE42C) ;- (DDR2CP1) High Speed Register
AT91C_DDR2CP1_MDR         EQU (0xFFFFE420) ;- (DDR2CP1) Memory Device Register
AT91C_DDR2CP1_DELAY4      EQU (0xFFFFE43C) ;- (DDR2CP1) Pad delay4 Register
AT91C_DDR2CP1_DELAY1      EQU (0xFFFFE430) ;- (DDR2CP1) Pad delay1 Register
AT91C_DDR2CP1_DELAY6      EQU (0xFFFFE444) ;- (DDR2CP1) Pad delay6 Register
AT91C_DDR2CP1_DLL         EQU (0xFFFFE424) ;- (DDR2CP1) DLL Information Register
AT91C_DDR2CP1_DELAY3      EQU (0xFFFFE438) ;- (DDR2CP1) Pad delay3 Register
AT91C_DDR2CP1_VERSION     EQU (0xFFFFE4FC) ;- (DDR2CP1) Version Register
AT91C_DDR2CP1_T1PR        EQU (0xFFFFE410) ;- (DDR2CP1) Timing1 Register
// - ========== Register definition for DDR2C peripheral ========== 
AT91C_DDR2C_DELAY8        EQU (0xFFFFE64C) ;- (DDR2C) Pad delay8 Register
AT91C_DDR2C_VER           EQU (0xFFFFE628) ;- (DDR2C) DLL Version Register
AT91C_DDR2C_RTR           EQU (0xFFFFE604) ;- (DDR2C) Refresh Timer Register
AT91C_DDR2C_T0PR          EQU (0xFFFFE60C) ;- (DDR2C) Timing0 Register
AT91C_DDR2C_DELAY5        EQU (0xFFFFE640) ;- (DDR2C) Pad delay5 Register
AT91C_DDR2C_LPR           EQU (0xFFFFE61C) ;- (DDR2C) Low-power Register
AT91C_DDR2C_HS            EQU (0xFFFFE62C) ;- (DDR2C) High Speed Register
AT91C_DDR2C_DELAY2        EQU (0xFFFFE634) ;- (DDR2C) Pad delay2 Register
AT91C_DDR2C_T2PR          EQU (0xFFFFE614) ;- (DDR2C) Timing2 Register
AT91C_DDR2C_DELAY1        EQU (0xFFFFE630) ;- (DDR2C) Pad delay1 Register
AT91C_DDR2C_T1PR          EQU (0xFFFFE610) ;- (DDR2C) Timing1 Register
AT91C_DDR2C_MDR           EQU (0xFFFFE620) ;- (DDR2C) Memory Device Register
AT91C_DDR2C_DELAY6        EQU (0xFFFFE644) ;- (DDR2C) Pad delay6 Register
AT91C_DDR2C_VERSION       EQU (0xFFFFE6FC) ;- (DDR2C) Version Register
AT91C_DDR2C_MR            EQU (0xFFFFE600) ;- (DDR2C) Mode Register
AT91C_DDR2C_DLL           EQU (0xFFFFE624) ;- (DDR2C) DLL Information Register
AT91C_DDR2C_DELAY4        EQU (0xFFFFE63C) ;- (DDR2C) Pad delay4 Register
AT91C_DDR2C_WPCR          EQU (0xFFFFE6E4) ;- (DDR2C) High Speed Register
AT91C_DDR2C_CR            EQU (0xFFFFE608) ;- (DDR2C) Configuration Register
AT91C_DDR2C_DELAY3        EQU (0xFFFFE638) ;- (DDR2C) Pad delay3 Register
AT91C_DDR2C_WPSR          EQU (0xFFFFE6E8) ;- (DDR2C) High Speed Register
AT91C_DDR2C_DELAY7        EQU (0xFFFFE648) ;- (DDR2C) Pad delay7 Register
AT91C_DDR2C_T3PR          EQU (0xFFFFE618) ;- (DDR2C) Timing3 Register
// - ========== Register definition for SMC peripheral ========== 
AT91C_SMC_PULSE7          EQU (0xFFFFE874) ;- (SMC)  Pulse Register for CS 7
AT91C_SMC_DELAY1          EQU (0xFFFFE8C0) ;- (SMC) SMC Delay Control Register
AT91C_SMC_CYCLE2          EQU (0xFFFFE828) ;- (SMC)  Cycle Register for CS 2
AT91C_SMC_DELAY5          EQU (0xFFFFE8D0) ;- (SMC) SMC Delay Control Register
AT91C_SMC_DELAY6          EQU (0xFFFFE8D4) ;- (SMC) SMC Delay Control Register
AT91C_SMC_PULSE2          EQU (0xFFFFE824) ;- (SMC)  Pulse Register for CS 2
AT91C_SMC_SETUP6          EQU (0xFFFFE860) ;- (SMC)  Setup Register for CS 6
AT91C_SMC_SETUP5          EQU (0xFFFFE850) ;- (SMC)  Setup Register for CS 5
AT91C_SMC_CYCLE6          EQU (0xFFFFE868) ;- (SMC)  Cycle Register for CS 6
AT91C_SMC_PULSE6          EQU (0xFFFFE864) ;- (SMC)  Pulse Register for CS 6
AT91C_SMC_CTRL5           EQU (0xFFFFE85C) ;- (SMC)  Control Register for CS 5
AT91C_SMC_CTRL3           EQU (0xFFFFE83C) ;- (SMC)  Control Register for CS 3
AT91C_SMC_DELAY7          EQU (0xFFFFE8D8) ;- (SMC) SMC Delay Control Register
AT91C_SMC_DELAY3          EQU (0xFFFFE8C8) ;- (SMC) SMC Delay Control Register
AT91C_SMC_CYCLE0          EQU (0xFFFFE808) ;- (SMC)  Cycle Register for CS 0
AT91C_SMC_SETUP1          EQU (0xFFFFE810) ;- (SMC)  Setup Register for CS 1
AT91C_SMC_PULSE5          EQU (0xFFFFE854) ;- (SMC)  Pulse Register for CS 5
AT91C_SMC_SETUP7          EQU (0xFFFFE870) ;- (SMC)  Setup Register for CS 7
AT91C_SMC_CTRL4           EQU (0xFFFFE84C) ;- (SMC)  Control Register for CS 4
AT91C_SMC_DELAY2          EQU (0xFFFFE8C4) ;- (SMC) SMC Delay Control Register
AT91C_SMC_PULSE3          EQU (0xFFFFE834) ;- (SMC)  Pulse Register for CS 3
AT91C_SMC_CYCLE4          EQU (0xFFFFE848) ;- (SMC)  Cycle Register for CS 4
AT91C_SMC_CTRL1           EQU (0xFFFFE81C) ;- (SMC)  Control Register for CS 1
AT91C_SMC_SETUP3          EQU (0xFFFFE830) ;- (SMC)  Setup Register for CS 3
AT91C_SMC_CTRL0           EQU (0xFFFFE80C) ;- (SMC)  Control Register for CS 0
AT91C_SMC_CYCLE7          EQU (0xFFFFE878) ;- (SMC)  Cycle Register for CS 7
AT91C_SMC_DELAY4          EQU (0xFFFFE8CC) ;- (SMC) SMC Delay Control Register
AT91C_SMC_CYCLE1          EQU (0xFFFFE818) ;- (SMC)  Cycle Register for CS 1
AT91C_SMC_SETUP2          EQU (0xFFFFE820) ;- (SMC)  Setup Register for CS 2
AT91C_SMC_PULSE1          EQU (0xFFFFE814) ;- (SMC)  Pulse Register for CS 1
AT91C_SMC_DELAY8          EQU (0xFFFFE8DC) ;- (SMC) SMC Delay Control Register
AT91C_SMC_CTRL2           EQU (0xFFFFE82C) ;- (SMC)  Control Register for CS 2
AT91C_SMC_PULSE4          EQU (0xFFFFE844) ;- (SMC)  Pulse Register for CS 4
AT91C_SMC_SETUP4          EQU (0xFFFFE840) ;- (SMC)  Setup Register for CS 4
AT91C_SMC_CYCLE3          EQU (0xFFFFE838) ;- (SMC)  Cycle Register for CS 3
AT91C_SMC_SETUP0          EQU (0xFFFFE800) ;- (SMC)  Setup Register for CS 0
AT91C_SMC_CYCLE5          EQU (0xFFFFE858) ;- (SMC)  Cycle Register for CS 5
AT91C_SMC_PULSE0          EQU (0xFFFFE804) ;- (SMC)  Pulse Register for CS 0
AT91C_SMC_CTRL6           EQU (0xFFFFE86C) ;- (SMC)  Control Register for CS 6
AT91C_SMC_CTRL7           EQU (0xFFFFE87C) ;- (SMC)  Control Register for CS 7
// - ========== Register definition for MATRIX peripheral ========== 
AT91C_MATRIX_SCFG1        EQU (0xFFFFEA44) ;- (MATRIX)  Slave Configuration Register 1 : SRAM S1
AT91C_MATRIX_MRCR         EQU (0xFFFFEB00) ;- (MATRIX)  Master Remap Control Register 
AT91C_MATRIX_PRAS2        EQU (0xFFFFEA90) ;- (MATRIX)  PRAS2 : SRAM S2
AT91C_MATRIX_PRAS1        EQU (0xFFFFEA88) ;- (MATRIX)  PRAS1 : SRAM S1
AT91C_MATRIX_PRAS0        EQU (0xFFFFEA80) ;- (MATRIX)  PRAS0 : SRAM S0
AT91C_MATRIX_MCFG8        EQU (0xFFFFEA20) ;- (MATRIX)  Master Configuration Register 8 : eMAC
AT91C_MATRIX_MCFG2        EQU (0xFFFFEA08) ;- (MATRIX)  Master Configuration Register 2 : pdc
AT91C_MATRIX_EBICSA       EQU (0xFFFFEB28) ;- (MATRIX)  EBI Chip Select Assignment Register 
AT91C_MATRIX_PRAS4        EQU (0xFFFFEAA0) ;- (MATRIX)  PRAS4 : ROM + USB Dev + USB EHCI + USB OHCI + LCD + Video Decoder
AT91C_MATRIX_MCFG3        EQU (0xFFFFEA0C) ;- (MATRIX)  Master Configuration Register 3 : USB Host OHCI
AT91C_MATRIX_SCFG0        EQU (0xFFFFEA40) ;- (MATRIX)  Slave Configuration Register 0 : SRAM S0
AT91C_MATRIX_MCFG7        EQU (0xFFFFEA1C) ;- (MATRIX)  Master Configuration Register 7 : lcdc
AT91C_MATRIX_PRAS6        EQU (0xFFFFEAB0) ;- (MATRIX)  PRAS6 : DDR2 S1
AT91C_MATRIX_SCFG7        EQU (0xFFFFEA5C) ;- (MATRIX)  Slave Configuration Register 7 : DDR2 S2
AT91C_MATRIX_PRAS7        EQU (0xFFFFEAB8) ;- (MATRIX)  PRAS7 : DDR2 S2
AT91C_MATRIX_SCFG2        EQU (0xFFFFEA48) ;- (MATRIX)  Slave Configuration Register 2 : SRAM S2
AT91C_MATRIX_WRPROTST     EQU (0xFFFFEBE8) ;- (MATRIX)  Write Protection Status Register 
AT91C_MATRIX_PRBS0        EQU (0xFFFFEA84) ;- (MATRIX)  PRBS0 : SRAM S0
AT91C_MATRIX_PRBS2        EQU (0xFFFFEA94) ;- (MATRIX)  PRBS2 : SRAM S2
AT91C_MATRIX_MCFG4        EQU (0xFFFFEA10) ;- (MATRIX)  Master Configuration Register 4 : DMA0
AT91C_MATRIX_SCFG5        EQU (0xFFFFEA54) ;- (MATRIX)  Slave Configuration Register 5 : DDR2 S0
AT91C_MATRIX_PRBS6        EQU (0xFFFFEAB4) ;- (MATRIX)  PRBS6 : DDR2 S1
AT91C_MATRIX_MCFG1        EQU (0xFFFFEA04) ;- (MATRIX)  Master Configuration Register 1 ; ARM-D
AT91C_MATRIX_SCFG6        EQU (0xFFFFEA58) ;- (MATRIX)  Slave Configuration Register 6 : DDR2 S1
AT91C_MATRIX_SCFG4        EQU (0xFFFFEA50) ;- (MATRIX)  Slave Configuration Register 4 ; ROM + USB Dev + USB EHCI + USB OHCI + LCD + Video Decoder
AT91C_MATRIX_PRBS1        EQU (0xFFFFEA8C) ;- (MATRIX)  PRBS1 : SRAM S1
AT91C_MATRIX_PRBS3        EQU (0xFFFFEA9C) ;- (MATRIX)  PRBS3 : SRAM S3
AT91C_MATRIX_WRPROTEN     EQU (0xFFFFEBE4) ;- (MATRIX)  Write Protection Control Register 
AT91C_MATRIX_TCMR         EQU (0xFFFFEB10) ;- (MATRIX)  Bus Matrix TCM Configuration Register 
AT91C_MATRIX_MCFG0        EQU (0xFFFFEA00) ;- (MATRIX)  Master Configuration Register 0 : ARM-I
AT91C_MATRIX_PRAS5        EQU (0xFFFFEAA8) ;- (MATRIX)  PRAS5 : DDR2 S0
AT91C_MATRIX_DDRMPR       EQU (0xFFFFEB18) ;- (MATRIX)  DDR Multi-Port Register 
AT91C_MATRIX_PRBS4        EQU (0xFFFFEAA4) ;- (MATRIX)  PRBS4 : ROM + USB Dev + USB EHCI + USB OHCI + LCD + Video Decoder
AT91C_MATRIX_MCFG6        EQU (0xFFFFEA18) ;- (MATRIX)  Master Configuration Register 6 : hisi
AT91C_MATRIX_PRBS5        EQU (0xFFFFEAAC) ;- (MATRIX)  PRBS5 : DDR2 S0
AT91C_MATRIX_MCFG9        EQU (0xFFFFEA24) ;- (MATRIX)  Master Configuration Register 9 : USB Device
AT91C_MATRIX_MCFG5        EQU (0xFFFFEA14) ;- (MATRIX)  Master Configuration Register 5 : DMA1
AT91C_MATRIX_PRBS7        EQU (0xFFFFEABC) ;- (MATRIX)  PRBS7 : DDR2 S2
AT91C_MATRIX_MCFG10       EQU (0xFFFFEA28) ;- (MATRIX)  Master Configuration Register 10 : USB Host EHCI
AT91C_MATRIX_PRAS3        EQU (0xFFFFEA98) ;- (MATRIX)  PRAS3 : SRAM S3
AT91C_MATRIX_SCFG3        EQU (0xFFFFEA4C) ;- (MATRIX)  Slave Configuration Register 3 : SRAM S3
// - ========== Register definition for AIC peripheral ========== 
AT91C_AIC_IVR             EQU (0xFFFFF100) ;- (AIC) IRQ Vector Register
AT91C_AIC_SMR             EQU (0xFFFFF000) ;- (AIC) Source Mode Register
AT91C_AIC_FVR             EQU (0xFFFFF104) ;- (AIC) FIQ Vector Register
AT91C_AIC_DCR             EQU (0xFFFFF138) ;- (AIC) Debug Control Register (Protect)
AT91C_AIC_EOICR           EQU (0xFFFFF130) ;- (AIC) End of Interrupt Command Register
AT91C_AIC_SVR             EQU (0xFFFFF080) ;- (AIC) Source Vector Register
AT91C_AIC_FFSR            EQU (0xFFFFF148) ;- (AIC) Fast Forcing Status Register
AT91C_AIC_ICCR            EQU (0xFFFFF128) ;- (AIC) Interrupt Clear Command Register
AT91C_AIC_ISR             EQU (0xFFFFF108) ;- (AIC) Interrupt Status Register
AT91C_AIC_IMR             EQU (0xFFFFF110) ;- (AIC) Interrupt Mask Register
AT91C_AIC_IPR             EQU (0xFFFFF10C) ;- (AIC) Interrupt Pending Register
AT91C_AIC_FFER            EQU (0xFFFFF140) ;- (AIC) Fast Forcing Enable Register
AT91C_AIC_IECR            EQU (0xFFFFF120) ;- (AIC) Interrupt Enable Command Register
AT91C_AIC_ISCR            EQU (0xFFFFF12C) ;- (AIC) Interrupt Set Command Register
AT91C_AIC_FFDR            EQU (0xFFFFF144) ;- (AIC) Fast Forcing Disable Register
AT91C_AIC_CISR            EQU (0xFFFFF114) ;- (AIC) Core Interrupt Status Register
AT91C_AIC_IDCR            EQU (0xFFFFF124) ;- (AIC) Interrupt Disable Command Register
AT91C_AIC_SPU             EQU (0xFFFFF134) ;- (AIC) Spurious Vector Register
// - ========== Register definition for PDC_DBGU peripheral ========== 
AT91C_DBGU_PTCR           EQU (0xFFFFEF20) ;- (PDC_DBGU) PDC Transfer Control Register
AT91C_DBGU_RCR            EQU (0xFFFFEF04) ;- (PDC_DBGU) Receive Counter Register
AT91C_DBGU_TCR            EQU (0xFFFFEF0C) ;- (PDC_DBGU) Transmit Counter Register
AT91C_DBGU_RNCR           EQU (0xFFFFEF14) ;- (PDC_DBGU) Receive Next Counter Register
AT91C_DBGU_TNPR           EQU (0xFFFFEF18) ;- (PDC_DBGU) Transmit Next Pointer Register
AT91C_DBGU_RNPR           EQU (0xFFFFEF10) ;- (PDC_DBGU) Receive Next Pointer Register
AT91C_DBGU_PTSR           EQU (0xFFFFEF24) ;- (PDC_DBGU) PDC Transfer Status Register
AT91C_DBGU_RPR            EQU (0xFFFFEF00) ;- (PDC_DBGU) Receive Pointer Register
AT91C_DBGU_TPR            EQU (0xFFFFEF08) ;- (PDC_DBGU) Transmit Pointer Register
AT91C_DBGU_TNCR           EQU (0xFFFFEF1C) ;- (PDC_DBGU) Transmit Next Counter Register
// - ========== Register definition for DBGU peripheral ========== 
AT91C_DBGU_BRGR           EQU (0xFFFFEE20) ;- (DBGU) Baud Rate Generator Register
AT91C_DBGU_CR             EQU (0xFFFFEE00) ;- (DBGU) Control Register
AT91C_DBGU_THR            EQU (0xFFFFEE1C) ;- (DBGU) Transmitter Holding Register
AT91C_DBGU_IDR            EQU (0xFFFFEE0C) ;- (DBGU) Interrupt Disable Register
AT91C_DBGU_EXID           EQU (0xFFFFEE44) ;- (DBGU) Chip ID Extension Register
AT91C_DBGU_IMR            EQU (0xFFFFEE10) ;- (DBGU) Interrupt Mask Register
AT91C_DBGU_FNTR           EQU (0xFFFFEE48) ;- (DBGU) Force NTRST Register
AT91C_DBGU_IER            EQU (0xFFFFEE08) ;- (DBGU) Interrupt Enable Register
AT91C_DBGU_CSR            EQU (0xFFFFEE14) ;- (DBGU) Channel Status Register
AT91C_DBGU_MR             EQU (0xFFFFEE04) ;- (DBGU) Mode Register
AT91C_DBGU_RHR            EQU (0xFFFFEE18) ;- (DBGU) Receiver Holding Register
AT91C_DBGU_CIDR           EQU (0xFFFFEE40) ;- (DBGU) Chip ID Register
// - ========== Register definition for PIOA peripheral ========== 
AT91C_PIOA_OWDR           EQU (0xFFFFF2A4) ;- (PIOA) Output Write Disable Register
AT91C_PIOA_DELAY3         EQU (0xFFFFF2C8) ;- (PIOA) PIO Delay Control Register
AT91C_PIOA_ISR            EQU (0xFFFFF24C) ;- (PIOA) Interrupt Status Register
AT91C_PIOA_PDR            EQU (0xFFFFF204) ;- (PIOA) PIO Disable Register
AT91C_PIOA_OSR            EQU (0xFFFFF218) ;- (PIOA) Output Status Register
AT91C_PIOA_ABSR           EQU (0xFFFFF278) ;- (PIOA) AB Select Status Register
AT91C_PIOA_DELAY2         EQU (0xFFFFF2C4) ;- (PIOA) PIO Delay Control Register
AT91C_PIOA_PDSR           EQU (0xFFFFF23C) ;- (PIOA) Pin Data Status Register
AT91C_PIOA_BSR            EQU (0xFFFFF274) ;- (PIOA) Select B Register
AT91C_PIOA_DELAY1         EQU (0xFFFFF2C0) ;- (PIOA) PIO Delay Control Register
AT91C_PIOA_PPUER          EQU (0xFFFFF264) ;- (PIOA) Pull-up Enable Register
AT91C_PIOA_OER            EQU (0xFFFFF210) ;- (PIOA) Output Enable Register
AT91C_PIOA_PER            EQU (0xFFFFF200) ;- (PIOA) PIO Enable Register
AT91C_PIOA_VERSION        EQU (0xFFFFF2FC) ;- (PIOA) PIO Version Register
AT91C_PIOA_PPUDR          EQU (0xFFFFF260) ;- (PIOA) Pull-up Disable Register
AT91C_PIOA_ODSR           EQU (0xFFFFF238) ;- (PIOA) Output Data Status Register
AT91C_PIOA_SLEWRATE1      EQU (0xFFFFF2B0) ;- (PIOA) PIO Slewrate Control Register
AT91C_PIOA_MDDR           EQU (0xFFFFF254) ;- (PIOA) Multi-driver Disable Register
AT91C_PIOA_IFSR           EQU (0xFFFFF228) ;- (PIOA) Input Filter Status Register
AT91C_PIOA_CODR           EQU (0xFFFFF234) ;- (PIOA) Clear Output Data Register
AT91C_PIOA_ASR            EQU (0xFFFFF270) ;- (PIOA) Select A Register
AT91C_PIOA_OWSR           EQU (0xFFFFF2A8) ;- (PIOA) Output Write Status Register
AT91C_PIOA_IMR            EQU (0xFFFFF248) ;- (PIOA) Interrupt Mask Register
AT91C_PIOA_PPUSR          EQU (0xFFFFF268) ;- (PIOA) Pull-up Status Register
AT91C_PIOA_MDER           EQU (0xFFFFF250) ;- (PIOA) Multi-driver Enable Register
AT91C_PIOA_IFDR           EQU (0xFFFFF224) ;- (PIOA) Input Filter Disable Register
AT91C_PIOA_SODR           EQU (0xFFFFF230) ;- (PIOA) Set Output Data Register
AT91C_PIOA_OWER           EQU (0xFFFFF2A0) ;- (PIOA) Output Write Enable Register
AT91C_PIOA_IDR            EQU (0xFFFFF244) ;- (PIOA) Interrupt Disable Register
AT91C_PIOA_IFER           EQU (0xFFFFF220) ;- (PIOA) Input Filter Enable Register
AT91C_PIOA_IER            EQU (0xFFFFF240) ;- (PIOA) Interrupt Enable Register
AT91C_PIOA_ODR            EQU (0xFFFFF214) ;- (PIOA) Output Disable Registerr
AT91C_PIOA_MDSR           EQU (0xFFFFF258) ;- (PIOA) Multi-driver Status Register
AT91C_PIOA_DELAY4         EQU (0xFFFFF2CC) ;- (PIOA) PIO Delay Control Register
AT91C_PIOA_PSR            EQU (0xFFFFF208) ;- (PIOA) PIO Status Register
// - ========== Register definition for PIOB peripheral ========== 
AT91C_PIOB_ODR            EQU (0xFFFFF414) ;- (PIOB) Output Disable Registerr
AT91C_PIOB_DELAY4         EQU (0xFFFFF4CC) ;- (PIOB) PIO Delay Control Register
AT91C_PIOB_SODR           EQU (0xFFFFF430) ;- (PIOB) Set Output Data Register
AT91C_PIOB_ISR            EQU (0xFFFFF44C) ;- (PIOB) Interrupt Status Register
AT91C_PIOB_ABSR           EQU (0xFFFFF478) ;- (PIOB) AB Select Status Register
AT91C_PIOB_IMR            EQU (0xFFFFF448) ;- (PIOB) Interrupt Mask Register
AT91C_PIOB_MDSR           EQU (0xFFFFF458) ;- (PIOB) Multi-driver Status Register
AT91C_PIOB_PPUSR          EQU (0xFFFFF468) ;- (PIOB) Pull-up Status Register
AT91C_PIOB_PDSR           EQU (0xFFFFF43C) ;- (PIOB) Pin Data Status Register
AT91C_PIOB_DELAY3         EQU (0xFFFFF4C8) ;- (PIOB) PIO Delay Control Register
AT91C_PIOB_MDDR           EQU (0xFFFFF454) ;- (PIOB) Multi-driver Disable Register
AT91C_PIOB_CODR           EQU (0xFFFFF434) ;- (PIOB) Clear Output Data Register
AT91C_PIOB_MDER           EQU (0xFFFFF450) ;- (PIOB) Multi-driver Enable Register
AT91C_PIOB_PDR            EQU (0xFFFFF404) ;- (PIOB) PIO Disable Register
AT91C_PIOB_IFSR           EQU (0xFFFFF428) ;- (PIOB) Input Filter Status Register
AT91C_PIOB_PSR            EQU (0xFFFFF408) ;- (PIOB) PIO Status Register
AT91C_PIOB_SLEWRATE1      EQU (0xFFFFF4B0) ;- (PIOB) PIO Slewrate Control Register
AT91C_PIOB_IER            EQU (0xFFFFF440) ;- (PIOB) Interrupt Enable Register
AT91C_PIOB_PPUDR          EQU (0xFFFFF460) ;- (PIOB) Pull-up Disable Register
AT91C_PIOB_PER            EQU (0xFFFFF400) ;- (PIOB) PIO Enable Register
AT91C_PIOB_IFDR           EQU (0xFFFFF424) ;- (PIOB) Input Filter Disable Register
AT91C_PIOB_IDR            EQU (0xFFFFF444) ;- (PIOB) Interrupt Disable Register
AT91C_PIOB_OWDR           EQU (0xFFFFF4A4) ;- (PIOB) Output Write Disable Register
AT91C_PIOB_ODSR           EQU (0xFFFFF438) ;- (PIOB) Output Data Status Register
AT91C_PIOB_DELAY2         EQU (0xFFFFF4C4) ;- (PIOB) PIO Delay Control Register
AT91C_PIOB_OWSR           EQU (0xFFFFF4A8) ;- (PIOB) Output Write Status Register
AT91C_PIOB_BSR            EQU (0xFFFFF474) ;- (PIOB) Select B Register
AT91C_PIOB_IFER           EQU (0xFFFFF420) ;- (PIOB) Input Filter Enable Register
AT91C_PIOB_OWER           EQU (0xFFFFF4A0) ;- (PIOB) Output Write Enable Register
AT91C_PIOB_PPUER          EQU (0xFFFFF464) ;- (PIOB) Pull-up Enable Register
AT91C_PIOB_OSR            EQU (0xFFFFF418) ;- (PIOB) Output Status Register
AT91C_PIOB_ASR            EQU (0xFFFFF470) ;- (PIOB) Select A Register
AT91C_PIOB_OER            EQU (0xFFFFF410) ;- (PIOB) Output Enable Register
AT91C_PIOB_VERSION        EQU (0xFFFFF4FC) ;- (PIOB) PIO Version Register
AT91C_PIOB_DELAY1         EQU (0xFFFFF4C0) ;- (PIOB) PIO Delay Control Register
// - ========== Register definition for PIOC peripheral ========== 
AT91C_PIOC_OWDR           EQU (0xFFFFF6A4) ;- (PIOC) Output Write Disable Register
AT91C_PIOC_IMR            EQU (0xFFFFF648) ;- (PIOC) Interrupt Mask Register
AT91C_PIOC_ASR            EQU (0xFFFFF670) ;- (PIOC) Select A Register
AT91C_PIOC_PPUDR          EQU (0xFFFFF660) ;- (PIOC) Pull-up Disable Register
AT91C_PIOC_CODR           EQU (0xFFFFF634) ;- (PIOC) Clear Output Data Register
AT91C_PIOC_OWER           EQU (0xFFFFF6A0) ;- (PIOC) Output Write Enable Register
AT91C_PIOC_ABSR           EQU (0xFFFFF678) ;- (PIOC) AB Select Status Register
AT91C_PIOC_IFDR           EQU (0xFFFFF624) ;- (PIOC) Input Filter Disable Register
AT91C_PIOC_VERSION        EQU (0xFFFFF6FC) ;- (PIOC) PIO Version Register
AT91C_PIOC_ODR            EQU (0xFFFFF614) ;- (PIOC) Output Disable Registerr
AT91C_PIOC_PPUER          EQU (0xFFFFF664) ;- (PIOC) Pull-up Enable Register
AT91C_PIOC_SODR           EQU (0xFFFFF630) ;- (PIOC) Set Output Data Register
AT91C_PIOC_ISR            EQU (0xFFFFF64C) ;- (PIOC) Interrupt Status Register
AT91C_PIOC_OSR            EQU (0xFFFFF618) ;- (PIOC) Output Status Register
AT91C_PIOC_MDSR           EQU (0xFFFFF658) ;- (PIOC) Multi-driver Status Register
AT91C_PIOC_IFER           EQU (0xFFFFF620) ;- (PIOC) Input Filter Enable Register
AT91C_PIOC_DELAY2         EQU (0xFFFFF6C4) ;- (PIOC) PIO Delay Control Register
AT91C_PIOC_MDER           EQU (0xFFFFF650) ;- (PIOC) Multi-driver Enable Register
AT91C_PIOC_PPUSR          EQU (0xFFFFF668) ;- (PIOC) Pull-up Status Register
AT91C_PIOC_PSR            EQU (0xFFFFF608) ;- (PIOC) PIO Status Register
AT91C_PIOC_DELAY4         EQU (0xFFFFF6CC) ;- (PIOC) PIO Delay Control Register
AT91C_PIOC_DELAY3         EQU (0xFFFFF6C8) ;- (PIOC) PIO Delay Control Register
AT91C_PIOC_IER            EQU (0xFFFFF640) ;- (PIOC) Interrupt Enable Register
AT91C_PIOC_SLEWRATE1      EQU (0xFFFFF6B0) ;- (PIOC) PIO Slewrate Control Register
AT91C_PIOC_IDR            EQU (0xFFFFF644) ;- (PIOC) Interrupt Disable Register
AT91C_PIOC_PDSR           EQU (0xFFFFF63C) ;- (PIOC) Pin Data Status Register
AT91C_PIOC_DELAY1         EQU (0xFFFFF6C0) ;- (PIOC) PIO Delay Control Register
AT91C_PIOC_PDR            EQU (0xFFFFF604) ;- (PIOC) PIO Disable Register
AT91C_PIOC_OWSR           EQU (0xFFFFF6A8) ;- (PIOC) Output Write Status Register
AT91C_PIOC_IFSR           EQU (0xFFFFF628) ;- (PIOC) Input Filter Status Register
AT91C_PIOC_ODSR           EQU (0xFFFFF638) ;- (PIOC) Output Data Status Register
AT91C_PIOC_OER            EQU (0xFFFFF610) ;- (PIOC) Output Enable Register
AT91C_PIOC_MDDR           EQU (0xFFFFF654) ;- (PIOC) Multi-driver Disable Register
AT91C_PIOC_BSR            EQU (0xFFFFF674) ;- (PIOC) Select B Register
AT91C_PIOC_PER            EQU (0xFFFFF600) ;- (PIOC) PIO Enable Register
// - ========== Register definition for PIOD peripheral ========== 
