una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9g45.h
AT91C_US0_TCR             EQU (0xFFF8C10C) ;- (PDC_US0) Transmit Counter Register
AT91C_US0_RNPR            EQU (0xFFF8C110) ;- (PDC_US0) Receive Next Pointer Register
AT91C_US0_RPR             EQU (0xFFF8C100) ;- (PDC_US0) Receive Pointer Register
AT91C_US0_TPR             EQU (0xFFF8C108) ;- (PDC_US0) Transmit Pointer Register
// - ========== Register definition for US0 peripheral ========== 
AT91C_US0_MAN             EQU (0xFFF8C050) ;- (US0) Manchester Encoder Decoder Register
AT91C_US0_MR              EQU (0xFFF8C004) ;- (US0) Mode Register
AT91C_US0_RHR             EQU (0xFFF8C018) ;- (US0) Receiver Holding Register
AT91C_US0_CSR             EQU (0xFFF8C014) ;- (US0) Channel Status Register
AT91C_US0_CR              EQU (0xFFF8C000) ;- (US0) Control Register
AT91C_US0_VER             EQU (0xFFF8C0FC) ;- (US0) VERSION Register
AT91C_US0_IER             EQU (0xFFF8C008) ;- (US0) Interrupt Enable Register
AT91C_US0_BRGR            EQU (0xFFF8C020) ;- (US0) Baud Rate Generator Register
AT91C_US0_FEATURES        EQU (0xFFF8C0F8) ;- (US0) US FEATURES REGISTER 
AT91C_US0_RTOR            EQU (0xFFF8C024) ;- (US0) Receiver Time-out Register
AT91C_US0_THR             EQU (0xFFF8C01C) ;- (US0) Transmitter Holding Register
AT91C_US0_NER             EQU (0xFFF8C044) ;- (US0) Nb Errors Register
AT91C_US0_IPNAME1         EQU (0xFFF8C0F0) ;- (US0) US IPNAME1 REGISTER 
AT91C_US0_IMR             EQU (0xFFF8C010) ;- (US0) Interrupt Mask Register
AT91C_US0_ADDRSIZE        EQU (0xFFF8C0EC) ;- (US0) US ADDRSIZE REGISTER 
AT91C_US0_IDR             EQU (0xFFF8C00C) ;- (US0) Interrupt Disable Register
AT91C_US0_FIDI            EQU (0xFFF8C040) ;- (US0) FI_DI_Ratio Register
AT91C_US0_IPNAME2         EQU (0xFFF8C0F4) ;- (US0) US IPNAME2 REGISTER 
AT91C_US0_TTGR            EQU (0xFFF8C028) ;- (US0) Transmitter Time-guard Register
AT91C_US0_IF              EQU (0xFFF8C04C) ;- (US0) IRDA_FILTER Register
// - ========== Register definition for PDC_US1 peripheral ========== 
AT91C_US1_PTCR            EQU (0xFFF90120) ;- (PDC_US1) PDC Transfer Control Register
AT91C_US1_TNCR            EQU (0xFFF9011C) ;- (PDC_US1) Transmit Next Counter Register
AT91C_US1_RCR             EQU (0xFFF90104) ;- (PDC_US1) Receive Counter Register
AT91C_US1_RPR             EQU (0xFFF90100) ;- (PDC_US1) Receive Pointer Register
AT91C_US1_TPR             EQU (0xFFF90108) ;- (PDC_US1) Transmit Pointer Register
AT91C_US1_TCR             EQU (0xFFF9010C) ;- (PDC_US1) Transmit Counter Register
AT91C_US1_RNPR            EQU (0xFFF90110) ;- (PDC_US1) Receive Next Pointer Register
AT91C_US1_TNPR            EQU (0xFFF90118) ;- (PDC_US1) Transmit Next Pointer Register
AT91C_US1_RNCR            EQU (0xFFF90114) ;- (PDC_US1) Receive Next Counter Register
AT91C_US1_PTSR            EQU (0xFFF90124) ;- (PDC_US1) PDC Transfer Status Register
// - ========== Register definition for US1 peripheral ========== 
AT91C_US1_FEATURES        EQU (0xFFF900F8) ;- (US1) US FEATURES REGISTER 
AT91C_US1_ADDRSIZE        EQU (0xFFF900EC) ;- (US1) US ADDRSIZE REGISTER 
AT91C_US1_NER             EQU (0xFFF90044) ;- (US1) Nb Errors Register
AT91C_US1_RHR             EQU (0xFFF90018) ;- (US1) Receiver Holding Register
AT91C_US1_IF              EQU (0xFFF9004C) ;- (US1) IRDA_FILTER Register
AT91C_US1_CR              EQU (0xFFF90000) ;- (US1) Control Register
AT91C_US1_TTGR            EQU (0xFFF90028) ;- (US1) Transmitter Time-guard Register
AT91C_US1_MR              EQU (0xFFF90004) ;- (US1) Mode Register
AT91C_US1_FIDI            EQU (0xFFF90040) ;- (US1) FI_DI_Ratio Register
AT91C_US1_RTOR            EQU (0xFFF90024) ;- (US1) Receiver Time-out Register
AT91C_US1_IER             EQU (0xFFF90008) ;- (US1) Interrupt Enable Register
AT91C_US1_MAN             EQU (0xFFF90050) ;- (US1) Manchester Encoder Decoder Register
AT91C_US1_IPNAME2         EQU (0xFFF900F4) ;- (US1) US IPNAME2 REGISTER 
AT91C_US1_IMR             EQU (0xFFF90010) ;- (US1) Interrupt Mask Register
AT91C_US1_IDR             EQU (0xFFF9000C) ;- (US1) Interrupt Disable Register
AT91C_US1_CSR             EQU (0xFFF90014) ;- (US1) Channel Status Register
AT91C_US1_BRGR            EQU (0xFFF90020) ;- (US1) Baud Rate Generator Register
AT91C_US1_THR             EQU (0xFFF9001C) ;- (US1) Transmitter Holding Register
AT91C_US1_VER             EQU (0xFFF900FC) ;- (US1) VERSION Register
AT91C_US1_IPNAME1         EQU (0xFFF900F0) ;- (US1) US IPNAME1 REGISTER 
// - ========== Register definition for PDC_US2 peripheral ========== 
AT91C_US2_RNCR            EQU (0xFFF94114) ;- (PDC_US2) Receive Next Counter Register
AT91C_US2_PTCR            EQU (0xFFF94120) ;- (PDC_US2) PDC Transfer Control Register
AT91C_US2_TNPR            EQU (0xFFF94118) ;- (PDC_US2) Transmit Next Pointer Register
AT91C_US2_TNCR            EQU (0xFFF9411C) ;- (PDC_US2) Transmit Next Counter Register
AT91C_US2_TPR             EQU (0xFFF94108) ;- (PDC_US2) Transmit Pointer Register
AT91C_US2_RCR             EQU (0xFFF94104) ;- (PDC_US2) Receive Counter Register
AT91C_US2_PTSR            EQU (0xFFF94124) ;- (PDC_US2) PDC Transfer Status Register
AT91C_US2_TCR             EQU (0xFFF9410C) ;- (PDC_US2) Transmit Counter Register
AT91C_US2_RPR             EQU (0xFFF94100) ;- (PDC_US2) Receive Pointer Register
AT91C_US2_RNPR            EQU (0xFFF94110) ;- (PDC_US2) Receive Next Pointer Register
// - ========== Register definition for US2 peripheral ========== 
AT91C_US2_TTGR            EQU (0xFFF94028) ;- (US2) Transmitter Time-guard Register
AT91C_US2_IER             EQU (0xFFF94008) ;- (US2) Interrupt Enable Register
AT91C_US2_ADDRSIZE        EQU (0xFFF940EC) ;- (US2) US ADDRSIZE REGISTER 
AT91C_US2_NER             EQU (0xFFF94044) ;- (US2) Nb Errors Register
AT91C_US2_CR              EQU (0xFFF94000) ;- (US2) Control Register
AT91C_US2_IDR             EQU (0xFFF9400C) ;- (US2) Interrupt Disable Register
AT91C_US2_VER             EQU (0xFFF940FC) ;- (US2) VERSION Register
AT91C_US2_THR             EQU (0xFFF9401C) ;- (US2) Transmitter Holding Register
AT91C_US2_BRGR            EQU (0xFFF94020) ;- (US2) Baud Rate Generator Register
AT91C_US2_CSR             EQU (0xFFF94014) ;- (US2) Channel Status Register
AT91C_US2_IPNAME2         EQU (0xFFF940F4) ;- (US2) US IPNAME2 REGISTER 
AT91C_US2_IMR             EQU (0xFFF94010) ;- (US2) Interrupt Mask Register
AT91C_US2_RHR             EQU (0xFFF94018) ;- (US2) Receiver Holding Register
AT91C_US2_MR              EQU (0xFFF94004) ;- (US2) Mode Register
AT91C_US2_FIDI            EQU (0xFFF94040) ;- (US2) FI_DI_Ratio Register
AT91C_US2_MAN             EQU (0xFFF94050) ;- (US2) Manchester Encoder Decoder Register
AT91C_US2_IF              EQU (0xFFF9404C) ;- (US2) IRDA_FILTER Register
AT91C_US2_FEATURES        EQU (0xFFF940F8) ;- (US2) US FEATURES REGISTER 
AT91C_US2_IPNAME1         EQU (0xFFF940F0) ;- (US2) US IPNAME1 REGISTER 
AT91C_US2_RTOR            EQU (0xFFF94024) ;- (US2) Receiver Time-out Register
// - ========== Register definition for PDC_US3 peripheral ========== 
AT91C_US3_PTSR            EQU (0xFFF98124) ;- (PDC_US3) PDC Transfer Status Register
AT91C_US3_TCR             EQU (0xFFF9810C) ;- (PDC_US3) Transmit Counter Register
AT91C_US3_RNPR            EQU (0xFFF98110) ;- (PDC_US3) Receive Next Pointer Register
AT91C_US3_RNCR            EQU (0xFFF98114) ;- (PDC_US3) Receive Next Counter Register
AT91C_US3_TNPR            EQU (0xFFF98118) ;- (PDC_US3) Transmit Next Pointer Register
AT91C_US3_RPR             EQU (0xFFF98100) ;- (PDC_US3) Receive Pointer Register
AT91C_US3_TPR             EQU (0xFFF98108) ;- (PDC_US3) Transmit Pointer Register
AT91C_US3_RCR             EQU (0xFFF98104) ;- (PDC_US3) Receive Counter Register
AT91C_US3_TNCR            EQU (0xFFF9811C) ;- (PDC_US3) Transmit Next Counter Register
AT91C_US3_PTCR            EQU (0xFFF98120) ;- (PDC_US3) PDC Transfer Control Register
// - ========== Register definition for US3 peripheral ========== 
AT91C_US3_VER             EQU (0xFFF980FC) ;- (US3) VERSION Register
AT91C_US3_BRGR            EQU (0xFFF98020) ;- (US3) Baud Rate Generator Register
AT91C_US3_TTGR            EQU (0xFFF98028) ;- (US3) Transmitter Time-guard Register
AT91C_US3_RTOR            EQU (0xFFF98024) ;- (US3) Receiver Time-out Register
AT91C_US3_MAN             EQU (0xFFF98050) ;- (US3) Manchester Encoder Decoder Register
AT91C_US3_NER             EQU (0xFFF98044) ;- (US3) Nb Errors Register
AT91C_US3_CR              EQU (0xFFF98000) ;- (US3) Control Register
AT91C_US3_IDR             EQU (0xFFF9800C) ;- (US3) Interrupt Disable Register
AT91C_US3_ADDRSIZE        EQU (0xFFF980EC) ;- (US3) US ADDRSIZE REGISTER 
AT91C_US3_CSR             EQU (0xFFF98014) ;- (US3) Channel Status Register
AT91C_US3_IPNAME2         EQU (0xFFF980F4) ;- (US3) US IPNAME2 REGISTER 
AT91C_US3_IER             EQU (0xFFF98008) ;- (US3) Interrupt Enable Register
AT91C_US3_FEATURES        EQU (0xFFF980F8) ;- (US3) US FEATURES REGISTER 
AT91C_US3_MR              EQU (0xFFF98004) ;- (US3) Mode Register
AT91C_US3_IF              EQU (0xFFF9804C) ;- (US3) IRDA_FILTER Register
AT91C_US3_THR             EQU (0xFFF9801C) ;- (US3) Transmitter Holding Register
AT91C_US3_IMR             EQU (0xFFF98010) ;- (US3) Interrupt Mask Register
AT91C_US3_FIDI            EQU (0xFFF98040) ;- (US3) FI_DI_Ratio Register
AT91C_US3_RHR             EQU (0xFFF98018) ;- (US3) Receiver Holding Register
AT91C_US3_IPNAME1         EQU (0xFFF980F0) ;- (US3) US IPNAME1 REGISTER 
// - ========== Register definition for PDC_SSC0 peripheral ========== 
AT91C_SSC0_TNPR           EQU (0xFFF9C118) ;- (PDC_SSC0) Transmit Next Pointer Register
AT91C_SSC0_PTSR           EQU (0xFFF9C124) ;- (PDC_SSC0) PDC Transfer Status Register
AT91C_SSC0_TNCR           EQU (0xFFF9C11C) ;- (PDC_SSC0) Transmit Next Counter Register
AT91C_SSC0_RNCR           EQU (0xFFF9C114) ;- (PDC_SSC0) Receive Next Counter Register
AT91C_SSC0_TPR            EQU (0xFFF9C108) ;- (PDC_SSC0) Transmit Pointer Register
AT91C_SSC0_RCR            EQU (0xFFF9C104) ;- (PDC_SSC0) Receive Counter Register
AT91C_SSC0_PTCR           EQU (0xFFF9C120) ;- (PDC_SSC0) PDC Transfer Control Register
AT91C_SSC0_RNPR           EQU (0xFFF9C110) ;- (PDC_SSC0) Receive Next Pointer Register
AT91C_SSC0_TCR            EQU (0xFFF9C10C) ;- (PDC_SSC0) Transmit Counter Register
AT91C_SSC0_RPR            EQU (0xFFF9C100) ;- (PDC_SSC0) Receive Pointer Register
// - ========== Register definition for SSC0 peripheral ========== 
AT91C_SSC0_IPNAME2        EQU (0xFFF9C0F4) ;- (SSC0) SSC IPNAME2 REGISTER 
AT91C_SSC0_SR             EQU (0xFFF9C040) ;- (SSC0) Status Register
AT91C_SSC0_TSHR           EQU (0xFFF9C034) ;- (SSC0) Transmit Sync Holding Register
AT91C_SSC0_TCMR           EQU (0xFFF9C018) ;- (SSC0) Transmit Clock Mode Register
AT91C_SSC0_ADDRSIZE       EQU (0xFFF9C0EC) ;- (SSC0) SSC ADDRSIZE REGISTER 
AT91C_SSC0_IMR            EQU (0xFFF9C04C) ;- (SSC0) Interrupt Mask Register
AT91C_SSC0_IDR            EQU (0xFFF9C048) ;- (SSC0) Interrupt Disable Register
AT91C_SSC0_CR             EQU (0xFFF9C000) ;- (SSC0) Control Register
AT91C_SSC0_VER            EQU (0xFFF9C0FC) ;- (SSC0) Version Register
AT91C_SSC0_RHR            EQU (0xFFF9C020) ;- (SSC0) Receive Holding Register
AT91C_SSC0_THR            EQU (0xFFF9C024) ;- (SSC0) Transmit Holding Register
AT91C_SSC0_CMR            EQU (0xFFF9C004) ;- (SSC0) Clock Mode Register
AT91C_SSC0_FEATURES       EQU (0xFFF9C0F8) ;- (SSC0) SSC FEATURES REGISTER 
AT91C_SSC0_RCMR           EQU (0xFFF9C010) ;- (SSC0) Receive Clock ModeRegister
AT91C_SSC0_IPNAME1        EQU (0xFFF9C0F0) ;- (SSC0) SSC IPNAME1 REGISTER 
AT91C_SSC0_RSHR           EQU (0xFFF9C030) ;- (SSC0) Receive Sync Holding Register
AT91C_SSC0_IER            EQU (0xFFF9C044) ;- (SSC0) Interrupt Enable Register
AT91C_SSC0_TFMR           EQU (0xFFF9C01C) ;- (SSC0) Transmit Frame Mode Register
AT91C_SSC0_RFMR           EQU (0xFFF9C014) ;- (SSC0) Receive Frame Mode Register
// - ========== Register definition for PDC_SSC1 peripheral ========== 
AT91C_SSC1_RNPR           EQU (0xFFFA0110) ;- (PDC_SSC1) Receive Next Pointer Register
AT91C_SSC1_TCR            EQU (0xFFFA010C) ;- (PDC_SSC1) Transmit Counter Register
AT91C_SSC1_TNCR           EQU (0xFFFA011C) ;- (PDC_SSC1) Transmit Next Counter Register
AT91C_SSC1_RCR            EQU (0xFFFA0104) ;- (PDC_SSC1) Receive Counter Register
AT91C_SSC1_RNCR           EQU (0xFFFA0114) ;- (PDC_SSC1) Receive Next Counter Register
AT91C_SSC1_PTCR           EQU (0xFFFA0120) ;- (PDC_SSC1) PDC Transfer Control Register
AT91C_SSC1_TPR            EQU (0xFFFA0108) ;- (PDC_SSC1) Transmit Pointer Register
AT91C_SSC1_RPR            EQU (0xFFFA0100) ;- (PDC_SSC1) Receive Pointer Register
AT91C_SSC1_PTSR           EQU (0xFFFA0124) ;- (PDC_SSC1) PDC Transfer Status Register
AT91C_SSC1_TNPR           EQU (0xFFFA0118) ;- (PDC_SSC1) Transmit Next Pointer Register
// - ========== Register definition for SSC1 peripheral ========== 
AT91C_SSC1_SR             EQU (0xFFFA0040) ;- (SSC1) Status Register
AT91C_SSC1_TFMR           EQU (0xFFFA001C) ;- (SSC1) Transmit Frame Mode Register
AT91C_SSC1_IPNAME1        EQU (0xFFFA00F0) ;- (SSC1) SSC IPNAME1 REGISTER 
AT91C_SSC1_CMR            EQU (0xFFFA0004) ;- (SSC1) Clock Mode Register
AT91C_SSC1_THR            EQU (0xFFFA0024) ;- (SSC1) Transmit Holding Register
AT91C_SSC1_FEATURES       EQU (0xFFFA00F8) ;- (SSC1) SSC FEATURES REGISTER 
AT91C_SSC1_TSHR           EQU (0xFFFA0034) ;- (SSC1) Transmit Sync Holding Register
AT91C_SSC1_RCMR           EQU (0xFFFA0010) ;- (SSC1) Receive Clock ModeRegister
AT91C_SSC1_RHR            EQU (0xFFFA0020) ;- (SSC1) Receive Holding Register
AT91C_SSC1_VER            EQU (0xFFFA00FC) ;- (SSC1) Version Register
AT91C_SSC1_TCMR           EQU (0xFFFA0018) ;- (SSC1) Transmit Clock Mode Register
AT91C_SSC1_CR             EQU (0xFFFA0000) ;- (SSC1) Control Register
AT91C_SSC1_RSHR           EQU (0xFFFA0030) ;- (SSC1) Receive Sync Holding Register
AT91C_SSC1_IER            EQU (0xFFFA0044) ;- (SSC1) Interrupt Enable Register
AT91C_SSC1_ADDRSIZE       EQU (0xFFFA00EC) ;- (SSC1) SSC ADDRSIZE REGISTER 
AT91C_SSC1_RFMR           EQU (0xFFFA0014) ;- (SSC1) Receive Frame Mode Register
AT91C_SSC1_IMR            EQU (0xFFFA004C) ;- (SSC1) Interrupt Mask Register
AT91C_SSC1_IDR            EQU (0xFFFA0048) ;- (SSC1) Interrupt Disable Register
AT91C_SSC1_IPNAME2        EQU (0xFFFA00F4) ;- (SSC1) SSC IPNAME2 REGISTER 
// - ========== Register definition for PWMC_CH0 peripheral ========== 
AT91C_PWMC_CH0_CCNTR      EQU (0xFFFB820C) ;- (PWMC_CH0) Channel Counter Register
AT91C_PWMC_CH0_CPRDR      EQU (0xFFFB8208) ;- (PWMC_CH0) Channel Period Register
AT91C_PWMC_CH0_CUPDR      EQU (0xFFFB8210) ;- (PWMC_CH0) Channel Update Register
AT91C_PWMC_CH0_CDTYR      EQU (0xFFFB8204) ;- (PWMC_CH0) Channel Duty Cycle Register
AT91C_PWMC_CH0_CMR        EQU (0xFFFB8200) ;- (PWMC_CH0) Channel Mode Register
AT91C_PWMC_CH0_Reserved   EQU (0xFFFB8214) ;- (PWMC_CH0) Reserved
// - ========== Register definition for PWMC_CH1 peripheral ========== 
AT91C_PWMC_CH1_CCNTR      EQU (0xFFFB822C) ;- (PWMC_CH1) Channel Counter Register
AT91C_PWMC_CH1_CDTYR      EQU (0xFFFB8224) ;- (PWMC_CH1) Channel Duty Cycle Register
AT91C_PWMC_CH1_CMR        EQU (0xFFFB8220) ;- (PWMC_CH1) Channel Mode Register
AT91C_PWMC_CH1_CPRDR      EQU (0xFFFB8228) ;- (PWMC_CH1) Channel Period Register
AT91C_PWMC_CH1_Reserved   EQU (0xFFFB8234) ;- (PWMC_CH1) Reserved
AT91C_PWMC_CH1_CUPDR      EQU (0xFFFB8230) ;- (PWMC_CH1) Channel Update Register
// - ========== Register definition for PWMC_CH2 peripheral ========== 
AT91C_PWMC_CH2_CUPDR      EQU (0xFFFB8250) ;- (PWMC_CH2) Channel Update Register
AT91C_PWMC_CH2_CMR        EQU (0xFFFB8240) ;- (PWMC_CH2) Channel Mode Register
AT91C_PWMC_CH2_Reserved   EQU (0xFFFB8254) ;- (PWMC_CH2) Reserved
AT91C_PWMC_CH2_CPRDR      EQU (0xFFFB8248) ;- (PWMC_CH2) Channel Period Register
AT91C_PWMC_CH2_CDTYR      EQU (0xFFFB8244) ;- (PWMC_CH2) Channel Duty Cycle Register
AT91C_PWMC_CH2_CCNTR      EQU (0xFFFB824C) ;- (PWMC_CH2) Channel Counter Register
// - ========== Register definition for PWMC_CH3 peripheral ========== 
AT91C_PWMC_CH3_CPRDR      EQU (0xFFFB8268) ;- (PWMC_CH3) Channel Period Register
AT91C_PWMC_CH3_Reserved   EQU (0xFFFB8274) ;- (PWMC_CH3) Reserved
AT91C_PWMC_CH3_CUPDR      EQU (0xFFFB8270) ;- (PWMC_CH3) Channel Update Register
AT91C_PWMC_CH3_CDTYR      EQU (0xFFFB8264) ;- (PWMC_CH3) Channel Duty Cycle Register
AT91C_PWMC_CH3_CCNTR      EQU (0xFFFB826C) ;- (PWMC_CH3) Channel Counter Register
AT91C_PWMC_CH3_CMR        EQU (0xFFFB8260) ;- (PWMC_CH3) Channel Mode Register
// - ========== Register definition for PWMC peripheral ========== 
AT91C_PWMC_IDR            EQU (0xFFFB8014) ;- (PWMC) PWMC Interrupt Disable Register
AT91C_PWMC_MR             EQU (0xFFFB8000) ;- (PWMC) PWMC Mode Register
AT91C_PWMC_VR             EQU (0xFFFB80FC) ;- (PWMC) PWMC Version Register
AT91C_PWMC_IMR            EQU (0xFFFB8018) ;- (PWMC) PWMC Interrupt Mask Register
AT91C_PWMC_SR             EQU (0xFFFB800C) ;- (PWMC) PWMC Status Register
AT91C_PWMC_ISR            EQU (0xFFFB801C) ;- (PWMC) PWMC Interrupt Status Register
AT91C_PWMC_ENA            EQU (0xFFFB8004) ;- (PWMC) PWMC Enable Register
AT91C_PWMC_IER            EQU (0xFFFB8010) ;- (PWMC) PWMC Interrupt Enable Register
AT91C_PWMC_DIS            EQU (0xFFFB8008) ;- (PWMC) PWMC Disable Register
// - ========== Register definition for PDC_SPI0 peripheral ========== 
AT91C_SPI0_TPR            EQU (0xFFFA4108) ;- (PDC_SPI0) Transmit Pointer Register
AT91C_SPI0_PTCR           EQU (0xFFFA4120) ;- (PDC_SPI0) PDC Transfer Control Register
AT91C_SPI0_RNPR           EQU (0xFFFA4110) ;- (PDC_SPI0) Receive Next Pointer Register
AT91C_SPI0_TNCR           EQU (0xFFFA411C) ;- (PDC_SPI0) Transmit Next Counter Register
AT91C_SPI0_TCR            EQU (0xFFFA410C) ;- (PDC_SPI0) Transmit Counter Register
AT91C_SPI0_RCR            EQU (0xFFFA4104) ;- (PDC_SPI0) Receive Counter Register
AT91C_SPI0_RNCR           EQU (0xFFFA4114) ;- (PDC_SPI0) Receive Next Counter Register
AT91C_SPI0_TNPR           EQU (0xFFFA4118) ;- (PDC_SPI0) Transmit Next Pointer Register
AT91C_SPI0_RPR            EQU (0xFFFA4100) ;- (PDC_SPI0) Receive Pointer Register
AT91C_SPI0_PTSR           EQU (0xFFFA4124) ;- (PDC_SPI0) PDC Transfer Status Register
// - ========== Register definition for PDC_SPI1 peripheral ========== 
AT91C_SPI1_RNCR           EQU (0xFFFA8114) ;- (PDC_SPI1) Receive Next Counter Register
AT91C_SPI1_TCR            EQU (0xFFFA810C) ;- (PDC_SPI1) Transmit Counter Register
AT91C_SPI1_RCR            EQU (0xFFFA8104) ;- (PDC_SPI1) Receive Counter Register
AT91C_SPI1_TNPR           EQU (0xFFFA8118) ;- (PDC_SPI1) Transmit Next Pointer Register
AT91C_SPI1_RNPR           EQU (0xFFFA8110) ;- (PDC_SPI1) Receive Next Pointer Register
AT91C_SPI1_RPR            EQU (0xFFFA8100) ;- (PDC_SPI1) Receive Pointer Register
AT91C_SPI1_TNCR           EQU (0xFFFA811C) ;- (PDC_SPI1) Transmit Next Counter Register
AT91C_SPI1_TPR            EQU (0xFFFA8108) ;- (PDC_SPI1) Transmit Pointer Register
AT91C_SPI1_PTSR           EQU (0xFFFA8124) ;- (PDC_SPI1) PDC Transfer Status Register
AT91C_SPI1_PTCR           EQU (0xFFFA8120) ;- (PDC_SPI1) PDC Transfer Control Register
// - ========== Register definition for SPI0 peripheral ========== 
AT91C_SPI0_MR             EQU (0xFFFA4004) ;- (SPI0) Mode Register
AT91C_SPI0_RDR            EQU (0xFFFA4008) ;- (SPI0) Receive Data Register
AT91C_SPI0_CR             EQU (0xFFFA4000) ;- (SPI0) Control Register
AT91C_SPI0_IER            EQU (0xFFFA4014) ;- (SPI0) Interrupt Enable Register
AT91C_SPI0_TDR            EQU (0xFFFA400C) ;- (SPI0) Transmit Data Register
AT91C_SPI0_IDR            EQU (0xFFFA4018) ;- (SPI0) Interrupt Disable Register
AT91C_SPI0_CSR            EQU (0xFFFA4030) ;- (SPI0) Chip Select Register
AT91C_SPI0_SR             EQU (0xFFFA4010) ;- (SPI0) Status Register
AT91C_SPI0_IMR            EQU (0xFFFA401C) ;- (SPI0) Interrupt Mask Register
// - ========== Register definition for SPI1 peripheral ========== 
AT91C_SPI1_CSR            EQU (0xFFFA8030) ;- (SPI1) Chip Select Register
AT91C_SPI1_IER            EQU (0xFFFA8014) ;- (SPI1) Interrupt Enable Register
AT91C_SPI1_RDR            EQU (0xFFFA8008) ;- (SPI1) Receive Data Register
AT91C_SPI1_IDR            EQU (0xFFFA8018) ;- (SPI1) Interrupt Disable Register
AT91C_SPI1_MR             EQU (0xFFFA8004) ;- (SPI1) Mode Register
AT91C_SPI1_CR             EQU (0xFFFA8000) ;- (SPI1) Control Register
AT91C_SPI1_SR             EQU (0xFFFA8010) ;- (SPI1) Status Register
AT91C_SPI1_TDR            EQU (0xFFFA800C) ;- (SPI1) Transmit Data Register
AT91C_SPI1_IMR            EQU (0xFFFA801C) ;- (SPI1) Interrupt Mask Register
// - ========== Register definition for PDC_TSADC peripheral ========== 
AT91C_TSADC_TCR           EQU (0xFFFB010C) ;- (PDC_TSADC) Transmit Counter Register
AT91C_TSADC_PTCR          EQU (0xFFFB0120) ;- (PDC_TSADC) PDC Transfer Control Register
AT91C_TSADC_RNCR          EQU (0xFFFB0114) ;- (PDC_TSADC) Receive Next Counter Register
AT91C_TSADC_PTSR          EQU (0xFFFB0124) ;- (PDC_TSADC) PDC Transfer Status Register
AT91C_TSADC_TNCR          EQU (0xFFFB011C) ;- (PDC_TSADC) Transmit Next Counter Register
AT91C_TSADC_RNPR          EQU (0xFFFB0110) ;- (PDC_TSADC) Receive Next Pointer Register
AT91C_TSADC_RCR           EQU (0xFFFB0104) ;- (PDC_TSADC) Receive Counter Register
AT91C_TSADC_TPR           EQU (0xFFFB0108) ;- (PDC_TSADC) Transmit Pointer Register
AT91C_TSADC_TNPR          EQU (0xFFFB0118) ;- (PDC_TSADC) Transmit Next Pointer Register
AT91C_TSADC_RPR           EQU (0xFFFB0100) ;- (PDC_TSADC) Receive Pointer Register
// - ========== Register definition for TSADC peripheral ========== 
AT91C_TSADC_CHSR          EQU (0xFFFB0018) ;- (TSADC) Channel Status Register
AT91C_TSADC_CDR5          EQU (0xFFFB0044) ;- (TSADC) Channel Data Register 5
AT91C_TSADC_CR            EQU (0xFFFB0000) ;- (TSADC) Control Register
AT91C_TSADC_IMR           EQU (0xFFFB002C) ;- (TSADC) Interrupt Mask Register
AT91C_TSADC_CHDR          EQU (0xFFFB0014) ;- (TSADC) Channel Disable Register
AT91C_TSADC_LCDR          EQU (0xFFFB0020) ;- (TSADC) Last Converted Register
AT91C_TSADC_IER           EQU (0xFFFB0024) ;- (TSADC) Interrupt Enable Register
AT91C_TSADC_TSR           EQU (0xFFFB000C) ;- (TSADC) Touch Screen Register
AT91C_TSADC_CDR2          EQU (0xFFFB0038) ;- (TSADC) Channel Data Register 2
AT91C_TSADC_CDR4          EQU (0xFFFB0040) ;- (TSADC) Channel Data Register 4
AT91C_TSADC_CHER          EQU (0xFFFB0010) ;- (TSADC) Channel Enable Register
AT91C_TSADC_TRGR          EQU (0xFFFB0008) ;- (TSADC) Trigger Register
AT91C_TSADC_CDR3          EQU (0xFFFB003C) ;- (TSADC) Channel Data Register 3
AT91C_TSADC_SR            EQU (0xFFFB001C) ;- (TSADC) Status Register
AT91C_TSADC_CDR0          EQU (0xFFFB0030) ;- (TSADC) Channel Data Register 0
AT91C_TSADC_CDR6          EQU (0xFFFB0048) ;- (TSADC) Channel Data Register 6
AT91C_TSADC_IDR           EQU (0xFFFB0028) ;- (TSADC) Interrupt Disable Register
AT91C_TSADC_MR            EQU (0xFFFB0004) ;- (TSADC) Mode Register
AT91C_TSADC_CDR7          EQU (0xFFFB004C) ;- (TSADC) Channel Data Register 7
AT91C_TSADC_CDR1          EQU (0xFFFB0034) ;- (TSADC) Channel Data Register 1
// - ========== Register definition for UDPHS_EPTFIFO peripheral ========== 
AT91C_UDPHS_EPTFIFO_READEPT3 EQU (0x00630000) ;- (UDPHS_EPTFIFO) FIFO Endpoint Data Register 3
AT91C_UDPHS_EPTFIFO_READEPT5 EQU (0x00650000) ;- (UDPHS_EPTFIFO) FIFO Endpoint Data Register 5
AT91C_UDPHS_EPTFIFO_READEPT1 EQU (0x00610000) ;- (UDPHS_EPTFIFO) FIFO Endpoint Data Register 1
AT91C_UDPHS_EPTFIFO_READEPT0 EQU (0x00600000) ;- (UDPHS_EPTFIFO) FIFO Endpoint Data Register 0
AT91C_UDPHS_EPTFIFO_READEPT6 EQU (0x00660000) ;- (UDPHS_EPTFIFO) FIFO Endpoint Data Register 6
