una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9g45.h
// - ========== Register definition for HDMA_CH_5 peripheral ========== 
AT91C_HDMA_CH_5_CTRLB     EQU (0xFFFFED14) ;- (HDMA_CH_5) HDMA Channel Control B Register
AT91C_HDMA_CH_5_DADDR     EQU (0xFFFFED08) ;- (HDMA_CH_5) HDMA Channel Destination Address Register
AT91C_HDMA_CH_5_SPIP      EQU (0xFFFFED1C) ;- (HDMA_CH_5) HDMA Channel Source Picture in Picture Configuration Register
AT91C_HDMA_CH_5_DSCR      EQU (0xFFFFED0C) ;- (HDMA_CH_5) HDMA Channel Descriptor Address Register
AT91C_HDMA_CH_5_DPIP      EQU (0xFFFFED20) ;- (HDMA_CH_5) HDMA Channel Destination Picture in Picture Configuration Register
AT91C_HDMA_CH_5_CFG       EQU (0xFFFFED18) ;- (HDMA_CH_5) HDMA Channel Configuration Register
AT91C_HDMA_CH_5_CADDR     EQU (0xFFFFED28) ;- (HDMA_CH_5) HDMA Reserved
AT91C_HDMA_CH_5_SADDR     EQU (0xFFFFED04) ;- (HDMA_CH_5) HDMA Channel Source Address Register
AT91C_HDMA_CH_5_BDSCR     EQU (0xFFFFED24) ;- (HDMA_CH_5) HDMA Reserved
AT91C_HDMA_CH_5_CTRLA     EQU (0xFFFFED10) ;- (HDMA_CH_5) HDMA Channel Control A Register
// - ========== Register definition for HDMA_CH_6 peripheral ========== 
AT91C_HDMA_CH_6_SADDR     EQU (0xFFFFED2C) ;- (HDMA_CH_6) HDMA Channel Source Address Register
AT91C_HDMA_CH_6_BDSCR     EQU (0xFFFFED4C) ;- (HDMA_CH_6) HDMA Reserved
AT91C_HDMA_CH_6_CADDR     EQU (0xFFFFED50) ;- (HDMA_CH_6) HDMA Reserved
AT91C_HDMA_CH_6_SPIP      EQU (0xFFFFED44) ;- (HDMA_CH_6) HDMA Channel Source Picture in Picture Configuration Register
AT91C_HDMA_CH_6_CTRLB     EQU (0xFFFFED3C) ;- (HDMA_CH_6) HDMA Channel Control B Register
AT91C_HDMA_CH_6_DSCR      EQU (0xFFFFED34) ;- (HDMA_CH_6) HDMA Channel Descriptor Address Register
AT91C_HDMA_CH_6_CFG       EQU (0xFFFFED40) ;- (HDMA_CH_6) HDMA Channel Configuration Register
AT91C_HDMA_CH_6_DPIP      EQU (0xFFFFED48) ;- (HDMA_CH_6) HDMA Channel Destination Picture in Picture Configuration Register
AT91C_HDMA_CH_6_DADDR     EQU (0xFFFFED30) ;- (HDMA_CH_6) HDMA Channel Destination Address Register
AT91C_HDMA_CH_6_CTRLA     EQU (0xFFFFED38) ;- (HDMA_CH_6) HDMA Channel Control A Register
// - ========== Register definition for HDMA_CH_7 peripheral ========== 
AT91C_HDMA_CH_7_CADDR     EQU (0xFFFFED78) ;- (HDMA_CH_7) HDMA Reserved
AT91C_HDMA_CH_7_CFG       EQU (0xFFFFED68) ;- (HDMA_CH_7) HDMA Channel Configuration Register
AT91C_HDMA_CH_7_DADDR     EQU (0xFFFFED58) ;- (HDMA_CH_7) HDMA Channel Destination Address Register
AT91C_HDMA_CH_7_CTRLB     EQU (0xFFFFED64) ;- (HDMA_CH_7) HDMA Channel Control B Register
AT91C_HDMA_CH_7_DSCR      EQU (0xFFFFED5C) ;- (HDMA_CH_7) HDMA Channel Descriptor Address Register
AT91C_HDMA_CH_7_DPIP      EQU (0xFFFFED70) ;- (HDMA_CH_7) HDMA Channel Destination Picture in Picture Configuration Register
AT91C_HDMA_CH_7_CTRLA     EQU (0xFFFFED60) ;- (HDMA_CH_7) HDMA Channel Control A Register
AT91C_HDMA_CH_7_BDSCR     EQU (0xFFFFED74) ;- (HDMA_CH_7) HDMA Reserved
AT91C_HDMA_CH_7_SPIP      EQU (0xFFFFED6C) ;- (HDMA_CH_7) HDMA Channel Source Picture in Picture Configuration Register
AT91C_HDMA_CH_7_SADDR     EQU (0xFFFFED54) ;- (HDMA_CH_7) HDMA Channel Source Address Register
// - ========== Register definition for HDMA peripheral ========== 
AT91C_HDMA_EBCIDR         EQU (0xFFFFEC1C) ;- (HDMA) HDMA Error, Chained Buffer transfer completed and Buffer transfer completed Interrupt Disable register
AT91C_HDMA_LAST           EQU (0xFFFFEC10) ;- (HDMA) HDMA Software Last Transfer Flag Register
AT91C_HDMA_SREQ           EQU (0xFFFFEC08) ;- (HDMA) HDMA Software Single Request Register
AT91C_HDMA_RSVD0          EQU (0xFFFFEC34) ;- (HDMA) HDMA Reserved
AT91C_HDMA_EBCIER         EQU (0xFFFFEC18) ;- (HDMA) HDMA Error, Chained Buffer transfer completed and Buffer transfer completed Interrupt Enable register
AT91C_HDMA_GCFG           EQU (0xFFFFEC00) ;- (HDMA) HDMA Global Configuration Register
AT91C_HDMA_CHER           EQU (0xFFFFEC28) ;- (HDMA) HDMA Channel Handler Enable Register
AT91C_HDMA_RSVD1          EQU (0xFFFFEC38) ;- (HDMA) HDMA Reserved
AT91C_HDMA_CHDR           EQU (0xFFFFEC2C) ;- (HDMA) HDMA Channel Handler Disable Register
AT91C_HDMA_EBCIMR         EQU (0xFFFFEC20) ;- (HDMA) HDMA Error, Chained Buffer transfer completed and Buffer transfer completed Mask Register
AT91C_HDMA_CREQ           EQU (0xFFFFEC0C) ;- (HDMA) HDMA Software Chunk Transfer Request Register
AT91C_HDMA_SYNC           EQU (0xFFFFEC14) ;- (HDMA) HDMA Request Synchronization Register
AT91C_HDMA_EN             EQU (0xFFFFEC04) ;- (HDMA) HDMA Controller Enable Register
AT91C_HDMA_EBCISR         EQU (0xFFFFEC24) ;- (HDMA) HDMA Error, Chained Buffer transfer completed and Buffer transfer completed Status Register
AT91C_HDMA_CHSR           EQU (0xFFFFEC30) ;- (HDMA) HDMA Channel Handler Status Register
// - ========== Register definition for HECC peripheral ========== 
AT91C_HECC_VR             EQU (0xFFFFE2FC) ;- (HECC)  ECC Version register
AT91C_HECC_SR             EQU (0xFFFFE208) ;- (HECC)  ECC Status register
AT91C_HECC_CR             EQU (0xFFFFE200) ;- (HECC)  ECC reset register
AT91C_HECC_NPR            EQU (0xFFFFE210) ;- (HECC)  ECC Parity N register
AT91C_HECC_PR             EQU (0xFFFFE20C) ;- (HECC)  ECC Parity register
AT91C_HECC_MR             EQU (0xFFFFE204) ;- (HECC)  ECC Page size register
// - ========== Register definition for EMACB peripheral ========== 
AT91C_EMACB_ALE           EQU (0xFFFBC054) ;- (EMACB) Alignment Error Register
AT91C_EMACB_RRE           EQU (0xFFFBC06C) ;- (EMACB) Receive Ressource Error Register
AT91C_EMACB_SA4H          EQU (0xFFFBC0B4) ;- (EMACB) Specific Address 4 Top, Last 2 bytes
AT91C_EMACB_TPQ           EQU (0xFFFBC0BC) ;- (EMACB) Transmit Pause Quantum Register
AT91C_EMACB_RJA           EQU (0xFFFBC07C) ;- (EMACB) Receive Jabbers Register
AT91C_EMACB_SA2H          EQU (0xFFFBC0A4) ;- (EMACB) Specific Address 2 Top, Last 2 bytes
AT91C_EMACB_TPF           EQU (0xFFFBC08C) ;- (EMACB) Transmitted Pause Frames Register
AT91C_EMACB_ROV           EQU (0xFFFBC070) ;- (EMACB) Receive Overrun Errors Register
AT91C_EMACB_SA4L          EQU (0xFFFBC0B0) ;- (EMACB) Specific Address 4 Bottom, First 4 bytes
AT91C_EMACB_MAN           EQU (0xFFFBC034) ;- (EMACB) PHY Maintenance Register
AT91C_EMACB_TID           EQU (0xFFFBC0B8) ;- (EMACB) Type ID Checking Register
AT91C_EMACB_TBQP          EQU (0xFFFBC01C) ;- (EMACB) Transmit Buffer Queue Pointer
AT91C_EMACB_SA3L          EQU (0xFFFBC0A8) ;- (EMACB) Specific Address 3 Bottom, First 4 bytes
AT91C_EMACB_DTF           EQU (0xFFFBC058) ;- (EMACB) Deferred Transmission Frame Register
AT91C_EMACB_PTR           EQU (0xFFFBC038) ;- (EMACB) Pause Time Register
AT91C_EMACB_CSE           EQU (0xFFFBC068) ;- (EMACB) Carrier Sense Error Register
AT91C_EMACB_ECOL          EQU (0xFFFBC060) ;- (EMACB) Excessive Collision Register
AT91C_EMACB_STE           EQU (0xFFFBC084) ;- (EMACB) SQE Test Error Register
AT91C_EMACB_MCF           EQU (0xFFFBC048) ;- (EMACB) Multiple Collision Frame Register
AT91C_EMACB_IER           EQU (0xFFFBC028) ;- (EMACB) Interrupt Enable Register
AT91C_EMACB_ELE           EQU (0xFFFBC078) ;- (EMACB) Excessive Length Errors Register
AT91C_EMACB_USRIO         EQU (0xFFFBC0C0) ;- (EMACB) USER Input/Output Register
AT91C_EMACB_PFR           EQU (0xFFFBC03C) ;- (EMACB) Pause Frames received Register
AT91C_EMACB_FCSE          EQU (0xFFFBC050) ;- (EMACB) Frame Check Sequence Error Register
AT91C_EMACB_SA1L          EQU (0xFFFBC098) ;- (EMACB) Specific Address 1 Bottom, First 4 bytes
AT91C_EMACB_NCR           EQU (0xFFFBC000) ;- (EMACB) Network Control Register
AT91C_EMACB_HRT           EQU (0xFFFBC094) ;- (EMACB) Hash Address Top[63:32]
AT91C_EMACB_NCFGR         EQU (0xFFFBC004) ;- (EMACB) Network Configuration Register
AT91C_EMACB_SCF           EQU (0xFFFBC044) ;- (EMACB) Single Collision Frame Register
AT91C_EMACB_LCOL          EQU (0xFFFBC05C) ;- (EMACB) Late Collision Register
AT91C_EMACB_SA3H          EQU (0xFFFBC0AC) ;- (EMACB) Specific Address 3 Top, Last 2 bytes
AT91C_EMACB_HRB           EQU (0xFFFBC090) ;- (EMACB) Hash Address Bottom[31:0]
AT91C_EMACB_ISR           EQU (0xFFFBC024) ;- (EMACB) Interrupt Status Register
AT91C_EMACB_IMR           EQU (0xFFFBC030) ;- (EMACB) Interrupt Mask Register
AT91C_EMACB_WOL           EQU (0xFFFBC0C4) ;- (EMACB) Wake On LAN Register
AT91C_EMACB_USF           EQU (0xFFFBC080) ;- (EMACB) Undersize Frames Register
AT91C_EMACB_TSR           EQU (0xFFFBC014) ;- (EMACB) Transmit Status Register
AT91C_EMACB_FRO           EQU (0xFFFBC04C) ;- (EMACB) Frames Received OK Register
AT91C_EMACB_IDR           EQU (0xFFFBC02C) ;- (EMACB) Interrupt Disable Register
AT91C_EMACB_SA1H          EQU (0xFFFBC09C) ;- (EMACB) Specific Address 1 Top, Last 2 bytes
AT91C_EMACB_RLE           EQU (0xFFFBC088) ;- (EMACB) Receive Length Field Mismatch Register
AT91C_EMACB_TUND          EQU (0xFFFBC064) ;- (EMACB) Transmit Underrun Error Register
AT91C_EMACB_RSR           EQU (0xFFFBC020) ;- (EMACB) Receive Status Register
AT91C_EMACB_SA2L          EQU (0xFFFBC0A0) ;- (EMACB) Specific Address 2 Bottom, First 4 bytes
AT91C_EMACB_FTO           EQU (0xFFFBC040) ;- (EMACB) Frames Transmitted OK Register
AT91C_EMACB_RSE           EQU (0xFFFBC074) ;- (EMACB) Receive Symbol Errors Register
AT91C_EMACB_NSR           EQU (0xFFFBC008) ;- (EMACB) Network Status Register
AT91C_EMACB_RBQP          EQU (0xFFFBC018) ;- (EMACB) Receive Buffer Queue Pointer
AT91C_EMACB_REV           EQU (0xFFFBC0FC) ;- (EMACB) Revision Register
// - ========== Register definition for ISI peripheral ========== 
AT91C_ISI_DMACHDR         EQU (0xFFFB403C) ;- (ISI) DMA Channel Disable Register
AT91C_ISI_IMR             EQU (0xFFFB4034) ;- (ISI) Interrupt Mask Register
AT91C_ISI_R2YSET1         EQU (0xFFFB401C) ;- (ISI) Color Space Conversion RGB to YCrCb Register
AT91C_ISI_PDECF           EQU (0xFFFB400C) ;- (ISI) Preview Decimation Factor Register
AT91C_ISI_CFG2            EQU (0xFFFB4004) ;- (ISI) Configuration Register 2
AT91C_ISI_DMACCTRL        EQU (0xFFFB4054) ;- (ISI) DMA Codec Control Register
AT91C_ISI_CTRL            EQU (0xFFFB4024) ;- (ISI) Control Register
AT91C_ISI_Y2RSET0         EQU (0xFFFB4010) ;- (ISI) Color Space Conversion YCrCb to RGB Register
AT91C_ISI_WPSR            EQU (0xFFFB40E8) ;- (ISI) Write Protection Status Register
AT91C_ISI_DMACHER         EQU (0xFFFB4038) ;- (ISI) DMA Channel Enable Register
AT91C_ISI_DMACHSR         EQU (0xFFFB4040) ;- (ISI) DMA Channel Status Register
AT91C_ISI_IDR             EQU (0xFFFB4030) ;- (ISI) Interrupt Disable Register
AT91C_ISI_VER             EQU (0xFFFB40FC) ;- (ISI) Version Register
AT91C_ISI_Y2RSET1         EQU (0xFFFB4014) ;- (ISI) Color Space Conversion YCrCb to RGB Register
AT91C_ISI_R2YSET2         EQU (0xFFFB4020) ;- (ISI) Color Space Conversion RGB to YCrCb Register
AT91C_ISI_SR              EQU (0xFFFB4028) ;- (ISI) Status Register
AT91C_ISI_DMACDSCR        EQU (0xFFFB4058) ;- (ISI) DMA Codec Descriptor Address Register
AT91C_ISI_IER             EQU (0xFFFB402C) ;- (ISI) Interrupt Enable Register
AT91C_ISI_WPCR            EQU (0xFFFB40E4) ;- (ISI) Write Protection Control Register
AT91C_ISI_DMACADDR        EQU (0xFFFB4050) ;- (ISI) DMA Codec Base Address Register
AT91C_ISI_CFG1            EQU (0xFFFB4000) ;- (ISI) Configuration Register 1
AT91C_ISI_R2YSET0         EQU (0xFFFB4018) ;- (ISI) Color Space Conversion RGB to YCrCb Register
AT91C_ISI_PSIZE           EQU (0xFFFB4008) ;- (ISI) Preview Size Register
AT91C_ISI_DMAPDSCR        EQU (0xFFFB404C) ;- (ISI) DMA Preview Descriptor Address Register
AT91C_ISI_DMAPADDR        EQU (0xFFFB4044) ;- (ISI) DMA Preview Base Address Register
AT91C_ISI_DMAPCTRL        EQU (0xFFFB4048) ;- (ISI) DMA Preview Control Register
// - ========== Register definition for UHPHS_OHCI peripheral ========== 
AT91C_OHCI_HcRhPortStatus EQU (0x00700054) ;- (UHPHS_OHCI) Root Hub Port Status Register
AT91C_OHCI_HcFmRemaining  EQU (0x00700038) ;- (UHPHS_OHCI) Bit time remaining in the current Frame
AT91C_OHCI_HcInterruptEnable EQU (0x00700010) ;- (UHPHS_OHCI) Interrupt Enable Register
AT91C_OHCI_HcControl      EQU (0x00700004) ;- (UHPHS_OHCI) Operating modes for the Host Controller
AT91C_OHCI_HcPeriodicStart EQU (0x00700040) ;- (UHPHS_OHCI) Periodic Start
AT91C_OHCI_HcInterruptStatus EQU (0x0070000C) ;- (UHPHS_OHCI) Interrupt Status Register
AT91C_OHCI_HcRhDescriptorB EQU (0x0070004C) ;- (UHPHS_OHCI) Root Hub characteristics B
AT91C_OHCI_HcInterruptDisable EQU (0x00700014) ;- (UHPHS_OHCI) Interrupt Disable Register
AT91C_OHCI_HcPeriodCurrentED EQU (0x0070001C) ;- (UHPHS_OHCI) Current Isochronous or Interrupt Endpoint Descriptor
AT91C_OHCI_HcRhDescriptorA EQU (0x00700048) ;- (UHPHS_OHCI) Root Hub characteristics A
AT91C_OHCI_HcRhStatus     EQU (0x00700050) ;- (UHPHS_OHCI) Root Hub Status register
AT91C_OHCI_HcBulkCurrentED EQU (0x0070002C) ;- (UHPHS_OHCI) Current endpoint of the Bulk list
AT91C_OHCI_HcControlHeadED EQU (0x00700020) ;- (UHPHS_OHCI) First Endpoint Descriptor of the Control list
AT91C_OHCI_HcLSThreshold  EQU (0x00700044) ;- (UHPHS_OHCI) LS Threshold
AT91C_OHCI_HcRevision     EQU (0x00700000) ;- (UHPHS_OHCI) Revision
AT91C_OHCI_HcBulkDoneHead EQU (0x00700030) ;- (UHPHS_OHCI) Last completed transfer descriptor
AT91C_OHCI_HcFmNumber     EQU (0x0070003C) ;- (UHPHS_OHCI) Frame number
AT91C_OHCI_HcFmInterval   EQU (0x00700034) ;- (UHPHS_OHCI) Bit time between 2 consecutive SOFs
AT91C_OHCI_HcBulkHeadED   EQU (0x00700028) ;- (UHPHS_OHCI) First endpoint register of the Bulk list
AT91C_OHCI_HcHCCA         EQU (0x00700018) ;- (UHPHS_OHCI) Pointer to the Host Controller Communication Area
AT91C_OHCI_HcCommandStatus EQU (0x00700008) ;- (UHPHS_OHCI) Command & status Register
AT91C_OHCI_HcControlCurrentED EQU (0x00700024) ;- (UHPHS_OHCI) Endpoint Control and Status Register
// - ========== Register definition for UHPHS_EHCI peripheral ========== 
AT91C_EHCI_USBSTS         EQU (0x00800014) ;- (UHPHS_EHCI) 
AT91C_EHCI_INSNREG03      EQU (0x0080009C) ;- (UHPHS_EHCI) 
AT91C_EHCI_INSNREG00      EQU (0x00800090) ;- (UHPHS_EHCI) 
AT91C_EHCI_HCSPPORTROUTE  EQU (0x0080000C) ;- (UHPHS_EHCI) 
AT91C_EHCI_FRINDEX        EQU (0x0080001C) ;- (UHPHS_EHCI) 
AT91C_EHCI_CONFIGFLAG     EQU (0x00800050) ;- (UHPHS_EHCI) 
AT91C_EHCI_HCCPARAMS      EQU (0x00800008) ;- (UHPHS_EHCI) 
AT91C_EHCI_USBINTR        EQU (0x00800018) ;- (UHPHS_EHCI) 
AT91C_EHCI_PORTSC         EQU (0x00800054) ;- (UHPHS_EHCI) 
AT91C_EHCI_CTRLDSSEGMENT  EQU (0x00800020) ;- (UHPHS_EHCI) 
AT91C_EHCI_VERSION        EQU (0x00800000) ;- (UHPHS_EHCI) 
AT91C_EHCI_USBCMD         EQU (0x00800010) ;- (UHPHS_EHCI) 
AT91C_EHCI_INSNREG04      EQU (0x008000A0) ;- (UHPHS_EHCI) 
AT91C_EHCI_PERIODICLISTBASE EQU (0x00800024) ;- (UHPHS_EHCI) 
AT91C_EHCI_INSNREG01      EQU (0x00800094) ;- (UHPHS_EHCI) 
AT91C_EHCI_HCSPARAMS      EQU (0x00800004) ;- (UHPHS_EHCI) 
AT91C_EHCI_INSNREG05      EQU (0x008000A4) ;- (UHPHS_EHCI) 
AT91C_EHCI_ASYNCLISTADDR  EQU (0x00800028) ;- (UHPHS_EHCI) 
AT91C_EHCI_INSNREG02      EQU (0x00800098) ;- (UHPHS_EHCI) 
// - ========== Register definition for TRNG peripheral ========== 
AT91C_TRNG_IDR            EQU (0xFFFCC014) ;- (TRNG) Interrupt Disable Register
AT91C_TRNG_IER            EQU (0xFFFCC010) ;- (TRNG) Interrupt Enable Register
AT91C_TRNG_VERSION        EQU (0xFFFCC0FC) ;- (TRNG) TRNG Version Register
AT91C_TRNG_ISR            EQU (0xFFFCC01C) ;- (TRNG) Interrupt Status Register
AT91C_TRNG_CR             EQU (0xFFFCC000) ;- (TRNG) Control Register
AT91C_TRNG_ODATA          EQU (0xFFFCC050) ;- (TRNG) Output Data Register
AT91C_TRNG_IMR            EQU (0xFFFCC018) ;- (TRNG) Interrupt Mask Register

