una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam9g45.h
// - *****************************************************************************
// -               PERIPHERAL ID DEFINITIONS FOR AT91SAM9G45
// - *****************************************************************************
AT91C_ID_FIQ              EQU ( 0) ;- Advanced Interrupt Controller (FIQ)
AT91C_ID_SYS              EQU ( 1) ;- System Controller
AT91C_ID_PIOA             EQU ( 2) ;- Parallel IO Controller A
AT91C_ID_PIOB             EQU ( 3) ;- Parallel IO Controller B
AT91C_ID_PIOC             EQU ( 4) ;- Parallel IO Controller C
AT91C_ID_PIOD_E           EQU ( 5) ;- Parallel IO Controller D and E
AT91C_ID_TRNG             EQU ( 6) ;- True Random Number Generator
AT91C_ID_US0              EQU ( 7) ;- USART 0
AT91C_ID_US1              EQU ( 8) ;- USART 1
AT91C_ID_US2              EQU ( 9) ;- USART 2
AT91C_ID_US3              EQU (10) ;- USART 2
AT91C_ID_MCI0             EQU (11) ;- Multimedia Card Interface 0
AT91C_ID_TWI0             EQU (12) ;- TWI 0
AT91C_ID_TWI1             EQU (13) ;- TWI 1
AT91C_ID_SPI0             EQU (14) ;- Serial Peripheral Interface
AT91C_ID_SPI1             EQU (15) ;- Serial Peripheral Interface
AT91C_ID_SSC0             EQU (16) ;- Serial Synchronous Controller 0
AT91C_ID_SSC1             EQU (17) ;- Serial Synchronous Controller 1
AT91C_ID_TC               EQU (18) ;- Timer Counter 0, 1, 2, 3, 4, 5
AT91C_ID_PWMC             EQU (19) ;- Pulse Width Modulation Controller
AT91C_ID_TSADC            EQU (20) ;- Touch Screen Controller
AT91C_ID_HDMA             EQU (21) ;- HDMA
AT91C_ID_UHPHS            EQU (22) ;- USB Host High Speed
AT91C_ID_LCDC             EQU (23) ;- LCD Controller
AT91C_ID_AC97C            EQU (24) ;- AC97 Controller
AT91C_ID_EMAC             EQU (25) ;- Ethernet MAC
AT91C_ID_ISI              EQU (26) ;- Image Sensor Interface
AT91C_ID_UDPHS            EQU (27) ;- USB Device HS
AT91C_ID_MCI1             EQU (29) ;- Multimedia Card Interface 1
AT91C_ID_VDEC             EQU (30) ;- Video Decoder
AT91C_ID_IRQ0             EQU (31) ;- Advanced Interrupt Controller (IRQ0)
AT91C_ALL_INT             EQU (0xEFFFFFFF) ;- ALL VALID INTERRUPTS

// - *****************************************************************************
// -               BASE ADDRESS DEFINITIONS FOR AT91SAM9G45
// - *****************************************************************************
AT91C_BASE_SFR            EQU (0xFFF74000) ;- (SFR) Base Address
AT91C_BASE_SYS            EQU (0xFFFFC000) ;- (SYS) Base Address
AT91C_BASE_EBI            EQU (0xFFFFE200) ;- (EBI) Base Address
AT91C_BASE_DDR2CP1        EQU (0xFFFFE400) ;- (DDR2CP1) Base Address
AT91C_BASE_DDR2C          EQU (0xFFFFE600) ;- (DDR2C) Base Address
AT91C_BASE_SMC            EQU (0xFFFFE800) ;- (SMC) Base Address
AT91C_BASE_MATRIX         EQU (0xFFFFEA00) ;- (MATRIX) Base Address
AT91C_BASE_AIC            EQU (0xFFFFF000) ;- (AIC) Base Address
AT91C_BASE_PDC_DBGU       EQU (0xFFFFEF00) ;- (PDC_DBGU) Base Address
AT91C_BASE_DBGU           EQU (0xFFFFEE00) ;- (DBGU) Base Address
AT91C_BASE_PIOA           EQU (0xFFFFF200) ;- (PIOA) Base Address
AT91C_BASE_PIOB           EQU (0xFFFFF400) ;- (PIOB) Base Address
AT91C_BASE_PIOC           EQU (0xFFFFF600) ;- (PIOC) Base Address
AT91C_BASE_PIOD           EQU (0xFFFFF800) ;- (PIOD) Base Address
AT91C_BASE_PIOE           EQU (0xFFFFFA00) ;- (PIOE) Base Address
AT91C_BASE_PMC            EQU (0xFFFFFC00) ;- (PMC) Base Address
AT91C_BASE_CKGR           EQU (0xFFFFFC1C) ;- (CKGR) Base Address
AT91C_BASE_RSTC           EQU (0xFFFFFD00) ;- (RSTC) Base Address
AT91C_BASE_SHDWC          EQU (0xFFFFFD10) ;- (SHDWC) Base Address
AT91C_BASE_RTTC           EQU (0xFFFFFD20) ;- (RTTC) Base Address
AT91C_BASE_PITC           EQU (0xFFFFFD30) ;- (PITC) Base Address
AT91C_BASE_WDTC           EQU (0xFFFFFD40) ;- (WDTC) Base Address
AT91C_BASE_RTC            EQU (0xFFFFFDB0) ;- (RTC) Base Address
AT91C_BASE_TC0            EQU (0xFFF7C000) ;- (TC0) Base Address
AT91C_BASE_TC1            EQU (0xFFF7C040) ;- (TC1) Base Address
AT91C_BASE_TC2            EQU (0xFFF7C080) ;- (TC2) Base Address
AT91C_BASE_TC3            EQU (0xFFFD4000) ;- (TC3) Base Address
AT91C_BASE_TC4            EQU (0xFFFD4040) ;- (TC4) Base Address
AT91C_BASE_TC5            EQU (0xFFFD4080) ;- (TC5) Base Address
AT91C_BASE_TCB0           EQU (0xFFF7C000) ;- (TCB0) Base Address
AT91C_BASE_TCB1           EQU (0xFFFD4000) ;- (TCB1) Base Address
AT91C_BASE_MCI0           EQU (0xFFF80000) ;- (MCI0) Base Address
AT91C_BASE_MCI1           EQU (0xFFFD0000) ;- (MCI1) Base Address
AT91C_BASE_TWI0           EQU (0xFFF84000) ;- (TWI0) Base Address
AT91C_BASE_TWI1           EQU (0xFFF88000) ;- (TWI1) Base Address
AT91C_BASE_PDC_US0        EQU (0xFFF8C100) ;- (PDC_US0) Base Address
AT91C_BASE_US0            EQU (0xFFF8C000) ;- (US0) Base Address
AT91C_BASE_PDC_US1        EQU (0xFFF90100) ;- (PDC_US1) Base Address
AT91C_BASE_US1            EQU (0xFFF90000) ;- (US1) Base Address
AT91C_BASE_PDC_US2        EQU (0xFFF94100) ;- (PDC_US2) Base Address
AT91C_BASE_US2            EQU (0xFFF94000) ;- (US2) Base Address
AT91C_BASE_PDC_US3        EQU (0xFFF98100) ;- (PDC_US3) Base Address
AT91C_BASE_US3            EQU (0xFFF98000) ;- (US3) Base Address
AT91C_BASE_PDC_SSC0       EQU (0xFFF9C100) ;- (PDC_SSC0) Base Address
AT91C_BASE_SSC0           EQU (0xFFF9C000) ;- (SSC0) Base Address
AT91C_BASE_PDC_SSC1       EQU (0xFFFA0100) ;- (PDC_SSC1) Base Address
AT91C_BASE_SSC1           EQU (0xFFFA0000) ;- (SSC1) Base Address
AT91C_BASE_PWMC_CH0       EQU (0xFFFB8200) ;- (PWMC_CH0) Base Address
AT91C_BASE_PWMC_CH1       EQU (0xFFFB8220) ;- (PWMC_CH1) Base Address
AT91C_BASE_PWMC_CH2       EQU (0xFFFB8240) ;- (PWMC_CH2) Base Address
AT91C_BASE_PWMC_CH3       EQU (0xFFFB8260) ;- (PWMC_CH3) Base Address
AT91C_BASE_PWMC           EQU (0xFFFB8000) ;- (PWMC) Base Address
AT91C_BASE_PDC_SPI0       EQU (0xFFFA4100) ;- (PDC_SPI0) Base Address
AT91C_BASE_PDC_SPI1       EQU (0xFFFA8100) ;- (PDC_SPI1) Base Address
AT91C_BASE_SPI0           EQU (0xFFFA4000) ;- (SPI0) Base Address
AT91C_BASE_SPI1           EQU (0xFFFA8000) ;- (SPI1) Base Address
AT91C_BASE_PDC_TSADC      EQU (0xFFFB0100) ;- (PDC_TSADC) Base Address
AT91C_BASE_TSADC          EQU (0xFFFB0000) ;- (TSADC) Base Address
AT91C_BASE_UDPHS_EPTFIFO  EQU (0x00600000) ;- (UDPHS_EPTFIFO) Base Address
AT91C_BASE_UDPHS_EPT_0    EQU (0xFFF78100) ;- (UDPHS_EPT_0) Base Address
AT91C_BASE_UDPHS_EPT_1    EQU (0xFFF78120) ;- (UDPHS_EPT_1) Base Address
AT91C_BASE_UDPHS_EPT_2    EQU (0xFFF78140) ;- (UDPHS_EPT_2) Base Address
AT91C_BASE_UDPHS_EPT_3    EQU (0xFFF78160) ;- (UDPHS_EPT_3) Base Address
AT91C_BASE_UDPHS_EPT_4    EQU (0xFFF78180) ;- (UDPHS_EPT_4) Base Address
AT91C_BASE_UDPHS_EPT_5    EQU (0xFFF781A0) ;- (UDPHS_EPT_5) Base Address
AT91C_BASE_UDPHS_EPT_6    EQU (0xFFF781C0) ;- (UDPHS_EPT_6) Base Address
AT91C_BASE_UDPHS_DMA_1    EQU (0xFFF78310) ;- (UDPHS_DMA_1) Base Address
AT91C_BASE_UDPHS_DMA_2    EQU (0xFFF78320) ;- (UDPHS_DMA_2) Base Address
AT91C_BASE_UDPHS_DMA_3    EQU (0xFFF78330) ;- (UDPHS_DMA_3) Base Address
AT91C_BASE_UDPHS_DMA_4    EQU (0xFFF78340) ;- (UDPHS_DMA_4) Base Address
AT91C_BASE_UDPHS_DMA_5    EQU (0xFFF78350) ;- (UDPHS_DMA_5) Base Address
AT91C_BASE_UDPHS_DMA_6    EQU (0xFFF78360) ;- (UDPHS_DMA_6) Base Address
AT91C_BASE_UDPHS          EQU (0xFFF78000) ;- (UDPHS) Base Address
AT91C_BASE_PDC_AC97C      EQU (0xFFFAC100) ;- (PDC_AC97C) Base Address
AT91C_BASE_AC97C          EQU (0xFFFAC000) ;- (AC97C) Base Address
AT91C_BASE_LCDC           EQU (0x00500000) ;- (LCDC) Base Address
AT91C_BASE_LCDC_16B_TFT   EQU (0x00500000) ;- (LCDC_16B_TFT) Base Address
AT91C_BASE_HDMA_CH_0      EQU (0xFFFFEC3C) ;- (HDMA_CH_0) Base Address
AT91C_BASE_HDMA_CH_1      EQU (0xFFFFEC64) ;- (HDMA_CH_1) Base Address
AT91C_BASE_HDMA_CH_2      EQU (0xFFFFEC8C) ;- (HDMA_CH_2) Base Address
AT91C_BASE_HDMA_CH_3      EQU (0xFFFFECB4) ;- (HDMA_CH_3) Base Address
AT91C_BASE_HDMA_CH_4      EQU (0xFFFFECDC) ;- (HDMA_CH_4) Base Address
AT91C_BASE_HDMA_CH_5      EQU (0xFFFFED04) ;- (HDMA_CH_5) Base Address
AT91C_BASE_HDMA_CH_6      EQU (0xFFFFED2C) ;- (HDMA_CH_6) Base Address
AT91C_BASE_HDMA_CH_7      EQU (0xFFFFED54) ;- (HDMA_CH_7) Base Address
AT91C_BASE_HDMA           EQU (0xFFFFEC00) ;- (HDMA) Base Address
AT91C_BASE_HECC           EQU (0xFFFFE200) ;- (HECC) Base Address
AT91C_BASE_EMACB          EQU (0xFFFBC000) ;- (EMACB) Base Address
AT91C_BASE_ISI            EQU (0xFFFB4000) ;- (ISI) Base Address
AT91C_BASE_UHPHS_OHCI     EQU (0x00700000) ;- (UHPHS_OHCI) Base Address
AT91C_BASE_UHPHS_EHCI     EQU (0x00800000) ;- (UHPHS_EHCI) Base Address
AT91C_BASE_TRNG           EQU (0xFFFCC000) ;- (TRNG) Base Address

// - *****************************************************************************
// -               MEMORY MAPPING DEFINITIONS FOR AT91SAM9G45
// - *****************************************************************************
// - ITCM
AT91C_ITCM                EQU (0x00100000) ;- Maximum ITCM Area base address
// - DTCM
AT91C_DTCM                EQU (0x00200000) ;- Maximum DTCM Area base address
// - IRAM
AT91C_IRAM                EQU (0x00300000) ;- Maximum Internal SRAM base address
AT91C_IRAM_SIZE           EQU (0x00010000) ;- Maximum Internal SRAM size in byte (64 Kbytes)
// - IRAM_MIN
AT91C_IRAM_MIN            EQU (0x00300000) ;- Minimum Internal RAM base address
AT91C_IRAM_MIN_SIZE       EQU (0x00004000) ;- Minimum Internal RAM size in byte (16 Kbytes)
// - IROM
AT91C_IROM                EQU (0x00400000) ;- Internal ROM base address
AT91C_IROM_SIZE           EQU (0x00010000) ;- Internal ROM size in byte (64 Kbytes)
// - EBI_CS0
AT91C_EBI_CS0             EQU (0x10000000) ;- EBI Chip Select 0 base address
AT91C_EBI_CS0_SIZE        EQU (0x10000000) ;- EBI Chip Select 0 size in byte (262144 Kbytes)
// - EBI_CS1
AT91C_EBI_CS1             EQU (0x20000000) ;- EBI Chip Select 1 base address
AT91C_EBI_CS1_SIZE        EQU (0x10000000) ;- EBI Chip Select 1 size in byte (262144 Kbytes)
// - EBI_SDRAM
AT91C_EBI_SDRAM           EQU (0x20000000) ;- SDRAM on EBI Chip Select 1 base address
AT91C_EBI_SDRAM_SIZE      EQU (0x10000000) ;- SDRAM on EBI Chip Select 1 size in byte (262144 Kbytes)
// - EBI_SDRAM_16BIT
AT91C_EBI_SDRAM_16BIT     EQU (0x20000000) ;- SDRAM on EBI Chip Select 1 base address
AT91C_EBI_SDRAM_16BIT_SIZE EQU (0x02000000) ;- SDRAM on EBI Chip Select 1 size in byte (32768 Kbytes)
// - EBI_SDRAM_32BIT
AT91C_EBI_SDRAM_32BIT     EQU (0x20000000) ;- SDRAM on EBI Chip Select 1 base address
AT91C_EBI_SDRAM_32BIT_SIZE EQU (0x04000000) ;- SDRAM on EBI Chip Select 1 size in byte (65536 Kbytes)
// - EBI_CS2
AT91C_EBI_CS2             EQU (0x30000000) ;- EBI Chip Select 2 base address
AT91C_EBI_CS2_SIZE        EQU (0x10000000) ;- EBI Chip Select 2 size in byte (262144 Kbytes)
// - EBI_CS3
AT91C_EBI_CS3             EQU (0x40000000) ;- EBI Chip Select 3 base address
AT91C_EBI_CS3_SIZE        EQU (0x10000000) ;- EBI Chip Select 3 size in byte (262144 Kbytes)
// - EBI_SM
AT91C_EBI_SM              EQU (0x40000000) ;- NANDFLASH on EBI Chip Select 3 base address
AT91C_EBI_SM_SIZE         EQU (0x10000000) ;- NANDFLASH on EBI Chip Select 3 size in byte (262144 Kbytes)
// - EBI_CS4
AT91C_EBI_CS4             EQU (0x50000000) ;- EBI Chip Select 4 base address
AT91C_EBI_CS4_SIZE        EQU (0x10000000) ;- EBI Chip Select 4 size in byte (262144 Kbytes)
// - EBI_CF0
AT91C_EBI_CF0             EQU (0x50000000) ;- CompactFlash 0 on EBI Chip Select 4 base address
AT91C_EBI_CF0_SIZE        EQU (0x10000000) ;- CompactFlash 0 on EBI Chip Select 4 size in byte (262144 Kbytes)
// - EBI_CS5
AT91C_EBI_CS5             EQU (0x60000000) ;- EBI Chip Select 5 base address
AT91C_EBI_CS5_SIZE        EQU (0x10000000) ;- EBI Chip Select 5 size in byte (262144 Kbytes)
// - EBI_CF1
AT91C_EBI_CF1             EQU (0x60000000) ;- CompactFlash 1 on EBIChip Select 5 base address
AT91C_EBI_CF1_SIZE        EQU (0x10000000) ;- CompactFlash 1 on EBIChip Select 5 size in byte (262144 Kbytes)
// - DDR2
AT91C_DDR2                EQU (0x70000000) ;- DDR2/LPDDR space base address
AT91C_DDR2_SIZE           EQU (0x10000000) ;- DDR2/LPDDR space size in byte (262144 Kbytes)
#endif /* __IAR_SYSTEMS_ASM__ */


#endif /* AT91SAM9G45_H */
